{"events":[{"created":1497737281000,"duration":18000000,"id":"240873748","name":"Google Cloud Summer Party","date_in_series_pattern":false,"status":"past","time":1498748400000,"local_date":"2017-06-29","local_time":"17:00","updated":1498768543000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":1,"venue":{"id":24234187,"name":"betahaus","lat":52.5025634765625,"lon":13.412144660949707,"repinned":false,"address_1":" Prinzessinnenstraße 19-20 10969 ","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/240873748/","description":"<p>Hey y'all, summer is here! Join us in Betahaus on June 29th to share some beers and good DJ music, in the best Berlin style. </p> <p>We will kick off with a ML presentation from Merantix and a bit of real-world Kubernetes from the trenches with GoEuro. Burgers, drinks and DJ are waiting for you afterwards. Registration will start from 5:00 pm, and talks start at 5:30 pm. </p> <p><b>This time this meetup will not be tracked using Meetup RSVPs</b>. Want to join? Please <a href=\"https://goo.gl/STb7Do\">register here</a>, seats are limited.</p> <p>Oh yes, we will fix that for the next :)</p> ","visibility":"public","member_pay_fee":false},{"created":1497857154000,"id":"240903583","name":"Open Source Stack for Machine Learning and Cloud Functions for Firebase","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1501088400000,"local_date":"2017-07-26","local_time":"19:00","updated":1513246348000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":50,"venue":{"id":25311614,"name":"Endocode Office","lat":52.51301193237305,"lon":13.417970657348633,"repinned":false,"address_1":"Brückenstraße 5A, 10179 ","city":"Berlin","country":"de","localized_country_name":"Germany","phone":"+4930 12064472"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/240903583/","manual_attendance_count":25,"description":"<p>Hi everyone!</p> <p>For our July Meetup we would like to invite you for some great talks about Open Source Stack for Machine Learning and Cloud Functions for Firebase. Check out the agenda below:</p> <p>Agenda: </p> <p>6:45 - 7:00 pm: Welcome to the meetup, grab some food </p> <p>7:00 - 7:45 pm:</p> <p>Open Source Stack for Machine Learning on Source Code - Vadim Markovtsev</p> <p>7:45 - 8:30 pm: Cloud Functions for Firebase - Tim Messerschmidt </p> <p>From 8:30 pm: Networking, stay for some drinks </p> <p>Talks: </p> <p>Open Source Stack for Machine Learning on Source Code</p> <p><a href=\"https://sourced.tech\">source{d}</a>, a startup in Madrid, has recently released a number of advanced open source projects related to machine learning on the world’s source code. Vadim's talk will give an overview over open source tools such as  <a href=\"https://github.com/bblfsh\">Babelfish</a> ,  <a href=\"https://github.com/src-d/ast2vec\">ast2vec</a> or <a href=\"https://github.com/src-d/vecino\">vecino</a> and will show us how to use some.  <b>Cloud Functions for Firebase </b></p> <p>In this session, Tim will be introducing us to Cloud Functions for Firebase. By going through a simple step-by-step example, he'll demonstrate how to react to events triggered through HTTPS requests and Firebase.</p> <p>Speakers: </p> <p><b>Vadim Markovtsev</b></p> <p>is a Lead Machine Learning Engineer at <a href=\"https://sourced.tech\">source{d} </a>where he works on deep neural networks that aim to understand all of the world’s developers through their code. He is one of the creators of the distributed deep learning platform <a href=\"https://velesnet.ml\">Veles</a> while working for Samsung and was responsible for the machine learning efforts to fight email spam at Mail.Ru - the largest email service in Russia. You can find Vadim on GitHub (vmarkovtsev) and HackerRank (markhor) and read some of his technical articles on <a href=\"https://blog.sourced.tech/\">blog.sourced.tech</a>.</p> <p><b>Tim Messerschmidt</b> </p> <p>oversees the German-speaking countries as Regional Lead for Google's Developer Relations team. When not working with Android, he loves working with Node.js, and researching user authentication concepts. Recently, Tim authored a book about identity concepts and data security for O'Reilly. Before joining Google, Tim ran PayPal's Developer Relations team across EMEA and APAC.</p> ","visibility":"public","member_pay_fee":false},{"created":1503312087000,"id":"242709072","name":"Containers in CI/CD Systems","rsvp_limit":95,"date_in_series_pattern":false,"status":"past","time":1505322000000,"local_date":"2017-09-13","local_time":"19:00","updated":1512808825000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":70,"venue":{"id":25014158,"name":"Delivery Hero","lat":52.52470016479492,"lon":13.392925262451172,"repinned":false,"address_1":"Oranienburger Straße 70","city":"10117 Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/242709072/","manual_attendance_count":42,"description":"<p>Hi everyone, </p> <p>as expected we are taking a \"summer\" (if that is what we're calling it) break and will be back in September with the next GDG Berlin Cloud Meetup. Delivery Hero are kind enough to host the Meetup on the 13th of September. </p> <p>We know that September can be a busy month with everyone coming back after a summer holiday, so we want to give you the chance to safe the date already.</p> <p>Having discussed possible topics in the last session, we will hear talks about containers in CI/CD systems and a real use case of Kubernetes in production. </p> <p>You can find the information below. </p> <p><b>Agenda</b></p> <p>6:45 - 7:00 pm: Welcome to the meetup, grab some food and drinks</p> <p>7:00 - 7:45 pm: Adding containers in your CI/CD systems - Nacho Coloma</p> <p>7:45 - 8:30 pm: Package management with Helm at immmr - Jannis Rake-Revelant, Julian Strobl </p> <p>From 8:30 pm: Networking, stay for some drinks </p> <p><b>Abstracts:</b> </p> <p><b>Adding containers in your CI/CD systems</b> - Nacho Coloma</p> <p>There are common questions around container management and deployment. What does a development and deployment workflow look like in a containerized world? What are my artifacts? How do I build them? Where do I store them? In this session, we'll walk you through the end-to-end workflow for building cloud applications on Google Cloud Platform by configuring a Jenkins environment and leveraging Google Container Engine, Container Builder, and the Google Container Registry. You'll also have the chance to explore cloud-native applications so you can get the most out of building on Google Cloud Platform.</p> <p>Nacho Coloma is Customer Engineer at Google, where he helps companies of all sizes to migrate their systems to Google Cloud Platform. He holds a M.S. in Computer Science and has more than 15 years of experience designing applications. Nacho is passionate about containers, web technologies, and above all, pie charts. Pie charts are the best.</p> <p><b>Package management with Helm at immmr</b> - Jannis Rake-Revelant, Julian Strobl </p> <p>immmr is a communication app which lets you connect on any device, anywhere, with anyone. For our backend and web services we rely on production and staging Kubernetes clusters on AWS. In the past, one of the main pain points was the consistency of microservice versions and their configurations across environments. We are solving these using Helm and Jenkins, bringing the configuration closer to the developer and automating all deployments from development to production.</p> <p>Jannis Rake-Revelant is the Vice President of IT Operations, QA and Security at immmr. He has been working with Kubernetes before 1.0 and spearheaded the use of it for immmr’s production. Jannis is passionate about distributed systems and automation of „all the things“.</p> <p>Julian works as Security and Operations Engineer at immmr GmbH. With a strong security and cryptography background, he builds andmanages Kubernetes clusters for development and production since dayone, always trying to stay up to date with the latest Kubernetes features.</p> <p>We are looking forward to seeing you all in September, until then, have a sunny August!</p> ","visibility":"public","member_pay_fee":false},{"created":1508925398000,"id":"244507776","name":"2017 ❤️ Big Data","date_in_series_pattern":false,"status":"past","time":1511978400000,"local_date":"2017-11-29","local_time":"19:00","updated":1512808742000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":72,"venue":{"id":24522676,"name":"AppLift Berlin HQ","lat":52.52146911621094,"lon":13.40553092956543,"repinned":false,"address_1":"Rosenstraße 17, 10178 Berlin","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/244507776/","manual_attendance_count":35,"description":"<p>Hi everyone, </p> <p>we're slowly wrapping up this year and would like to get together before everyone is busy in their Christmas celebrations and off for holidays. So in our last meetup of this year we would like to talk about Big Data. </p> <p><a href=\"https://www.applift.com/\">AppLift</a> will be hosting us at their office in Mitte and we are starting at our usual time. Some infos are not yet finalized, but we will update them asap.</p> <p>Check out our agenda below. </p> <p><b>Agenda:</b></p> <p>6:45 - 7:00 pm: Welcome to the meetup, grab some food and drinks</p> <p>7:00 - 7:45 pm: Overcoming Big Data Challenges with GCP - Uzi Blum</p> <p>7:45 - 8:30 pm: Rebuilding the Google Analytics Active Users Report with BigQuery - Martin Weitzmann</p> <p>From 8:30 pm: Networking, stay for some drinks </p> <p><b>Abstracts:</b></p> <p><b>Overcoming Big Data Challenges with GCP - Uzi Blum</b></p> <p>Uzi will present how they have overcome technology obstacle for data driven decisions using Big Query. Data warehouse on cloud and in particularly Big Query is a very strong trend that enable tech and business users to do more in less time. With the addition of data studio this becomes a lethal  BI+DWH machine!</p> <p>Uzi is VP Business intelligence and analytics at AppLift. He enable tactic and strategic decision making by allowing easy access to data. He also responsible for optimization and recommendation engines  models as well develop data driven products. Prior to AppLift, Uzi was managing the New York office of a data intelligence consulting company called Keyrus. Uzi is passion about big data and over the years was working with variety of Big data tools such as Hadoop, Vertica, Greenplum, redshift and big query. Theses days Uzi's challenges is how to make a true business impact to Applift from data and analytics.</p> <p><b>Rebuilding the Google Analytics Active Users Report with BigQuery</b> - Martin Weitzmann</p> <p>The Active Users Report provides us with a rolling daily sum of users over different time windows: 1 day, 7 days, 14 days and 30 days. Let's build a query in standard SQL that can do just that!</p> <p>Martin is a Senior Digital Analyst at Zalando in Berlin.  </p> <p>Hope to see you all there! </p> ","visibility":"public","member_pay_fee":false},{"created":1517928353000,"duration":10800000,"id":"247543721","name":"Cloud Study Jam ","rsvp_limit":45,"date_in_series_pattern":false,"status":"past","time":1521651600000,"local_date":"2018-03-21","local_time":"18:00","updated":1521717749000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":30,"venue":{"id":25311614,"name":"Endocode Office","lat":52.51301193237305,"lon":13.417970657348633,"repinned":false,"address_1":"Brückenstraße 5A, 10179 ","city":"Berlin","country":"de","localized_country_name":"Germany","phone":"+4930 12064472"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/247543721/","manual_attendance_count":20,"description":"<p>Want to get started on the Google Cloud, but don't know where to begin?</p> <p>Join us for our Cloud Study Jam! Together we'll work through three Google Cloud Platform Essentials labs, then you will get free access to the next quest so you can finish this series of labs at home to get a Google-hosted badge for your online profile. You will be able to get hands-on experience with Docker, Kubernetes and Scientific Data Processing, which will earn you additional badges.<br/>Join this meetup to get official Google training, a $70+ value, free of charge.</p> <p>Agenda:<br/>6:00pm: Three Google Cloud Platform Essentials labs<br/>7:30pm: Break<br/>8:00pm: Intro to Docker or Scientific Data Processing lab<br/>9:00pm: Event ends</p> <p>After that, please linger for some networking and drinks!</p> <p>What you should bring along:<br/>Bring a laptop (PC, Mac or Chromebook)! The labs will run on all of the latest versions of the popular browsers. For the best experience, make sure your laptop has Firefox or Chrome installed.</p> ","visibility":"public","member_pay_fee":false},{"created":1530275395000,"duration":9000000,"id":"252269854","name":"Machine Learning in the cloud and stateful apps in k8s","rsvp_limit":50,"date_in_series_pattern":false,"status":"past","time":1531413000000,"local_date":"2018-07-12","local_time":"18:30","updated":1535540000000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":38,"venue":{"id":24148492,"name":"Omio","lat":52.530738830566406,"lon":13.410996437072754,"repinned":false,"address_1":"Schönhauser Allee 180","city":"10119 Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/252269854/","manual_attendance_count":42,"description":"<p>Hi everyone,</p> <p>In this meetup we would like to talk about Machine Learning.</p> <p>GoEuro (<a href=\"https://www.goeuro.com/\" class=\"linkified\">https://www.goeuro.com/</a>) will be hosting us at their office in Prenzlauer Berg and we are starting at our usual time. Some infos are not yet finalized, but we will update them asap.</p> <p>Check out our agenda below.</p> <p>Agenda:</p> <p>6:45 - 7:00 pm: Welcome to the meetup, grab some food and drinks</p> <p>7:00 - 7:45 pm: Hotdog or Not Hotdog: training and serving a Tensorflow model in Google Cloud Platform - Ed Medvedev</p> <p>7:45 - 8:30 pm: Learnings from running Stateful Applications in Kubernetes - Lorenzo Fundaro</p> <p>From 8:30 pm: Networking, stay for some drinks</p> <p>Abstracts:</p> <p>Hotdog or Not Hotdog: training and serving a Tensorflow model in Google Cloud Platform - Ed Medvedev</p> <p>Let's talk machine learning in the cloud! Ed Medvedev (@ohaithear) is going to use a simple binary classifier of hotdogs to give a brief overview of the ML capabilities of Google Cloud Platform: simple training, distributed training, and serving.</p> <p>Tensorflow knowledge is not required, as we'll also talk about reusing existing models, although some basic familiarity is recommended.</p> <p>Learnings from running Stateful Applications in Kubernetes - Lorenzo Fundaro</p> <p>Over the last two years we’ve collected some learnings about running Stateful Applications (e.g. Elasticsearch, Couchbase, Cassandra, Graphite, etc.) in Kubernetes we’d like to share with community.<br/>We’ll also talk about possible alternatives as well as particular implementations and best practices.</p> <p>Hope to see you all there!</p> ","visibility":"public","member_pay_fee":false},{"created":1537946899000,"duration":7200000,"id":"255017645","name":"Developing on Google Assistant","rsvp_limit":50,"date_in_series_pattern":false,"status":"past","time":1544029200000,"local_date":"2018-12-05","local_time":"18:00","updated":1544041030000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":45,"venue":{"id":25014158,"name":"Delivery Hero","lat":52.52470016479492,"lon":13.392925262451172,"repinned":true,"address_1":"Oranienburger Straße 70","city":"10117 Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/255017645/","description":"<p>Hi everyone,</p> <p>In this meetup we would like to talk about Google assistant.</p> <p>This time the event will take place in Delivery Hero HQ in Mitte.</p> <p>Please notice that we are starting at 18:00 (winter time!) which is a bit earlier than usual.</p> <p>Check out our agenda below.</p> <p>Agenda:</p> <p>6:00 - 6:30 pm: Welcome to the meetup, grab some food and drinks</p> <p>6:30 - 7:10 pm: Going beyond ‘Hey Google’: building a Rasa-powered Google Assistant - Justina Petraityte, Developer Advocate at Rasa</p> <p>7:10 - 7:50 pm: 5 lessons we have learned the hard way developing for Google Assistant - Aleksey Novykov, Product Manager at Delivery Hero and Valentin Rodygin, Principal Software Engineer at Delivery Hero</p> <p>From 7:50 pm: Networking, stay for some drinks</p> <p>Abstracts:</p> <p>Going beyond ‘Hey Google’: building a Rasa-powered Google Assistant - Justina Petraityte, Developer Advocate at Rasa</p> <p>In this talk, Justina will show you how you can enable your Google Assistant to handle deeper and more natural conversations by integrating it with the open source Rasa Stack. You will learn about the Rasa Stack, the machine learning behind its NLU and dialogue management models and how you can integrate a Rasa-powered assistant to Google Assistant make it more conversational.</p> <p>5 lessons we have learned the hard way developing for Google Assistant<br/>Aleksey Novykov, Product Manager at Delivery Hero and Valentin Rodygin, Principal Software Engineer at Delivery Hero</p> <p>As it often happens with newly emerging technologies, the path of a developer for Google Assistant is not an easy one. Lack of support and documentation, missing tools, breaking changes. We are happy to share what we have learned from building a b2c eCommerce Action on Google for foodora.</p> <p>Last but not least, we teamed up for this Meetup with Codemotion, the largest tech conference for software developers in EMEA. And we're happy to provide a discount code to our community: COMMUNITY_GDGBERLINCLOUD will give you 20% off of all tickets! 👉 <a href=\"https://berlin2018.codemotionworld.com/\" class=\"linkified\">https://berlin2018.codemotionworld.com/</a></p> <p>Hope to see you all there!</p> ","visibility":"public","member_pay_fee":false},{"created":1551280529000,"duration":10800000,"id":"259328669","name":"Tensorflow night","date_in_series_pattern":false,"status":"past","time":1553018400000,"local_date":"2019-03-19","local_time":"19:00","updated":1553068885000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":111,"venue":{"id":26207571,"name":"Omio","lat":52.53084945678711,"lon":13.410922050476074,"repinned":true,"address_1":"Schönhauser Allee 180","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/259328669/","manual_attendance_count":55,"description":"<p>Wanna know how to run Tensorflow in production effectively? How to customize your input pipeline?</p> <p>In this event we will have three experienced Tensorflow Engineers sharing their insights. The event will take place at Omio, (thanks for hosting us )</p> <p>Come and join for the tensorflow night!</p> <p>Agenda:</p> <p>6:45 - 7:00 pm: Welcome to the meetup, grab some food and drinks</p> <p>7:00 - 7:20 pm: Tensorflow Serving - Brecht Coghe</p> <p>7:30 - 7:50 pm: Tensorflow Dataset api - Victor Sonck</p> <p>8:00 - 8:20 pm: Tensorflow Records - Ron Hagensieker</p> <p>From 8:30 pm: Networking, stay for some drinks</p> <p>TF Serving<br/>Tensorflow is nice for doing research, however, one of the main advantages of the Tensorflow framework over other ML frameworks is it's ecosystem that easily allows for running your code in production. That is why we want to show you how to make use of tf serving.</p> <p>TF Dataset api<br/>Most of the Tf users are familiar with creating models and running training by now. What people are more unaware of is the tf dataset api. With this module, tf allows for preprocessing, preloading and customizing your input pipeline for training your models.</p> <p>TF Records<br/>Tensorflow's recommended way to store data on disk is as binary TFRecords file. This is a logical data source to transfer data into Tf's own Dataset objects and especially handy for storing training data. Best practices and recommended workflows are presented in this talk to make most use of this file format.</p> <p>Brecht Coghe<br/>After his master in AI and being a PhD candidate at the KU Leuven, Brecht started working as an ML Engineer at ML6. He works on multiple projects creating insights for the customer and building intelligent solutions that tackle the customer’s immediate business needs. Next to these projects, Brecht is also active in Applied Machine Learning research that focuses on improving current logistic tools.</p> <p>Victor Sonck<br/>Victor is a machine learning engineer working mainly on computer vision and image recognition, as well as getting these solutions to work as fast as possible on the edge. Additionally, he's dabbled in genetic algorithms and reinforcement learning.</p> <p>Ron Hagensieker<br/>A learned geographer, Ron entered the domain of machine learning through image recognition tasks in satellite remote sensing. After finishing his PhD thesis on the classification of deforestation sites, he worked in positions as remote sensing engineer and data science consultant before starting at ML6. There he joined as machine learning engineer at the recently founded branch in Berlin.</p> ","visibility":"public","member_pay_fee":false},{"created":1560944897000,"duration":34200000,"id":"262442502","name":"Google Cloud Developer Roadshow","date_in_series_pattern":false,"status":"past","time":1562050800000,"local_date":"2019-07-02","local_time":"09:00","updated":1562087499000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":19,"venue":{"id":26465572,"name":"ALICE Rooftop & Garden","lat":52.50608444213867,"lon":13.324484825134277,"repinned":false,"address_1":"Kantstraße 17","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/262442502/","description":"<p>Hey everyone,</p> <p>while we are busy enjoying the summer and preparing for some hands-on study sessions in early autumn, we wanted to invite you all to the Google Cloud Developer Roadshow that Google for Startups is hosting on the 2nd of July in Berlin.</p> <p>The full-day event offers talks on running efficient and scalable infrastructure and deploying state-of-the-art machine learning models. We have been offered some seats for the GDG Cloud community, so if you are interested, please register on the event website, as seats are limited:</p> <p><a href=\"https://events.withgoogle.com/google-cloud-developer-roadshow/\" class=\"linkified\">https://events.withgoogle.com/google-cloud-developer-roadshow/</a></p> <p>See you soon!</p> ","how_to_find_us":"\n","visibility":"public","member_pay_fee":false},{"created":1565181514000,"duration":10800000,"id":"263803290","name":"Cloud Study Jam: Machine Learning and Data Quests","rsvp_limit":70,"date_in_series_pattern":false,"status":"past","time":1567699200000,"local_date":"2019-09-05","local_time":"18:00","updated":1567717357000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":70,"venue":{"id":26207384,"name":"Google","lat":52.523101806640625,"lon":13.392306327819824,"repinned":true,"address_1":"Tucholskystraße 2","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/263803290/","description":"<p>Want to get started with Machine learning on Google Cloud, but don't know where to begin?</p> <p>Join a community of like-minded developers and explore the latest Google Cloud technologies as a team.<br/>Join us for our upcoming Cloud Study Jam and get hands-on experience with Machine learning and Data in GCP.</p> <p>After the Study Jam, you’ll receive 30-days free access to the entire Qwiklabs catalogue, so you can keep developing your skills at home. Complete all of the labs in the session’s quest, and you’ll earn an additional free month of access to Qwiklabs as well as a badge for your online profile.</p> <p>Agenda:<br/>6:00pm: Quick intro<br/>6:15pm: We start the first quest<br/>7:15pm: Break, networking, drinks<br/>7:45pm: Continue the baseline quests or start an advance one<br/>9:00pm: Event ends</p> <p>What you should bring along:</p> <p>Bring a laptop and charger (PC, Mac or Chromebook)! The labs will run on all of the latest versions of popular browsers. For the best experience, make sure your laptop has Firefox or Chrome installed. Don’t forget your charger.</p> <p>In order to access the venue, it is required that you also register (your first and last name) through this form:</p> <p><a href=\"https://forms.gle/FnS953KPXuZVBxXZA\" class=\"linkified\">https://forms.gle/FnS953KPXuZVBxXZA</a></p> <p>See you in a bit!</p> ","visibility":"public","member_pay_fee":false},{"created":1569259530000,"duration":10800000,"id":"265097069","name":"Firebase CTO & Developer Meetup","rsvp_limit":2,"date_in_series_pattern":false,"status":"past","time":1570032000000,"local_date":"2019-10-02","local_time":"18:00","updated":1570047714000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":2,"venue":{"id":26207384,"name":"Google","lat":52.523101806640625,"lon":13.392306327819824,"repinned":true,"address_1":"Tucholskystraße 2","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/265097069/","description":"<p>Hey cloud developers,</p> <p>I would like to invite you, on behalf of Google Cloud for Startups, to attend our Firebase meetup for Berlin startups.</p> <p>Join us on Wednesday, October 2nd at Google Berlin from 18:00 to 21:00 for food, drink, and a great conversation from Ali Satter and Mike Davies - Google Product Managers - about Firebase.</p> <p>Agenda:</p> <p>18:00 | Registration and Welcome<br/>18:30 | Talk and Q&amp;A with Ali Satter and Mike Davies on Firebase<br/>20:00 | Wrap-up from the Google Cloud for Startups team<br/>20:15 | Networking &amp; Conversation - Drinks &amp; Fingerfood</p> <p>About the Speakers</p> <p>Ali Satter is a Product Manager for Firebase Cloud Messaging, and Firebase In-App Messaging. Prior to joining Google, Ali was a Program Manager at Microsoft working on Visual Studio &amp; developer tools, and as a Software Developer at Yahoo! Inc working on Yahoo’s media platform.</p> <p>Mike Davies is a Product Manager working on the Firebase developer platform. His background includes building startups across many sectors, including finance, travel, logistics, and retail.</p> <p>Come join our team and your fellow Google Cloud for Startups program members for a great talk and conversation at Google!</p> <p>Please find more details and register in this url:<br/><a href=\"https://events.withgoogle.com/firebase-cto-meetup-berlin/\" class=\"linkified\">https://events.withgoogle.com/firebase-cto-meetup-berlin/</a></p> <p>See you soon!</p> ","how_to_find_us":"\n","visibility":"public","member_pay_fee":false},{"created":1570390495000,"duration":46800000,"id":"265458247","name":"DevFest Berlin 2019","rsvp_limit":1,"date_in_series_pattern":false,"status":"past","time":1573286400000,"local_date":"2019-11-09","local_time":"09:00","updated":1573335105000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":0,"venue":{"id":26328676,"name":"Zalando BHQ-X","lat":52.50631332397461,"lon":13.441248893737793,"repinned":true,"address_1":"Valeska-Gert-Straße 5","city":"Berlin","country":"de","localized_country_name":"Germany"},"group":{"created":1497629325000,"name":"GDG Berlin Cloud","id":24501475,"join_mode":"open","lat":52.52000045776367,"lon":13.380000114440918,"urlname":"Cloud-GDG-Berlin","who":"Devop'ers","localized_location":"Berlin, Germany","state":"","country":"de","region":"en_US","timezone":"Europe/Berlin"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/events/265458247/","description":"<p>The GDG DevFest is back to Berlin - a one-day 2-track conference to celebrate the various Google Developer Groups communities!</p> <p>There will be childcare throughout the day, as well as an after party nearby.</p> <p>The CFP is open until Sunday 27/10/[masked]:30 CET<br/><a href=\"https://www.papercall.io/devfest-berlin-2019\" class=\"linkified\">https://www.papercall.io/devfest-berlin-2019</a></p> <p>RSVP is not possible a separate ticket must be purchased here:<br/><a href=\"https://www.eventbrite.co.uk/e/devfest-berlin-2019-tickets-74971390447\" class=\"linkified\">https://www.eventbrite.co.uk/e/devfest-berlin-2019-tickets-74971390447</a></p> ","visibility":"public","member_pay_fee":false}],"upcoming":[],"organizers":[{"id":191031375,"name":"Jose A M.","status":"active","joined":1439010678000,"city":"Berlin","country":"de","localized_country_name":"Germany","lat":52.52,"lon":13.38,"photo":{"id":248627157,"highres_link":"https://secure.meetupstatic.com/photos/member/b/8/3/5/highres_248627157.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/b/8/3/5/member_248627157.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/b/8/3/5/thumb_248627157.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1573709702000,"created":1500796967000,"updated":1505224642000,"role":"coorganizer","group":{"id":24501475,"urlname":"Cloud-GDG-Berlin","name":"GDG Berlin Cloud","status":"active","who":"Devop'ers","members":644,"join_mode":"open","localized_location":"Berlin, Germany"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/members/191031375/"},"is_pro_admin":false},{"id":199355271,"name":"Lisa N.","status":"active","joined":1454924690000,"city":"Berlin","country":"de","localized_country_name":"Germany","lat":52.52,"lon":13.38,"photo":{"id":274498199,"highres_link":"https://secure.meetupstatic.com/photos/member/e/3/5/7/highres_274498199.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/e/3/5/7/member_274498199.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/e/3/5/7/thumb_274498199.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1567699046000,"created":1497786516000,"updated":1556618697000,"role":"organizer","group":{"id":24501475,"urlname":"Cloud-GDG-Berlin","name":"GDG Berlin Cloud","status":"active","who":"Devop'ers","members":644,"join_mode":"open","localized_location":"Berlin, Germany"},"link":"https://www.meetup.com/Cloud-GDG-Berlin/members/199355271/"},"is_pro_admin":false}]}
