[{"created":1548354430000,"duration":14400000,"id":"258361354","name":"Workshop - Mobile Vision Made Easy","rsvp_limit":40,"date_in_series_pattern":false,"status":"past","time":1551537000000,"local_date":"2019-03-02","local_time":"14:30","updated":1551555862000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":20,"venue":{"id":26113203,"name":"Politécnico de Leiria | ESTG - Escola Superior de Tecnologia e Gestão_Edifício D","lat":39.734466552734375,"lon":-8.821044921875,"repinned":true,"address_1":"Edifício D","city":"Leiria","country":"pt","localized_country_name":"Portugal"},"group":{"created":1542362794000,"name":"GDG Leiria","id":30537315,"join_mode":"open","lat":39.75,"lon":-8.800000190734863,"urlname":"GDG-Leiria","who":"Members","localized_location":"Leiria, Portugal","state":"","country":"pt","region":"en_US","timezone":"Europe/Lisbon"},"link":"https://www.meetup.com/GDG-Leiria/events/258361354/","description":"<p>⚠️[Obrigatório!] Garante já o teu bilhete* em: <a href=\"https://ti.to/gdg-leiria/mobile-vision-made-easy\" class=\"linkified\">https://ti.to/gdg-leiria/mobile-vision-made-easy</a> , só 40 disponíveis!!⚠️</p> <p>*Em caso de desistência, por favor, cancelar o bilhete, de forma a dar possibilidade a interessados!</p> <p>🇵🇹Aproveitar o potencial das APIs do Google Vision para desenvolver apps poderosas para Android</p> <p>José Ribeiro é professor adjunto e investigador do departamento de Engenharia Informática do Politécnico de Leiria. A sua investigação foca-se em Software Testing e Algoritmos Evolucionários, mas também é um entusiasta sobre Sistemas Sensíveis ao Contexto e Cognitive Computing.</p> <p>Neste workshop os participantes serão introduzidos às APIs da Google Vison -- ML Kit, Cloud Vision e AutoML Vision -- e aprender como podem aumentar o potencial destas ferramentas de Cognitive Computing para desenvolver aplicações Android mais cativantes, personalizadas e úteis.</p> <p>ML Kit [1] vem com um conjunto de APIs prontas a utilizar para casos de uso comuns em dispositivos móveis: reconhecimento de texto, detecção facial, identificação de pontos de referência, ler códigos de barras e categorizar imagens. As APIs “no dispositivo” do ML Kit conseguem processar os dados de forma rápida e funcionar ainda quando não existe conexão à internet.</p> <p>Cloud Vision API [2] permite aos desenvolvedores perceber o conteúdo de uma imagem através do encapsulamento de modelos de machine learning poderosos, numa API de utilização fácil. Utiliza o poder computacional da plataforma de machine learning Google Cloud para permitir um maior nível de precisão e rapidamente categoriza imagens em milhares de categorias, detectando objetos individuais e caras contidas nessas imagens e ainda consegue ler palavras impressas, contidas numa imagem.</p> <p>AutoML Vision [3] permite aos desenvolvedores limitados em experiência com machine learning, treinar modelos personalizados com alta qualidade. Após o upload e caracterização das imagens, o AutoML Vision vai treinar um modelo que consegue escalar conforme as necessidades de forma a adaptar-se às mesmas, oferecendo ainda maior precisão do modelo e menor tempo para criar um modelo pronto para produção.</p> <p>🇬🇧Mobile Vision Made Easy: leveraging the potential of Google’s Vision APIs to develop powerful Android apps</p> <p>José Ribeiro is an Adjunct Professor and a Researcher at the Department of Computer Engineering of the Polytechnic Institute of Leiria, Portugal. His research focuses on Software Testing and Evolutionary Algorithms, but he is also strongly passionate about Context-Aware Systems and Cognitive Computing.</p> <p>In this Workshop you will be introduced to Google’s Vision APIs -- ML Kit, Cloud Vision, and AutoML Vision -- and learn how to leverage the potential of these Cognitive Computing tools to develop more engaging, personalized, and helpful Android apps.</p> <p>ML Kit [1] comes with a set of ready-to-use APIs for common mobile use cases: recognizing text, detecting faces, identifying landmarks, scanning barcodes, and labeling images. ML Kit’s on-device APIs can process your data quickly and work even when there’s no network connection.</p> <p>Cloud Vision API [2] enables developers to understand the content of an image by encapsulating powerful machine learning models in an easy-to-use API. It uses the power of Google Cloud Platform's machine learning technology to give you an even higher level of accuracy, and quickly classifies images into thousands of categories, detects individual objects and faces within images, and reads printed words contained within images.</p> <p>AutoML Vision [3] makes it possible for developers with limited machine learning expertise to train high-quality custom models. After uploading and labeling images, AutoML Vision will train a model that can scale as needed to adapt to demands. AutoML Vision offers higher model accuracy and faster time to create a production-ready model.<br/>[1] <a href=\"https://firebase.google.com/docs/ml-kit/\" class=\"linkified\">https://firebase.google.com/docs/ml-kit/</a><br/>[2] <a href=\"https://cloud.google.com/vision/docs/\" class=\"linkified\">https://cloud.google.com/vision/docs/</a><br/>[3] <a href=\"https://cloud.google.com/vision/automl/docs/\" class=\"linkified\">https://cloud.google.com/vision/automl/docs/</a></p> ","visibility":"public"}]