[{"created":1548705437000,"duration":7200000,"id":"258475774","name":"Relanzamiento del GDG San Salvador. Firebase ML Kit, Android Jetpack y Kotlin.","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1549582200000,"local_date":"2019-02-07","local_time":"17:30","rsvp_open_offset":"PT80H30M","updated":1549594983000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":70,"venue":{"id":26124328,"name":"Banco Agricola Operations Center","lat":13.700606346130371,"lon":-89.22711944580078,"repinned":true,"address_1":"Pje Senda Florida Sur","city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/258475774/","description":"<p>Este es el primer evento del nuevo GDG San Salvador, grupo oficial de Google Developers de San Salvador.</p> <p>¿Eres un(a) profesional desempeñándote como Mobile App Developer, Data Analyst o Programador y programas en JavaScript, Java o cualquier otro lenguaje de programación orientado a objetos o funcional y/o un(a) estudiante Universitario de últimos años de carreras de Ingeniería en Sistemas o Ciencias de la Computación y/o entusiasta de tecnologías de Google?... ¡Este evento es para ti!</p> <p>Ven y conoce el increíble Centro de Innovación de Banco Agrícola, entérate de oportunidades laborales de nuestros patrocinadores y escucha interesantes charlas de las que aprenderás sobre diversas tecnologías de punta en desarrollo Android y Machine Learning impartidos por Desarrolladores y Conferencistas de nivel Internacional.</p> <p>PROGRAMA:</p> <p>5:30 PM: Ingreso.</p> <p>5:50 PM: Relanzamiento oficial GDG San Salvador. Palabras de Bienvenida del Organizador, agradecimiento a patrocinadores.</p> <p>6:00 PM, Charla: The quest for fire: Firebase ML Kit</p> <p>Descripción:</p> <p>Speaker: Adrián Catalán | <a href=\"https://ykro.github.io\" class=\"linkified\">https://ykro.github.io</a> | <a href=\"https://twitter.com/ykro\" class=\"linkified\">https://twitter.com/ykro</a></p> <p>Adrián ha estado involucrado en la industria del software por más de 15 años, trabajando tanto en aplicaciones web como móviles. Organizador del GDG Guatemala, GuatemalaJS y ex co-organizador del Facebook Developers Circle Guatemala y de Nodebots. Actualmente lidera el Laboratorio de Innovación en la Universidad de Galileo y es un Experto en Desarrollo de Google (GDE) para Android, IoT y Firebase.</p> <p>Adrián fue el primer Latinoamericano en ser reconocido por Google como Google Developer Expert (GDE) y es un Speaker (conferencista) de nivel Internacional que ha recorrido el Mundo entero impartiendo charlas sobre diferentes temas relacionados a la tecnología.</p> <p>6:45 PM, Charla: Hacia el Infinito y más allá con Android Jetpack y Kotlin.</p> <p>Speaker: Oscar Salguero | <a href=\"https://oscarsalguero.com\" class=\"linkified\">https://oscarsalguero.com</a> | <a href=\"https://twitter.com/OscarSalguero\" class=\"linkified\">https://twitter.com/OscarSalguero</a></p> <p>Oscar empezó a programar a los 12 años mientras estudiaba en la escuela secundaria en San Salvador. Desde el año 2,000, Oscar ha desarrollado software de todo tipo para compañías de todo tamaño usando varias tecnologías y lenguajes de programación, ha co-fundado startups en Estados Unidos, liderado el desarrollo tecnológico en un incubador y agencia digital en Nueva York, se ha especializado en desarrollo de aplicaciones móviles y ha asistido e impartido charlas sobre Android y Android Things en diferentes eventos Internacionales.</p> <p>Actualmente, Oscar esta a cargo del desarrollo de aplicaciones Android para la empresa BeenVerified basada en Nueva York. Apps Web y móviles desarrolladas por Oscar son usadas por millones de usuarios en más de 50 países alrededor del Mundo.</p> <p>7:20 PM: Rifa y cierre.</p> <p>Enlaces Relacionados:</p> <p>- Firebase ML Kit: <a href=\"https://firebase.google.com/products/ml-kit/\" class=\"linkified\">https://firebase.google.com/products/ml-kit/</a></p> <p>- Android Jetpack: <a href=\"https://developer.android.com/jetpack/\" class=\"linkified\">https://developer.android.com/jetpack/</a></p> <p>- Kotlin: <a href=\"https://kotlinlang.org/\" class=\"linkified\">https://kotlinlang.org/</a></p> <p>Refrigerio: Se servirá Pizza y bebidas no-alcohólicas.</p> <p>Nota Importante: El estacionamiento en Banco Agrícola es limitado, si vienes con colegas del trabajo, vecinos, familiares o estudiantes de tu mismo centro educativo, te recomendamos hacer car pooling con ellos.</p> ","how_to_find_us":"El Centro de Innovación de Banco Agrícola está en 3er nivel del edificio conocido como Centro de Operaciones ubicado en 69 Av Sur Pasaje Senda Florida, entre Avenida Olímpica y Paseo General Escalón en San Salvador.","visibility":"public"}]