[{"created":1546511379000,"duration":10800000,"id":"257739885","name":"Virtual Cloud Study Jam : Codelab GCP","date_in_series_pattern":false,"status":"past","time":1547483400000,"local_date":"2019-01-14","local_time":"17:30","updated":1548176896000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":11,"group":{"created":1544356253000,"name":"GDG Cloud Nantes","id":30676487,"join_mode":"open","lat":47.22999954223633,"lon":-1.5700000524520874,"urlname":"GDG-Cloud-Nantes","who":"Membres","localized_location":"Nantes, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/GDG-Cloud-Nantes/events/257739885/","manual_attendance_count":84,"description":"<p>Après un premier codelab physique en 2018 co-organisé par le GDG Nantes &amp; Docker Nantes (<a href=\"https://www.meetup.com/fr-FR/GDG-Nantes/events/246037066/\" class=\"linkified\">https://www.meetup.com/fr-FR/GDG-Nantes/events/246037066/</a>), nous vous proposons de lancer l'année 2019 avec un Cloud Study Jam \"virtuelle\".<br/>En effet, l'idée est de pouvoir profiter d'un accès aux codelabs Qwiklabs le temps d'une soirée.<br/>Que ce soit pour découvrir GCP ou débuter avec Kubernetes ou encore jouer avec les produits d'IA ou bien préparer une certification, vous pourrez profiter de la plateforme pour progresser avec GCP.<br/>Vous pourrez chatter et discuter avec les autres membres présents via un Slack dédié : <a href=\"http://slack.nantes.community\" class=\"linkified\">http://slack.nantes.community</a> (channel : #cloud-study-jam-k8s)<br/>Normalement, les personnes inscrites pourront profiter de 1 mois de Qwiklabs gratuit.<br/>Merci à Éric Briand de m'aider pour cet évènement.</p> <p>Want to get started on the Google Cloud, but don't know where to begin?<br/>Join us for our Cloud Study Jam! Together we'll work through three Google Cloud Platform Essentials labs, then you will get free access to the next quest so you can finish this series of labs at home to get a Google-hosted badge for your online profile. You will be able to get hands-on experience with Docker, Kubernetes which will earn you additional badges.<br/>Join this meetup to get official Google training, a $70+ value, free of charge.<br/>Bring a laptop (PC, Mac or Chromebook)! The labs will run on all of the latest versions of the popular browsers.<br/>For the best experience, make sure your laptop has Firefox or Chrome installed.<br/>Create a Qwiklabs account at google.qwiklabs.com/users/sign_up</p> ","visibility":"public"}]
