[{"created":1532456709000,"duration":7200000,"id":"253102848","name":"GDG Webdev #1","rsvp_limit":90,"date_in_series_pattern":false,"status":"past","time":1533045600000,"local_date":"2018-07-31","local_time":"19:00","updated":1533096170000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":90,"venue":{"id":25894125,"name":"Тюменский Технопарк","lat":57.13798904418945,"lon":65.56690216064453,"repinned":true,"address_1":"ул. Республики, 142","city":"Tyumen","country":"ru","localized_country_name":"Russia","phone":"8 (922) 488-00-11"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/253102848/","manual_attendance_count":80,"description":"<p>Первый GDG Tyumen!</p> <p>Доклады на встрече:<br/>1) Перспективы использования языка goland в веб разработке.<br/>Бочаров Юрий, ООО Креатив, full stack developer<br/>О спикере: 10 лет в Web-разработке, 4 последних года занят в разработке и поддержке бизнес-сайтов. Программист со времен ZX Spectrum.<br/>О чем доклад: Поговорим об основных возможностях Goland. Расмотрим его применение в веб для высоконагруженных систем. Ну и что-то тут еще + упомяну об webassembly.</p> <p>2) Не забудь закрыть бэкдоры.<br/>Соколова Александра, ООО \"ЕСОФТ\", junior front-end developer<br/>О спикере: 2 года в Web-разработке, в основном занимаюсь вёрсткой<br/>О чем доклад: О том, про что иногда вспоминают только на продакшне - безопасность web-приложения. Чек-лист, лучшие практики, примеры того, как не надо делать.</p> <p>3) Опыт использования Docker.<br/>Воронов Александр, старший инженер-программист, Mint Rocket.<br/>О чем доклад: Плюсы и минусы использования в процессе разработки и в продакшене.</p> <p>4) Быстрая разработка Rest API с полноценной админ панелью на vue.js.<br/>Владимир Даронь, CEO WebAnt.<br/>О спикере: занимаемся разработкой mobile и web решений, последние пару лет ведем разработку для IoT устройств, 9 лет занимаюсь разработкой, GDG лидер Ростова<br/>О чем доклад: расскажу про то как оперативно начать разработку api с поддержкой GraphQL, как описав всего одну модель получить базовый CRUD, как улучшить все это и немного про фронт(админка на react/vue)</p> <p>Партнеры мероприятия:<br/>- Клуб ИТ-директоров iТюмень (<a href=\"https://www.facebook.com/iTyumenClub\" class=\"linkified\">https://www.facebook.com/iTyumenClub</a>)<br/>- Компания Creative (<a href=\"https://crtweb.ru/\" class=\"linkified\">https://crtweb.ru/</a>)<br/>- Ассоциация по развитию информационных технологий Тюменской области<br/>- Агентство инфраструктурного развития Тюменской области и проект IT WORK SPACE<br/>- Тюменский Технопарк (<a href=\"http://www.tyumen-technopark.ru/\" class=\"linkified\">http://www.tyumen-technopark.ru/</a>)</p> ","how_to_find_us":"2 этаж, зал \"Президент\"","visibility":"public"},{"created":1537939968000,"duration":14400000,"id":"255016501","name":"GDG Machine Learning codelab","rsvp_limit":45,"date_in_series_pattern":false,"status":"past","time":1539248400000,"local_date":"2018-10-11","local_time":"14:00","updated":1539277557000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":45,"venue":{"id":25894125,"name":"Тюменский Технопарк","lat":57.13798904418945,"lon":65.56690216064453,"repinned":true,"address_1":"ул. Республики, 142","city":"Tyumen","country":"ru","localized_country_name":"Russia","phone":"8 (922) 488-00-11"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/255016501/","manual_attendance_count":25,"description":"<p>Практикум по разработке. Вместе окунемся в тему машинного обучения и сделаем маленький искусственный интеллект.</p> <p>Что будет:</p> <p>1. Сергей Мелехин(Team lead в Ramax Intl. (ramax.ru), организатор GDG Владивосток и VLDC) с докладом \"Deeper learning in 2018\". Длительность ~40 минут<br/>Онлайн-доклад с обратной связью. Интенсивная вводная в машинное обучение. Узнаем какое бывает машинное обучение, как применяется, какие есть ограничения и перспективы. Закончим кратким обзором текущих практических достижений и последних интересных публикаций.</p> <p>2. Codelab по машинному обучению. Длительность ~3-4 часа<br/>Проведёт Глазков Максим, начальник отдела развития ООО \"Конкорд-софт\"<br/>В этой части мы построим и натренируем нейронную сеть с помощью библиотеки TensorFlow с использованием облачной платформы Google Colaboratory. В учебных данных будем использовать один из общеупотребительных наборов (MNIST, CIFAR).<br/>От участника ожидается:<br/>- с собой взять ноутбук.<br/>- у кого нет аккаунта Google, нужно заранее зарегистировать - он понадобится для доступа в Google Colaboratory.<br/>- базовые знания Python</p> ","how_to_find_us":"аудитория 336, 3 этаж","visibility":"public"},{"created":1539107545000,"duration":7200000,"id":"255397432","name":"GDG Gamedev #1","rsvp_limit":75,"date_in_series_pattern":false,"status":"past","time":1539424800000,"local_date":"2018-10-13","local_time":"15:00","updated":1539446210000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":69,"venue":{"id":25960153,"name":"Институт математики и компьютерных наук ТюмГУ","lat":57.159278869628906,"lon":65.52294158935547,"repinned":true,"address_1":"ул. Перекопская, 15а","city":"Tyumen","country":"ru","localized_country_name":"Russia"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/255397432/","manual_attendance_count":70,"description":"<p>Всем кто интересуется разработкой игр, будет интересно.</p> <p>Встреча с основателем студии Targem (<a href=\"http://targem.ru/\" class=\"linkified\">http://targem.ru/</a>), крупной российской компании-разработчика компьютерных игр (Star Conflict, Crossout, BlazeRush, Ex Machina, Dance Magic, Armageddon Riders, Империя дракона, Battle vs Chess, Planets Under Attack и др.), - Станиславом Скорбом.</p> <p>Станислав поделится различными историями, своим видением игровой индустрии, расскажет, во сколько лет начал программировать, и как складывался его путь, ответит на волнующий всех вопрос - можно ли зарабатывать, делая игрушки.</p> <p>За организацию встречи спасибо:<br/>Учебному центру \"Курсор\" (<a href=\"https://vk.com/cursor72\" class=\"linkified\">https://vk.com/cursor72</a>)<br/>Институту математики и компьютерных наук ТюмГУ<br/>Клубу ИТ-Директоров \"iТюмень\"</p> ","how_to_find_us":"аудитория 410","visibility":"public"},{"created":1542523541000,"duration":7200000,"id":"256511723","name":"GDG Mobile #1","rsvp_limit":40,"date_in_series_pattern":false,"status":"past","time":1543586400000,"local_date":"2018-11-30","local_time":"19:00","updated":1543648331000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":40,"venue":{"id":25960153,"name":"Институт математики и компьютерных наук ТюмГУ","lat":57.159278869628906,"lon":65.52294158935547,"repinned":true,"address_1":"ул. Перекопская, 15а","city":"Tyumen","country":"ru","localized_country_name":"Russia"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/256511723/","manual_attendance_count":42,"description":"<p>Митап по мобильной разработке.</p> <p>Программа митапа:<br/>1) Модульная архитектура в iOS приложениях.<br/>Спикер: Морозов И.Н., руководитель отдела мобильной разработки в Mint Rocket. Начал заниматься iOS разработкой с 2014 года. Участвовал в разработке более чем 30 проектов различной степени сложности.<br/>О чем доклад: в докладе пойдет речь о модульном подходе к построению приложений на основе шаблона проектирования VIPER. Частично рассмотрим реализацию VIPER от Mutual Mobile и Rambler&amp;Co. Рассмотрим подходы к разработке архитектуры iOS приложение, которые используются в компании Mint Rocket.</p> <p>2) React-Native. Кроссплатформенная разработка. The Good, the Bad and the Ugly.<br/>Спикер: Бондаренко Лев, iOS разработчик, с опытом как front-end, так и back-end разработки, участвовал в разработке различных продуктов компании Этажи и E-soft.<br/>О чем доклад: в докладе будут рассмотрены плюсы и минусы разработки \"кроссплатформы\", или как небольшой командой JS разработчиков доставить продукт в короткие сроки</p> <p>3) Декорированный репозиторий: мобильный и не только<br/>Спикер: Артем Глазков, GUAVA LLC, CEO, CSM, CSPO, fullstack разработчик. В разработке с 2003, под мобильные - с 2015.<br/>О чём доклад: поговорим о применении паттернов Repository + Decorator в связке: чем полезно в мобильной разработке, плюсы и ограничения.</p> <p>4) Инструменты профилирования для Android.<br/>Спикер: Гулевский Антон. Разработчик библиотеки Алисы для Android<br/>О спикере: делаю мобильные приложения с 2013 года. Участвовал в разработке Яндекс.Браузера, сейчас занимаюсь Алисой, которую можно увидеть в различных приложениях Яндекса.<br/>О чем доклад: по ходу доклада мы рассмотрим, какие существуют средства и подходы для анализа производительности в Android и как ими пользоваться на практике. Также обратим внимание на типичные ошибки при профилировании и поговорим о том, насколько сложно поддерживать достигнутое быстродействие.</p> <p>ВАЖНО! Мероприятие будет проходить в Институте математики и компьютерных наук ТюмГУ, там пропускной режим, поэтому:<br/>- обязательно возьмите с собой документ удостоверяющий личность<br/>- в профиле MeetUp.com исправьте свое имя на реальное, оно пойдет в списки пропусков на охрану</p> <p>Раздеваться рекомендуем в аудитории 421 (она рядом с аудиторией в которой будет митап), т.к. раздевалка университета работает до 20-00.</p> <p>Выражаем благодарность партнерам мероприятия:<br/>Компании Яндекс<br/>Mint Rocket (<a href=\"http://mintrocket.ru/\" class=\"linkified\">http://mintrocket.ru/</a>)<br/>Институту математики и компьютерных наук ТюмГУ (<a href=\"https://www.utmn.ru/imkn/\" class=\"linkified\">https://www.utmn.ru/imkn/</a>)<br/>Клубу ИТ-Директоров \"iТюмень\" (<a href=\"https://www.facebook.com/iTyumenClub/\" class=\"linkified\">https://www.facebook.com/iTyumenClub/</a>)</p> ","how_to_find_us":"аудитория 410","visibility":"public"},{"created":1549869697000,"duration":7200000,"id":"258864258","name":"GDG Career #1","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1550757600000,"local_date":"2019-02-21","local_time":"19:00","updated":1550952016000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":90,"venue":{"id":26163111,"name":"Tekhnopark","lat":57.13790512084961,"lon":65.56716918945312,"repinned":true,"city":"Tyumen","country":"ru","localized_country_name":"Russia"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/258864258/","manual_attendance_count":70,"description":"<p>Наша очередная встреча будет посвящена удаленной работе - ее плюсах, минусах и реальном опыте очевидцев :)<br/>Один из серьезных трендов в мире - увеличение количества сотрудников, которые работают удаленно. На первый взгляд, такой формат работы выгоден и сотрудникам и работодателям. Сотрудники получают бОльшую свободу в планировании своего времени, выход на интересные задачи, недоступные в регионе где они проживают, и размер оплаты труда сопоставимый с московской или мировой. Работодатель получает возможность выбирать лучшие кадры не ограничиваясь географией своих офисов и экономить на дорогостоящих офисах.<br/>Но как и в любом вопросе, везде есть нюансы. На встрече мы услышем опыт практиков и разберемся в вопросе.</p> <p>Спикеры:<br/>1) Побег из курятника(зачеркнуто) офиса. Приключение длинною в год.<br/>О спикере: Велижанин Николай. ~15 лет в разработке софта, повидал немало кровавого ынтырпрайза, сейчас удаленщик в компании WaveAccess. .net/js fullstack developer плюс мобильная разработка на Xamarin.<br/>О чём доклад:<br/>Немного ретроспективы про офисную работу в лучшем городе земли, какой был взгляд на тюменское софтостроение ещё 5 лет назад. О причинах, побудивших отказаться от безопасности локальных компаний. Рассмотрим вопросы, есть ли свобода у работы в тапках, бытовые/технические трудности. Как трансформируется личность. Немного поделюсь опытом коллег и рассмотрим типовые страхи сомневающихся.</p> <p>2) Мой опыт работы в компании с Минимумом Бюрократии™<br/>О спикере: Ибрагимов Ильнур, Ivelum, Senior Software Engineer, Full Stack Developer. 14 лет в веб-разработке. Начал с системного администратора в ТюмГНГУ, обнаружил в себе способности веб-программиста. Занимался разработкой АСОИ Абитуриент ТюмГНГУ. Участвовал в со здании АСД Тюменьгортанса,<br/>РНИС Тюменской области. Сейчас принимаю участие в разработке крупного зарубежного проекта.<br/>О чем доклад:<br/>- Рассказ об опыте работы в компании, где менеджер заменен скриптом на питоне<br/>- Мини-презентация нашего продукта Teamplify (тот самый скрипт на питоне)<br/>- Основные челленджи, с которыми придется столкнуться удалёнщику</p> <p>3) Работодатель vs сотрудник на удаленке<br/>О спикере: Николай Ясинский, порядка 16 лет занимаюсь разработкой для разнообразных компаний на просторах России, Европы и США. В числе последних в 2015 году - участие в проектах для HP. Последние 4 года руковожу фирмой по Outsource-разработке SHIFU.</p> <p>О чем доклад:<br/>Я расскажу о том, что стоит учитывать как сотруднику, так и работодателю при совместной дистанционной работе.<br/>Учитывая что я выступал и выступаю в обоих ролях на протяжении многих лет, мне есть чем поделиться с вами.<br/>Тезисы доклада:<br/>- особенности организации труда удаленщиков(трекинг времени, рабочее место)<br/>- расценки зп по России/миру<br/>- (карьерный/финансовый) рост на удаленной работе<br/>- с чего начать поиск удаленной работы<br/>- какие навыки нужно прокачивать, какие soft-скилы и hard-скилы ценятся<br/>- признаки адекватного(и неадекватного) работодатедя<br/>- признаки неадекватных(некомпетентных) удаленных сотрудников</p> ","how_to_find_us":"Международный конгресс-холл, 1 этаж","visibility":"public"},{"created":1552724653000,"duration":7200000,"id":"259816926","name":"GDG Python #1","rsvp_limit":100,"date_in_series_pattern":false,"status":"past","time":1553261400000,"local_date":"2019-03-22","local_time":"18:30","updated":1553436280000,"utc_offset":18000000,"waitlist_count":0,"yes_rsvp_count":83,"venue":{"id":26163111,"name":"Tekhnopark","lat":57.13790512084961,"lon":65.56716918945312,"repinned":true,"city":"Tyumen","country":"ru","localized_country_name":"Russia"},"group":{"created":1527700063000,"name":"GDG Tyumen","id":28648341,"join_mode":"open","lat":57.16999816894531,"lon":65.5,"urlname":"GDG-Tyumen","who":"Участники","localized_location":"Tjumen, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Yekaterinburg"},"link":"https://www.meetup.com/GDG-Tyumen/events/259816926/","manual_attendance_count":65,"description":"<p>Очередная встреча посвящена одному из самых популярных языков программирования(по некоторым оценкам - самым популярным в мире) - Python. Этот язык используется в сфере создания искусственного интеллекта, анализе больших данных, создании веб-сервисов и умных устройств. Проще сказать где он не используется :) На встрече послушаем практиков и пообщаемся.</p> <p>Программа встречи:<br/>1) «Укрощение змеи» - базовые инструменты для решения задач машинного обучения на Python<br/>Спикеры: Боганюк Юлия Викторовна, руководитель проектов Cinit Group. Занимается проектированием и ведением проектов, в том числе использующих технологии машинного обучения.<br/>Лобунцов Даниил Сергеевич, главный технический специалист, full-stack разработчик Cinit Group. Занимается проектированием, разработкой систем под десктоп и веб, техническим ведением проектов.<br/>О чем доклад: расскажем о том, что такое машинное обучение, где уже применяется и какие текущие тенденции. Рассмотрим пример решения задачи машинного обучения на Python и расскажем о том, как мы это делаем в компании.<br/>2) Начинающий Data Scientist. Один небольшой кейс из практики<br/>Спикер: Тетерин Сергей зам. главного инженера по ИТ ПАО \"СУЭНКО\".<br/>О чем доклад: как на практике можно получить ответы на реальные вопросы стартапов используя инструменты Data Scientist.<br/>3) Как варить вкусный статический анализ кода<br/>Спикер: Илья Лебедев, bestdoctor.ru. Один из создателей learn.python.ru. Программирует, проектирует, управляет, учит.<br/>О чем доклад: У вас настроен супер-стрикт-набор валидаторов кода, обязательная аннотация типов без Any и требования стопроцентного покрытия кода тестами? У меня тоже нет. Это не потому, что мы с вами бесполезные и непрофессиональные разработчики, а потому что надо дело делать, а не типы вылизывать.<br/>В докладе я расскажу, как придумать и внедрить систему статического анализа, которая совмещает плюсы со всех сторон: позволяет релизить фичи быстрее, код делает лучше, а разработчиков дружнее. Покажу пару примеров и расскажу про свой опыт.</p> ","how_to_find_us":"2 этфж, зал Кадрум","visibility":"public"}]
