[{"created":1522660966000,"duration":10800000,"id":"249344701","name":"Meetup \"Machine Learning, Computer Vision или Как научить машину думать?\"","rsvp_limit":100,"date_in_series_pattern":false,"status":"past","time":1524135600000,"local_date":"2018-04-19","local_time":"18:00","updated":1524160344000,"utc_offset":25200000,"waitlist_count":0,"yes_rsvp_count":18,"venue":{"id":25788386,"name":"Lenina 26","lat":56.46204376220703,"lon":84.95045471191406,"repinned":false,"address_1":"Lenina 26","city":"Tomsk","country":"ru","localized_country_name":"Russia"},"group":{"created":1512031030000,"name":"GDG Tomsk","id":26744008,"join_mode":"open","lat":56.47999954223633,"lon":84.9800033569336,"urlname":"GDG-Tomsk","who":"Members","localized_location":"Tomsk, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Novosibirsk"},"link":"https://www.meetup.com/GDG-Tomsk/events/249344701/","description":"<p>19 апреля в 18:00 сообщество GDG Tomsk совместно с Rubius проведёт митап \"Machine Learning, Computer Vision или Как научить машину думать?\". Встречаемся в “Точке Кипения – Томск” (пр. Ленина 26).</p> <p>Поговорим про современные методы машинного обучения, рассмотрим примеры их использования в реальных бизнес-кейсах и расскажем как правильно готовить обучающие данные.</p> <p>На митапе выступят докладчики из томских IT-компаний: Алексей Кульневич (Econophysica), Никита Абдрашитов (ENBISYS), Сергей Андреев (НПК “Техника дела”), Павел Хаустов (Rubius). Они расскажут об актуальных задачах в обработке естественных языков, об использовании спутниковых снимков для оценки недвижимости, о трудностях в работе с биометрическими системами и об алгоритмах для беспилотных автомобилей.</p> <p>Ждём разработчиков и всех, кому интересно как устроено машинное обучение.</p> <p>Участие бесплатное, но необходима регистрация.</p> <p>Место: пространство коллективной работы \"Точка кипения – Томск\",<br/>пр. Ленина, 26, 2 этаж (вход со стороны ул. Аркадия Иванова)<br/>Дата: 19 апреля 2018<br/>Время: 18:00–21:00</p> <p>Программа митапа:</p> <p>Тема: Алгоритмы машинного обучения в обработке естественных языков<br/>Спикер: Алексей Кульневич, Econophysica<br/>Доклад описывает актуальные задачи в обработке естественных языков. Отдельно обсудим проблемы и примеры использования алгоритмов NER (Named Entity Recognition) и Coreference Resolution в распознавании именованных сущностей и разделении их на кластеры. Поговорим сути кластеризации текстов и о методах их предобработки: как это делается и зачем это нужно.</p> <p>Тема: Использование спутниковых снимков для улучшенной оценки стоимости недвижимости<br/>Спикер: Никита Абдрашитов, ENBISYS<br/>Исследования в области оценки недвижимости показали, что описание объекта (количество комнат, площадь, этажность и т. д.) не даёт достаточных сведений для точного предсказания стоимости квартиры. Дополнительную точность предсказания обеспечили спутниковые снимки, а также снимки внешнего вида дома. Доклад описывает способы обработки данных (ручной способ, автоматический), методы векторизации изображений, применение обработанных данных в моделях, методы оценки качества данных и предсказаний, а также результаты, полученные в ходе экспериментов.</p> <p>Тема: Технология распознавания лиц в задачах автоматического анализа потоковых и архивных видеоданных<br/>Спикер: Сергей Андреев, НПК \"Техника дела\"<br/>Доклад посвящён проблематике распознавания лиц по их растровым изображениям. Проведу небольшой ретроспективный обзор существующих методов и основных трудностей, с которыми приходится сталкиваться исследователям и разработчикам биометрических систем. А также будем анализировать и развеивать основные мифы, связанные с темой распознавания лиц.</p> <p>Тема: Алгоритмы детектирования, распознавания и трекинга участников дорожного движения<br/>Спикер: Павел Хаустов, Rubius<br/>Доклад посвящён разработке алгоритмов единовременного детектирования и классификации объектов в видеопотоке, а также их последующего трекинга с применением межкадровой информации. Рассмотрим способы повышения точности разработанных алгоритмов с применением данных сканирующего лидара и эволюционных алгоритмов.</p> <p>Ждём встречи!</p> ","how_to_find_us":"Пространство коллективной работы \"Точка кипения – Томск\", пр. Ленина, 26, 2 этаж (вход со стороны ул. Аркадия Иванова)","visibility":"public"},{"created":1540373981000,"duration":1800000,"id":"255794099","name":"Machine Learning: топовая специальностm","date_in_series_pattern":false,"status":"past","time":1540375200000,"local_date":"2018-10-24","local_time":"17:00","updated":1540380014000,"utc_offset":25200000,"waitlist_count":0,"yes_rsvp_count":1,"group":{"created":1512031030000,"name":"GDG Tomsk","id":26744008,"join_mode":"open","lat":56.47999954223633,"lon":84.9800033569336,"urlname":"GDG-Tomsk","who":"Members","localized_location":"Tomsk, Russia","state":"","country":"ru","region":"en_US","timezone":"Asia/Novosibirsk"},"link":"https://www.meetup.com/GDG-Tomsk/events/255794099/","description":"<p>Стань специалистом в области Machine Learning, где решаются сверхчеловеческие задачи: предсказание будущего, понимание почерка врачей, обнаружение пешеходов в темноте и нежелательного контента в сети.</p> <p>По данным HeadHunter, спецы по машинному обучению получают 130–300 тысяч рублей и крупные компании ведут ожесточённую борьбу за них. 18 выпускников первого курса уже стали спецами в области Machine Learning. Так чего ты ждёшь?</p> <p>Мы научим тебя переводить данные в понятный машине формат, фильтровать их перед использованием и выбирать средства машинного обучения, которые подходят именно под твою задачу. После прохождения курса ты сможешь спроектировать, за-python-ить и обучить простую, рекуррентную, свёрточную, да, вообще, любую нейронную сеть, дерево решений или даже целый лес. Всё это с понятными примерами и ворохом практических задач на реальных данных. От тебя требуется всего-то ничего: немного шарить в высшей математике и уметь в Python чуть больше, чем \"Hello, world!\".</p> <p>Стать спецом в Machine Learning тебе помогут наши бывалые магистры:</p> <p>Павел Хаустов – кандидат технических наук от народа, чёрный дракон машинного обучения и компьютерного зрения, преподаватель, который видел лес рук.</p> <p>Кирилл Костин – гуру Big Data, об обработке данных знает чуть больше, чем всё и умеет объяснять непонятное лучше толкового словаря.</p> ","visibility":"public"}]
