[{"created":1542982890000,"duration":14400000,"id":"256647744","name":"#1 DevFest Slovenia","rsvp_limit":160,"date_in_series_pattern":false,"status":"past","time":1544716800000,"local_date":"2018-12-13","local_time":"17:00","rsvp_close_offset":"PT8H","updated":1544736523000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":25999661,"name":"BTC City, Kristalna palača, kongresna dvorana","lat":46.06691360473633,"lon":14.541361808776855,"repinned":true,"address_1":"Ameriška ulica 8","city":"Ljubljana","country":"si","localized_country_name":"Slovenia"},"group":{"created":1537792160000,"name":"GDG Ljubljana","id":29943904,"join_mode":"open","lat":46.060001373291016,"lon":14.510000228881836,"urlname":"GDG-Ljubljana","who":"Members","localized_location":"Ljubljana, Slovenia","state":"","country":"si","region":"en_US","timezone":"Europe/Ljubljana"},"link":"https://www.meetup.com/GDG-Ljubljana/events/256647744/","description":"<p>GDG Ljubljana will come to Slovenia with a bang. On our first event we will Deep Dive into the #1 DevFest Slovenia, which will take place on 13th of December in an environment of Cristal palace in BTC CITY.</p> <p>The mission of GDG Ljubljana is to create a unique ecosystem of development enthusiasts who are keen to share knowledge and good practices among its colleagues.</p> <p>DevTech Slovenia, will be the first of its kind in our country. We are preparing for you a great program and event greater speakers, who will share with us lectures covering the new development trends and techniques. Lectures and insights provided by acknowledged specialists who will demonstrate real hands on use-cases and deep dive knowledge insights are definitely not to be miss:</p> <p>LIST OF SPEAKERS:</p> <p>1. Kotlin – programming language in theory and practise (SLO)<br/>Gregor Petrin, Software Architect, Razum d.o.o.</p> <p>Description: Detailed overview of Kotlin programming language will give you the insight what Kotlin looks like, what are it's key functionalities and what distinguish it from other languages. We will also disclose what are Kotlin's key advantages and why Kotlin has a vision of becoming the bright light at the end of the tunnel for multi-platform mobile applications.<br/>GitHub: <a href=\"https://github.com/gregopet\" class=\"linkified\">https://github.com/gregopet</a></p> <p>2. AI matching and recommendation algorithms in e-commerce (SLO)<br/>Sašo Kuntarič, Project Lead, Eligma d.o.o.</p> <p>Description: As manufacturers invest more and more money into advertising and highlighting products, AI is enabling better informed buying decisions based on product specifications.<br/>LinkedIn: www.linkedin.com/in/sašo-kuntarič-9442b4159</p> <p>3. 2018 - year of Android (SLO)<br/>Željko Plesac, Tehnical Director, Infinum d.o.o.</p> <p>Description: As the Christmas holidays are just around the corner, it’s perfect time to recap all the changes which happened to Android world in year 2018.<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/%C5%BEeljko-plesac-01551214/\" class=\"linkified\">https://www.linkedin.com/in/%C5%BEeljko-plesac-01551214/</a></p> <p>4. Implementing Image Search Application Using Cloud Vision (SLO)<br/>Robi Pritržnik, CTO, BTC Phoenix d.o.o.</p> <p>Description: We will dive into a real use case implementation of Google Cloud Vision for an eCommerce image search. The lecture will cover basics of Google Cloud and an example of Image Search, Text Extraction and Label Detection.<br/>LikedIn: <a href=\"https://www.linkedin.com/in/robipritrznik/\" class=\"linkified\">https://www.linkedin.com/in/robipritrznik/</a></p> <p>5. Implementing Trusted Data Sharing via a Decentralized Network (ENG)<br/>Branimir Rakić, Co-Founder and CTO, ORIGIN TRAIL d.o.o.</p> <p>Description: Branimir will present how OriginTrail is developing a blockchain-based protocol and how it is used for data exchange.<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/branimirrakic/\" class=\"linkified\">https://www.linkedin.com/in/branimirrakic/</a></p> <p>6. Insights into XR tehnologies (AR, VR, MR) (ENG)<br/>Erik Kapfer, Owner and Strategist at Pattern.City</p> <p>Description: The speech will cover a dive into new XR technology insights, covering VR, AR and MR fields. Stay tuned for and awesome presentation ;)<br/>LinkedIn: <a href=\"https://www.linkedin.com/in/erikkapfer/\" class=\"linkified\">https://www.linkedin.com/in/erikkapfer/</a></p> <p>Great thank you to our sponsor and supporter: BTC d.d. - www.btc.si</p> <p>#stayTuned &amp; #getReady for GDG &gt;&gt; Ljubljana</p> ","visibility":"public"}]