{"events":[{"created":1583442282000,"duration":7200000,"id":"269215629","name":"Collaborative Virtual Event - Progressive Web Apps Evening","date_in_series_pattern":false,"status":"past","time":1585670400000,"local_date":"2020-03-31","local_time":"18:00","updated":1585680525000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":5,"venue":{"id":26222745,"name":"Forus Lab","lat":58.89418029785156,"lon":5.706002235412598,"repinned":true,"address_1":"Svanholmen 1","city":"Stavanger","country":"no","localized_country_name":"Norway"},"group":{"created":1574718696000,"name":"GDG Stavanger","id":33048015,"join_mode":"open","lat":58.970001220703125,"lon":5.710000038146973,"urlname":"GDG-Stavanger","who":"Members","localized_location":"Stavanger, Norway","state":"","country":"no","region":"en_US","timezone":"Europe/Oslo"},"link":"https://www.meetup.com/GDG-Stavanger/events/269215629/","description":"<p>Details<br/>We are excited to announce our PWA evening talks, a virtual event by GDG Bergen, GDG Oslo and GDG Stavanger collaboration.</p> <p>Note: Link to join the event will be announced soon.</p> <p>Updates: Link for participants,<br/><a href=\"https://www.youtube.com/watch?v=iTqbZF71Law\" class=\"embedded\">https://www.youtube.com/watch?v=iTqbZF71Law</a></p> <p>--------------------------------------------------------------------------------</p> <p>1. Taking your web app offline (in a good sense)<br/>Speaker: Maxim Salnikov - Microsoft<br/>Description:<br/>Web as an application platform is amazing: evergreen browsers or some form of web views exist almost on every device with UI, we have native APIs to access the hardware, we use versatile language with the excellent tooling, we are the huge (the largest ever) developer community after all! But the web historically tightly coupled with the connection state... In my session, we confirm: the modern web APIs and some best practices allow us to build offline-first web apps: always available, caring about data consumption, preserving and sync, providing UX which is comparable (if not better) to the native apps, regardless of the connection. Plus, the current state of the tooling makes it possible to add these features in a fast and reliable way. Let's explore the offline web in a very practical manner - by building the offline-first app!</p> <p>This session will be useful for web front-end developers who have heard about progressive web apps (who haven't :), maybe even tired of PWA-hype, and thus want to understand some of UX benefits on practice. As this is not another \"What is PWA\" session, I focus exclusively on the modern APIs making offline-first approach possible, in a form of task+solution sections - to maximize the usefulness.</p> <p>Backend developers and mobile developers will get a nice overview of what web can do today (they will be impressed).</p> <p>2. Make your app installable<br/>Speaker: Laura Morinigo - Samsung Internet<br/>Description:<br/>A progressive web app is a way to bring a native-app experience into the browser. One of the main features is the ability to make your app installable on different platforms like desktop and smartphones. During this talk, we are going to review what we need to make our app installable, the best practices and standards that we have to follow in order to bring a good user experience, trends and a reference to the manifest file.<br/>--------------------------------------------------------------------------------</p> <p>About our speakers:</p> <p>Maxim Salnikov:</p> <p>This time we are so lucky to be joined by Maxim Salnikov from Microsoft.<br/>Maxim Salnikov is an Oslo-based cloud and web front-end geek with a strong passion for the developer community building. He architects and builds complex web applications since the end of the last century, and has extensive experience with all aspects of web platform focusing on the apps managing real-time data from IoT devices, and Progressive Web Apps. He is a Google Developer Expert in Web Technologies &amp; IoT, and a former Microsoft MVP in Development Technologies.</p> <p>Maxim is a founder and active contributor to two conferences: Mobile Era and ngVikings - Nordics’ main conferences for mobile and Angular developers respectively. Also, he leads Norway’s largest meetups dedicated to web front-end and mobile: Angular Oslo, Mobile Meetup, Oslo PWA, Framsia.</p> <p>Maxim is passionate about sharing his web platform experience and knowledge with the community. He travels extensively for visiting developers events and speaking/training at conferences and meetups around the world.</p> <p>Laura Morinigo:<br/>Laura is a senior software developer, advocate, and mentor. Her enthusiasm for technology and communities made her recognized as a Google Developer Expert and a Woman Techmakers Ambassador. Currently, she is a web developer advocate for Samsung Internet where she contributes to spread the word about advanced web features, especially PWA, helping web developers to create great and more inclusive web apps.</p> ","visibility":"public","member_pay_fee":false}],"upcoming":[{"created":1584726895000,"duration":10800000,"id":"269550762","name":"Collaborative Virtual Event - Flutter Study Jam","date_in_series_pattern":false,"status":"upcoming","time":1587567600000,"local_date":"2020-04-22","local_time":"17:00","updated":1584726895000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":3,"group":{"created":1574718696000,"name":"GDG Stavanger","id":33048015,"join_mode":"open","lat":58.970001220703125,"lon":5.710000038146973,"urlname":"GDG-Stavanger","who":"Members","localized_location":"Stavanger, Norway","state":"","country":"no","region":"en_US","timezone":"Europe/Oslo"},"link":"https://www.meetup.com/GDG-Stavanger/events/269550762/","description":"<p>We are excited to announce our Flutter Study Jam, a virtual event by Flutter Oslo Meetup Group, GDG Oslo, GDG Bergen, GDG Sorlandet and GDG Stavanger collaboration.</p> <p>Note: Link to join the event will be announced soon.<br/>--------------------------------------------------------------------------------<br/>Join us for our Online Flutter Study Jam!</p> <p>Flutter is Google’s portable UI kit for crafting high-quality native interfaces on iOS and Android in record time. Flutter works with existing code, is used by developers and organizations around the world, and is free and open source.</p> <p>Together we'll work through Flutter codelabs prepared by Google instructors. You will be able to get hands-on experience with Flutter and build an app while learning the fundamentals.</p> <p>The Study Jams for Flutter is best suited for two audiences:</p> <p>1) Those with programming experience who have never used flutter and want to see what’s it all about.</p> <p>2) People who have some experience with Flutter and want to learn new ways to implement mobile/web apps in.</p> <p>IMPORTANT INFO:<br/>Prepare a laptop! For the best experience, the laptop should have Flutter installed on it prior to starting the study jam to save time. Windows/Linux/Mac would all be fine.</p> <p>Please check if after installing Flutter SDK your laptop can compile and run a basic empty app in Flutter.</p> <p>Check out: <a href=\"https://flutter.dev/docs/get-started/install\" class=\"linkified\">https://flutter.dev/docs/get-started/install</a></p> <p>Please install Visual Studio Code if you don't have Android Studio already set up<br/>How to install VsCode: <a href=\"https://flutter.dev/docs/development/tools/vs-code\" class=\"linkified\">https://flutter.dev/docs/development/tools/vs-code</a></p> <p>Windows setup: <a href=\"https://flutter.dev/docs/get-started/install/windows\" class=\"linkified\">https://flutter.dev/docs/get-started/install/windows</a><br/>Mac setup: <a href=\"https://flutter.dev/docs/get-started/install/macos\" class=\"linkified\">https://flutter.dev/docs/get-started/install/macos</a><br/>Linux setup: <a href=\"https://flutter.dev/docs/get-started/install/linux\" class=\"linkified\">https://flutter.dev/docs/get-started/install/linux</a></p> <p>Agenda:<br/>17:00 - Welcome talk<br/>17:15 - Start<br/>20:00/20:30 - End</p> <p>About Instructors:</p> <p>Muhammed Salih Guler:</p> <p>Salih is a Berlin-based Senior Mobile Engineer who is a Google Developer Expert for Flutter and Dart. He likes sharing his knowledge with the people by mentoring aspiring developers, blogging and talking at conferences.</p> <p>Majid Hajian:</p> <p>Majid is a passionate software developer with years of developing and architecting complex web and mobile applications. He is passionate about web platform especially Flutter, IoT, PWAs, and performance. He loves sharing his knowledge with the community by writing and speaking, contributing to open source and organizing meetups and events. Majid is the award-winning author of \"Progressive web app with Angular\" book by Apress and \"Progressive Web Apps\" video course by PacktPub and Udemy. He is (co)organizer of a few mobile and web meetups in Norway as well as Nordic conferences for mobile and Angular, Mobile Era and ngVikings.</p> ","visibility":"public","member_pay_fee":false},{"created":1586201308000,"duration":5400000,"id":"269896662","name":"Collaborative virtual event: Angular evening with 3 great sessions","date_in_series_pattern":false,"status":"upcoming","time":1587655800000,"local_date":"2020-04-23","local_time":"17:30","updated":1586201308000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":2,"venue":{"id":26906060,"name":"Online event","repinned":false,"country":"","localized_country_name":""},"group":{"created":1574718696000,"name":"GDG Stavanger","id":33048015,"join_mode":"open","lat":58.970001220703125,"lon":5.710000038146973,"urlname":"GDG-Stavanger","who":"Members","localized_location":"Stavanger, Norway","state":"","country":"no","region":"en_US","timezone":"Europe/Oslo"},"link":"https://www.meetup.com/GDG-Stavanger/events/269896662/","description":"<p>Details<br/>We are excited to announce our Angular evening talks! a virtual event by Angular Oslo, Angular Stavanger and GDG Oslo, GDG Bergen, GDG Sørlandet, GDG Stavanger collaboration.</p> <p>The link to watch will be announced soon.</p> <p>----<br/>Title:<br/>The future of Angular and Ivy by Manfred Steyer</p> <p>Abstract:<br/>Ivy is primarily associated with smaller bundles and therefore better performance. However, Ivy has much more to offer, and many smart concepts provide the foundation for some much-anticipated future features.</p> <p>Find out how Ivy's potential can impact your future architecture. We use a case study to explore a possible future without NgModules but Standalone Components, the use of dynamic components or higher-order components, zone-less change detection, and new possibilities for lazy loading and plug-in systems.</p> <p>In the end, you understand Ivy's potential and how to start preparing for it today.</p> <p>------------------------</p> <p>Title: TBD by Fabriece Sumuni<br/>Abstract: TBD</p> <p>------------------------</p> <p>Title: Angular Elements for Authentication: The what, the how and the why by Ana Cidre</p> <p>Abstract:<br/>In this talk, we will take a look at what Angular Elements are, what they consist of and how to build them. Then we will see what advantages Web Components have when approaching and implementing authentication into our application, how Web Components can facilitate the implementation of authentication and share some examples of which Web Components we can create to simplify the process. We will also talk about what options we have today to build Web Components, which frameworks support them and whether browsers are ready for them.<br/>------------------------------------------------------------------------<br/>Our Speakers' biography:</p> <p>Manfred Steyer:<br/>Trainer, consultant and programming architect with a focus on Angular. Google Developer Expert (GDE) and Trusted Collaborator in the Angular team who writes for O'Reilly, the German Java Magazine, and windows.developer. He regularly speaks at conferences.</p> <p>Ana Cidre:<br/>Ana is a Developer Advocate at Auth0. She has a degree in Fine Arts and a Master in International Business Economics and Management, so she is not your usual software developer. She loves to code and she especially likes Angular. As a very active member of the community, she regularly organises meetups and conferences, like the amazing ngSpain. In Spain, where she’s currently based, she’s an organiser of GDG Vigo and the founder of GalsTech, a group for women in tech from Galicia. Because she is so passionate about diversity, she has also been named a Women Techmaker Ambassador.</p> <p>Fabriece Sumuni:<br/>TBD<br/>....</p> ","visibility":"public","member_pay_fee":false}],"organizers":[{"id":64541942,"name":"Prashant B.","status":"active","joined":1349126083000,"city":"Stavanger","country":"no","localized_country_name":"Norway","lat":58.97,"lon":5.71,"photo":{"id":78521432,"photo_link":"https://secure.meetupstatic.com/photos/member/a/1/d/8/member_78521432.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/a/1/d/8/thumb_78521432.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1586201183000,"created":1574718696000,"updated":1574720022000,"role":"organizer","group":{"id":33048015,"urlname":"GDG-Stavanger","name":"GDG Stavanger","status":"active","who":"Members","members":29,"join_mode":"open","localized_location":"Stavanger, Norway"},"intro":"I am a data scientist and ML enginner. I came to Stavanger in 2010 and have worked in different domains in Oil & Gas sector. I am looking forward to learn and discuss latest developments on google cloud and other google products and services.","link":"https://www.meetup.com/GDG-Stavanger/members/64541942/"},"is_pro_admin":false}]}