{"events":[{"created":1418841794000,"id":"219297807","name":"What is a GDG and why should I be involved?","date_in_series_pattern":false,"status":"past","time":1421089200000,"local_date":"2015-01-12","local_time":"19:00","updated":1421143104000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":17,"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/219297807/","description":"<p>What is a GDG and why should I be involved?</p> <p>This meeting is a discussion to kick things off. Not a big hype launch but a chance to see what GDG is all about, ask questions and get involved.</p> <p>Google hosts the world’s biggest community of developers. Mobile, web, software and product developers. Datascience is at the core – the company is based on an algorithm and applies data thinking to the world’s problems in health, education, work, communication and just about everything else.</p> <p>Central to this are Google Developer Groups – communities of Developers of all types, working together to share ideas and enthusiasms, make things happen and create the future. 578 Groups internationally in 103 countries and running over 3,000 events over the past six months. These are strong local groups, but also connect to the worldwide network of Developers actually creating products like Angular, Android Studio and Cloud Platform and the Google Expert Developer Team. A powerful resource.</p> <p>We’re connecting Developers across Oxfordshire and the Thames Valley to that worldwide hub. And I believe it is something every developer in the area should be part of, even if their only connection to Google is that their work is sometimes viewed on Google devices.</p> <p>We’re looking for Experts of our own too. People who will share their expertise and use the power of the global network to solve local problems. Who will help run our Develop the Developer programme which aims to broaden, deepen and formalise skills for Developers at all levels.</p> <p>We’re looking for the next generation of Developers too. Our Future Developer programme will help students looking to Development as a career, giving them peers and mentors they can learn from, getting them coding with professionals and even organising work experience.</p> <p>We're creating our own startups too. Ones with technical capability at the core. And providing virtual CTO and development skills to other startups too.</p> <p>And we hope to set up a Developer Centre in the centre of Oxford and in Reading where people can work on projects together, share ideas, get help and just hang out. Permanent places, part-time and drop-in.</p> <p>There are a host of interest groups included.</p> <p>Android</p> <p>Angular</p> <p>Cloud Platform</p> <p>Maps</p> <p>Marketing</p> <p>Future Products.</p> <p>There are special groups for Work , Education and Health.</p> <p>And fun things to get involved in like...</p> <p>Google Garage – teams of six get together to create software or apps together</p> <p>Google for X – collaborate on solving one of the world’s problems</p> <p>Come along and find out what being a GDG Developer can do for you.</p> ","visibility":"public","member_pay_fee":false},{"created":1421156982000,"id":"219803339","name":"Reading launch of GDG","date_in_series_pattern":false,"status":"past","time":1421262000000,"local_date":"2015-01-14","local_time":"19:00","updated":1421274290000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":3,"venue":{"id":23570996,"name":" Opsview, Enterprise Centre, ","lat":51.44080352783203,"lon":-0.9349420070648193,"repinned":false,"address_1":"Whiteknights Road, Reading RG6 6BU ","city":"Reading","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/219803339/","description":"<p>If you’re an Angular fan, develop Apps or host in the Cloud, tomorrow is the start of something big. Not one new group, but three. Linking Reading with the company which lights the way in Web Development – Google.</p> <p>Google hosts the world’s biggest community of developers. Google Developer Groups (GDGs) are communities of Developers working together to share ideas, make things happen and create the future. 578 Groups, 103 countries, over 6,000 events a year. Strong local groups, connected to the worldwide network of Developers actually creating products like Angular, Android Studio and Cloud Platform, backed by the Google Expert Developer Team. Develop the Developer and Future Developer Programmes to grow skills and Startup help too. A powerful resource which gives Google Developers an edge.</p> <p>We’re connecting Developers across Oxfordshire and the Thames Valley to that worldwide hub. And I believe it is something every developer in the area should be part of, even if their only connection to Google is that their work is sometimes viewed on Google devices. Come and learn all about it and get involved.<br/>AngularJS:<br/><a href=\"http://www.meetup.com/AngularJS-Oxford-Thames-Valley/\" class=\"linkified\">http://www.meetup.com/AngularJS-Oxford-Thames-Valley/</a><br/>Android:<br/><a href=\"http://www.meetup.com/Android-Developers-Oxford-and-Thames-Valley/\" class=\"linkified\">http://www.meetup.com/Android-Developers-Oxford-and-Thames-Valley/</a><br/>Cloud Platform:<br/><a href=\"http://www.meetup.com/Google-Cloud-Platform-Oxford-and-Thames-Valley/\" class=\"linkified\">http://www.meetup.com/Google-Cloud-Platform-Oxford-and-Thames-Valley/</a><br/>And lots more:<br/><a href=\"http://www.meetup.com/GDG-Oxford-and-Thames-Valley/\" class=\"linkified\">http://www.meetup.com/GDG-Oxford-and-Thames-Valley/</a></p> <p>Don’t worry, TVWD will continue to be independent, covering all web development.</p> <p><b>Developer Centre</b><br/>We’re working on creating a specialist Developer Centre as a hub for GDG. We will have places available for full-time, part time and drop-in people and the aim is that long-term it will be free for people who put some time into the group. We also plan to run a virtual CTO scheme for Startups and are recruiting good web and IT people. If you’re interested in either, please let me know.</p> <p><b>Our Venue:</b><br/>We’re moving to the Reading Enterprise Centre at Whiteknights. Free Parking and a less noisy environment.<br/>This meeting is held in the offices of our sponsors, Opsview, in the Enterprise Centre itself. Future meetings may be there or in the Innovation Centre next door. Parking is free but you need to print out the pass below. 17 Bus to Three Tuns, then right (B3350) 100 yds then right again and go through Whiteknights Gate on your left. Enterprise Centre is the large building on your right.</p> <p>Opsview Ltd, Enterprise Centre, Whiteknights Road, Reading RG6 6BU<br/>Parking Permit : <a href=\"https://www.opsview.com/sites/default/files/2014_visitors_parking_permit.pdf\" class=\"linkified\">https://www.opsview.com/sites/default/files/2014_visitors_parking_permit.pdf</a></p> <p>See you tomorrow.</p> <p>PS: This is a reannouncement as the original disappeared. If you registered on that one there is no need to register again.</p> ","visibility":"public","member_pay_fee":false},{"created":1424984247000,"id":"220785108","name":"Come and meet the famo.us people","date_in_series_pattern":false,"status":"past","time":1425582000000,"local_date":"2015-03-05","local_time":"19:00","updated":1425594230000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":14,"venue":{"id":20246462,"name":"The Jam Factory","lat":51.75252151489258,"lon":-1.2681100368499756,"repinned":false,"address_1":"Hollybush Row, 27 Park End St, OX1 1HU","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/220785108/","description":"<p>We've done it! I've been amazed by Famo.us for a while and have worked hard to get them here. The guys from Famo.us are coming all the way from California to the jQuery event - and we've hijacked them to come and talk to us.</p> <p>Famo.us is a free, open source framework to help you create smooth complex UIs for any screen. It includes an open-source 3D layout engine fully integrated with a 3D physics animation engine which renders to DOM, Canvas or WebGL.</p> <p>It makes it easier to build HTML5 apps that perform as well as native apps on iOS/Android and more. It also integrates seamlessly with AngularJS. jQuery has been so impressed that Steve Newcombe, the creator of Famo.us is now a director of the jQuery Foundation. Myles Borins and Greg Barto will be joining us live straight off the plane for California and Steve Newcombe will talk via videolink. They will unveil several special new features never seen live before.</p> ","visibility":"public","member_pay_fee":false},{"created":1427056823000,"duration":10800000,"id":"221327507","name":"Building Realtime Apps With Firebase & Google Cloud Platform","date_in_series_pattern":false,"status":"past","time":1427133600000,"local_date":"2015-03-23","local_time":"18:00","updated":1427146554000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":1,"venue":{"id":23716277,"name":"Google Campus","lat":51.52272415161133,"lon":-0.08602599799633026,"repinned":false,"address_1":"4-5 Bonhill St   Shoreditch United Kingdom","city":"London","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/221327507/","description":"<p>An excellent London event, ideal for anyone looking to get up to speed with Cloud Platform or Firebase.<br/>Last minute call for tomorrow's event. Sorry for the late notice, but hope it may be of use to anyone working in London but living in Oxford.</p> <p>Book here:<br/><a href=\"https://www.eventbrite.co.uk/e/building-realtime-apps-with-firebase-google-cloud-platform-tickets-15583763456\" class=\"linkified\">https://www.eventbrite.co.uk/e/building-realtime-apps-with-firebase-google-cloud-platform-tickets-15583763456</a></p> <p>Agenda</p> <p>18:00 - 18:30 : Registration<br/>18:30 - 19:15 : Building Realtime Apps With Firebase<br/>19:15 - 19:30 : Break<br/>19:30 - 20:15 : Building responsive Web apps with Go, Polymer and Google Cloud Platform<br/>20:20 - 20:50 : Big Data Analytics using Google BigQuery</p> <p>Building Realtime Apps With Firebase by Sara Robinson &amp; Mike McDonald<br/>Realtime is becoming an essential part of any user experience. Previously, making an app realtime has been difficult to achieve and requires many engineers. In this talk, Sara will explain how you can use Firebase's realtime API to store and sync data instantly without wiring up a backend. At the end of the talk, Sara will risk it all by live coding and deploying an app with Firebase!</p> <p>Building responsive Web apps with Go, Polymer and Google Cloud Platform by Mandy Waite<br/>The Go programming Language continues to gain momentum amongst developers and is becoming extremely popular on Google App Engine. In this session will show how you can use the App Engine Go Cloud endpoints library to build from scratch, a service that exposes backend application functionality via a RESTful API running on the Google API infrastructure used to run Google's own APIs. We'll then look at how you can design and build a responsive frontend application that consumes this newly created API using Polymer and Web Components. We will also demonstrate how we used Web Components to build an interactive frontend for an existing Go application, the Kubernetes Container Cluster scheduler.</p> <p>Big Data Analytics using Google BigQuery by Nawaid Shamim<br/>Every action in today’s digital world generate a lot of data which can be essential in making important business decisions but dealing with massive datasets can be challenging. Traditional tools might not scale as the dataset continually grows. Storage requirements can grow as fast as the dataset, so downloading data to your computer's hard drive is no longer a workable approach. And it can take a long time to retrieve the right subsets of data from a traditional database query.<br/>In this session, we will analyze Big Data in the cloud with Google’s BigQuery by running fast, SQL-like queries against multi-terabyte datasets in seconds. BigQuery enables you to build the real-time data-analysis solutions you need now, while being confident that you can scale your solutions in the future.</p> <p>Speakers<br/>Sara Robinson is a Developer Advocate on the Firebase team at Google, where she helps with developer relations through online content, outreach and events. She has a bachelor’s degree in Business and International Studies from Brandeis University. Before Firebase, she worked as an analyst at Sandbox Industries, a venture firm and startup foundry. She's passionate about learning to code, running, and finding the best ice cream in SF.</p> <p>Mike McDonald is an engineer on the Firebase team at Google. He enjoys developing mobile applications and playing with embedded hardware, and spends his days at Firebase helping customers architect and secure their systems. Mike is a graduate of Rose-Hulman Institute of Technology, with a B.S. in Computer Engineering and Computer Science. In his free time, he likes to spend time outdoors backpacking, snowboarding, or biking.</p> <p>Mandy Waite is a Developer Advocate for the Google Cloud Platform and is based out of the UK. Mandy is working to make life easier for developers building scalable, performant and reliable applications as well as to inspire them to fully embrace the Cloud and the new way of thinking that it offers. In her spare time she is learning Japanese and has the ultimate ambition to work in Japan.</p> <p>Nawaid Shamim is a Google Developer Expert (GDE) for Google Cloud Platform and a System Engineer at Sony Computer Entertainment where is architects, develop and maintain web services for various Playstation games. He has a Bachelor’s degree in Computer Science and a Masters degree in Computer &amp; Network Security. He is currently based in London. He advocates and evangelize for cloud computing and has great interest in distributed systems, machine learning and automation.</p> ","visibility":"public","member_pay_fee":false},{"created":1423132967000,"duration":10800000,"id":"220321233","name":"Big Query + Social Data (with Javier Ramirez and DataSift)!","date_in_series_pattern":false,"status":"past","time":1427738400000,"local_date":"2015-03-30","local_time":"19:00","updated":1427750852000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":9,"venue":{"id":23638321,"name":"3Space","lat":51.758121490478516,"lon":-1.2625720500946045,"repinned":false,"address_1":"38 Little Clarendon Street, OX1 2HF","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/220321233/","description":"<p>A double header, in conjunction with DataScience Oxford, to launch DevSpace and DataSpace.</p> <p><b>BigQuery </b></p> <p>Querying massive datasets can be time consuming and expensive without the right hardware and infrastructure. Google BigQuery solves this problem by enabling super-fast, SQL-like queries against append-only tables, using the processing power of Google's infrastructure.  </p> <p>That's the claim - how true is it in practice?</p> <p>To talk about it we have Javier Ramirez, a Google Developer Expert on the Cloud Platform, Web developer, daydreamer and “all around happy person”. Founder of <a href=\"https://teowaki.com\"><a href=\"https://teowaki.com\" class=\"linkified\">https://teowaki.com</a></a> and<a href=\"https://datawaki.com\"> <a href=\"https://datawaki.com\" class=\"linkified\">https://datawaki.com</a></a> - Datawaki collects technical and business data from your application or from your devices and lets you run interactive queries, generate reports and get real-time alerts. and Teowaki improves communication between developers and helps share technical information, best practices, gossip and lifehacks with your developer friends.</p> <p>A software engineer (18 years in IT) with a strong focus on the web (15 years building web applications). Experience building web applications using Ruby on Rails with data stores and complementary technologies and in technical training, content management, e-commerce and online banking using Java, PHP and C++. Also University lecturer on Software Engineering and Programming Languages.</p> <p>Javier loves talking at tech conferences. Subjects covered include Big Data (AWS + Google Bigquery), Redis, Ruby on Rails, API usability, REST web services, hypermedia APIs, agile development, SEO, analytics, CSS frameworks, game development and software engineering.</p> <p><b>Social Data Wrangling &amp; Classification with Machine Learning</b><br/>Tim Budden, Director of Data Science, DataSift</p> <p>Tim Budden heads up Data Science at DataSift, where on a daily basis he wrestles with huge quantities of unstructured social data, extracting value for customers and guiding DataSift feature development.</p> ","visibility":"public","member_pay_fee":false},{"created":1427896220000,"duration":7200000,"id":"221547505","name":"ES6 Modules and AngularJS with Jack Franklin","date_in_series_pattern":false,"status":"past","time":1429812000000,"local_date":"2015-04-23","local_time":"19:00","updated":1429821187000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":6,"venue":{"id":21576602,"name":"GROW at Green Park a ConnectTVT Innovation Hub","lat":51.41918182373047,"lon":-0.985709011554718,"repinned":false,"address_1":"250 South Oak Way","address_2":"Green Park, RG2 6GP","city":"Reading","country":"gb","localized_country_name":"United Kingdom","phone":"07854 189407"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/221547505/","description":"<p>There have been major changes in Javascript capabilities with the ES6 update. Angular 2 embraces ES6 modules (along with every other framework).</p> <p>So to see what's new, let's build a new Angular app using ES6 modules through jspm (<a href=\"http://jspm.io/\"><a href=\"http://jspm.io/\" class=\"linkified\">http://jspm.io/</a></a>)</p> <p>We'll start with a live demo type thing, then let people break out with laptops and do it themselves. In this session Jack Franklin will cover ES6, new features, how we can use them and how they tidy up your code.</p> <p>This is the inaugural event for GDG Reading!</p> <p><b>What is ES6</b></p> <p>ECMAScript is the “proper” name for the language commonly referred to as JavaScript. ES6, often referred to as “Harmony”, is the 6th major release of the ECMAScript language specification. <b>Jack Franklin</b></p> <p>Jack Franklin is fast becoming the expert on ES6. His introduction to it on CodeMentor is here: <a href=\"https://www.codementor.io/officehours/0351936245/introduction-to-es6-with-jack-franklin\" class=\"linkified\">https://www.codementor.io/officehours/0351936245/introduction-to-es6-with-jack-franklin</a></p> <p>And his Front-end London presentation is here:</p> <p><a href=\"https://www.youtube.com/watch?v=mPq5S27qWW8\" class=\"embedded\">https://www.youtube.com/watch?v=mPq5S27qWW8</a></p> <p>Jack Franklin is the author of \"Beginning jQuery\", which guides novices through JavaScript and jQuery to the point where they write their own plugins.</p> ","visibility":"public","member_pay_fee":false},{"created":1430139906000,"id":"222128247","name":"Mobile for Good - Tonight","date_in_series_pattern":false,"status":"past","time":1430157600000,"local_date":"2015-04-27","local_time":"19:00","updated":1430170653000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":2,"venue":{"id":23638321,"name":"3Space","lat":51.758121490478516,"lon":-1.2625720500946045,"repinned":false,"address_1":"38 Little Clarendon Street, OX1 2HF","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/222128247/","description":"<p>Mobile for Good - with Rebecca Telford from Vodafone<br/>Part of Event with DataKind - Duncan Ross from Teradata.</p> <p>Rebecca Telford manages Vodafone Foundation's education technology programme. “Mobile for Good” (M4D) is a universal theme for Vodafone’s foundations mobilising communities by bringing people together from all sectors to resolve shared problems and advance social change. Rebecca worked with UNICEF on their M4D programmes like uReport which is all about data mining. There’s a more local angle too. Becky’s working with the Innovations Lab up at Leys CDI at Blackbird Leys so a very local project. They could use support around data gathering and analysis and she’ll talk about a couple of projects in the pipeline.</p> <p>This is a joint event with DataScience Oxford - I thought it interesting to see how Mobiles are being used for Social Good worldwide. Should be a great event.</p> <p>Sorry for the short notice - Becky and I only sorted out her attendance over the weekend.</p> ","visibility":"public","member_pay_fee":false},{"created":1427975450000,"duration":10800000,"id":"221570486","name":"Google I/O Extended","date_in_series_pattern":false,"status":"past","time":1432830600000,"local_date":"2015-05-28","local_time":"17:30","updated":1432843863000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":14,"venue":{"id":23638321,"name":"3Space","lat":51.758121490478516,"lon":-1.2625720500946045,"repinned":false,"address_1":"38 Little Clarendon Street, OX1 2HF","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/221570486/","description":"<p>Every year Google has a big event where it launches all its cool stuff for the year. We're going to beam it live from San Francisco so you folks are first to know what's new.</p> <p>Expect some pretty exciting stuff.</p> <p>Please note the early start to fit in with the live stream.</p> ","how_to_find_us":"Central - off St Giles, next to the University admin building. 5 mins walk from town centre directly north from Cornmarket and 10 mins from station up Worcester, then Walton St. Pay parking in St Giles or 5-10 mins walk up Woodstock Rd side streets.","visibility":"public","member_pay_fee":false},{"created":1450349355000,"id":"227474697","name":"Google Container Engine and Kubernetes","date_in_series_pattern":false,"status":"past","time":1454612400000,"local_date":"2016-02-04","local_time":"19:00","updated":1454671362000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":29,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/227474697/","description":"<p>I was very pleased this year to unearth a real Google talent and help set him on a path to becoming a Google Developer Expert.</p> <p>Now I'm even happier to welcome Omer to Oxford to show off his talent in a subject which will be a hot topic this year as Google takes on AWS and Azure in the fight for top spot in Cloud Services.</p> <p>Kubernetes was probably the best new product in 2015 and Container Engine was first to embrace this technology which really leverages Docker technology.</p> <p>This will change the way you think about your systems architecture.</p> <p>Let Omer explain...</p> <p>This talk will explain the key concepts of Kubernetes (<a href=\"http://kubernetes.io/v1.1/docs/whatisk8s.html\" class=\"linkified\">http://kubernetes.io/v1.1/docs/whatisk8s.html</a>) and Google Container Engine (<a href=\"https://cloud.google.com/container-engine/\" class=\"linkified\">https://cloud.google.com/container-engine/</a>).</p> <p>Kubernetes is a powerful open source platform by Google for orchestrating and managing a cluster of containers. Kubernetes supports both Docker (<a href=\"https://www.docker.com/\" class=\"linkified\">https://www.docker.com/</a>) and Rocket (<a href=\"https://coreos.com/blog/rocket/\" class=\"linkified\">https://coreos.com/blog/rocket/</a>) container technologies.</p> <p>Google Container Engine (GCE) is a hosted Kubernetes container environment that enables developers to deploy and run Kubernetes clusters on the Google Cloud Platform.</p> <p>There will be a demo covering the deployment of a multi-tiered Web application cluster using GCE.</p> <p>To learn more go here: <a href=\"http://omerio.com/2016/01/02/getting-started-with-kubernetes-on-google-container-engine/\"><a href=\"http://omerio.com/2016/01/02/getting-started-with-kubernetes-on-google-container-engine/\" class=\"linkified\">http://omerio.com/2016/01/02/getting-started-with-kubernetes-on-google-container-engine/</a></a></p> <p>NB: This is NOT at Hatch</p> <p>New Central Oxford Venue: We're being hosted by Science Oxford at The Basement Project, underneath their Centre for Innovation in New Road (next to the Castle Mound). Parking almost opposite in Worcester Road Car Park (paid). Short walk from station (bus or train) and 2 minutes from Westgate or Business School.</p> <p>PS: Thursday is also the open evening for Oxhack. Spend some time with these guys too, while you're here - there's some exciting developments and great ideas.</p> <p>Omer (@omerio) is a Google Developer Expert for Cloud and specialises in software design and development. For the last 10+ years he has been designing and implementing enterprise systems for companies like Vodafone, HP, Colt and Google enterprise customers. Omer is passionate about software development, emerging technologies and cloud computing. He is also the founder of OfficeMA Timesheet. In his spare time Omer works on his part-time PhD research utilising the Google Cloud Platform in RDF cloud-based rule-based reasoning.</p> ","how_to_find_us":"Centre for Innovation in New Road (next to the Castle Mound). Parking almost opposite in Worcester Road Car Park (paid). Short walk from station (bus or train) and 2 minutes from Westgate or Business School. OX1 1BY","visibility":"public","member_pay_fee":false},{"created":1452854914000,"id":"228106403","name":"The Future of News - London weekend sponsored by Googlewith Hacks?hackers","date_in_series_pattern":false,"status":"past","time":1454698800000,"local_date":"2016-02-05","local_time":"19:00","updated":1454710395000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":1,"venue":{"id":24305740,"name":"International House","lat":51.50763702392578,"lon":-0.07370299845933914,"repinned":false,"address_1":"1 St Katharine’s Way, London E1W 1UN","city":"London","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/228106403/","description":"<p>If interested you must apply by Monday 18th Jan.<br/>Direct to organisers please - don't sign up on here.<br/>But it should be invaluable to anyone in news publishing.</p> <p>Do you have an idea for a news-related business? Need some help in getting started or progressing to the next stage? Perhaps you don’t have an idea yet but you are a wannabe news entrepreneur? Apply to attend Hacks/Hackers Connect, a launchpad event for news entrepreneurs seeking to launch businesses.<br/>You don’t need to have a specific business idea to apply, you just need to be keen to shape the future of the news industry in the UK.</p> <p>Deadline to apply: Monday 18 January – it should only take you 5-10 mins</p> <p>Cost: Nothing! Google News Lab is partnering on the event and covering all costs.</p> <p>The list of speakers and mentors includes some of the most impressive entrepreneurs in journalism. People who have created, run and sold their own news and media start-ups, like Mark Little, founder of Storyful, and Jeremy Walker, founder of Newsfixed. They’ll be on hand to give one-to-one advice, as well as leading group sessions and targeted workshops.</p> <p>Keynotes include:</p> <p>• Mark Little (@marklittlenews), founder of Storyful</p> <p>• Matt McAlister (@mattmcalister), co-founder of Publish.org</p> <p>• Rebekah Monson (@rsm), co-founder of The New Tropic</p> <p>Mentors include:</p> <p>• Neil Thackray (@neilthackray), founder of Briefing Media</p> <p>• Malcolm Bell (@malcolmbell), growth hacker and EIR at Harvard Business School. Founder CEO of MailCloud.com and Zaggora.com</p> <p>• William Stolerman (@thenewshubber), co-founder of The News Hub</p> <p>• John D McHugh (@johndphoto), co-founder of Verifeye Media</p> <p>• Torsten Müller (@mundustorsten), co-founder and CMO of Tame</p> <p>• Turi Munthe (@turi), partner at North Base Media and founder of Demotix</p> <p>• Jeremy Walker (@Jwalkerpress), founder of Newsfixed</p> <p>If you want to learn from the people who took personal risk and built their own news businesses, apply to attend here.</p> <p>What does the weekend involve?</p> <p>Hacks/Hackers Connect London is a weekend of practical workshops and mentoring for those interested in building and developing news-related technology or content businesses.</p> <p>When is it?</p> <p>5-7 February 2016</p> <p>Event format</p> <p>Friday, 7pm-9.30pm: Registration and reception</p> <p>Saturday, 10am-5.30pm: Keynotes, classes, mentoring</p> <p>Sunday, 10am-5.30pm: Keynotes, classes, mentoring</p> <p>What’s the aim?</p> <p>The ambition is to use this to stimulate a stronger and more profitable entrepreneurial community within the UK news industry.</p> <p>There’s no shortage of ideas in London. The city is brimming with a vibrant news media community. But think: of your favourite news start-ups, were any of them actually founded here? According to Crunchbase, there have been just 65 London startups created in the news space since 2010. Only 25 of these have secured any level of investment and fewer still – just 7 – achieved investment over $1 million.</p> <p>Hacks/Hackers London is trying to figure out where the gap between a great idea and a great success story lies.</p> <p>A global community</p> <p>Connect events are being run by Hacks/Hackers groups in different cities. Events have taken place or are planned for London, Berlin, San Francisco and New York.</p> <p>What’s Hacks/Hackers?</p> <p>Hacks/Hackers is a global movement of journalists and technologists who get together with the aim of “rethinking the future of news and information”. The London group has more than 4,000 members.</p> <p>How many people will be there?</p> <p>Around 100 selected delegates, keynote speakers and mentors.</p> <p>Where’s Connect being held?</p> <p>The Rainmaking Loft near Tower Bridge. Address: International House, 1 St Katharine’s Way, London E1W 1UN.</p> <p>One rule</p> <p>If you apply to attend the event and get selected, you must be free and attend the whole weekend. It’s not a drop-in event, you need to commit to the full weekend.</p> <p>What’s the deadline?</p> <p>18 January at 5pm. No exceptions.</p> <p>We will contact you by Monday, 25 January to tell you whether or not your application was successful.</p> <p>Still got questions?</p> <p>Contact [masked]</p> ","visibility":"public","member_pay_fee":false},{"created":1453393656000,"id":"228256859","name":"Firebase - Frank Van Puffelen from Google","date_in_series_pattern":false,"status":"past","time":1456167600000,"local_date":"2016-02-22","local_time":"19:00","updated":1456185435000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":24,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/228256859/","description":"<p><img src=\"http://photos2.meetupstatic.com/photos/event/2/4/b/1/600_446529393.jpeg\" /></p> <p>Firebase is the fastest way to build your app. Come and learn how you can build applications quickly without managing complex infrastructure. You'll find out how Firebase's data storage, user management, and asset hosting features work. In addition you'll get to choose, for which platform we'll live-code a chat application. Web or Android?</p> <p>Frank is a Developer Programs Engineer for Google. He helps developers build extraordinary apps that use Firebase as their back-end. If you've ever asked a Firebase question on StackOverflow, you've probably met <a href=\"http://stackoverflow.com/users/209103/frank-van-puffelen\">Frank</a> already. Frank is over in the UK only rarely but is taking time out to talk to us about Firebase.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/2/4/d/2/600_446529426.jpeg\" /></p> <p>Firebase is a really powerful platform for mobile and web applications and can make creating an app easy and powerful, including data storage, user authentication, static hosting, and more.</p> <p>Build cross-platform native mobile and web apps with Android, iOS, and JavaScript SDKs. Connect Firebase to your existing backend using server-side libraries or a REST API. With Firebase, you can store data and authenticate users in your app with just a few lines of code. Joint meeting with the Startup Motor and Develop Oxford Groups.</p> <p>Read about it here: <a href=\"https://www.firebase.com/\" class=\"linkified\">https://www.firebase.com/</a></p> ","visibility":"public","member_pay_fee":false},{"created":1450699462000,"id":"227548659","name":"Google App Engine","date_in_series_pattern":false,"status":"past","time":1457031600000,"local_date":"2016-03-03","local_time":"19:00","updated":1457076678000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":24,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/227548659/","description":"<p>Google App Engine is a powerful platform for building scalable web applications and mobile backends. App Engine provides you with built-in services and APIs such as NoSQL datastores, memcache, and a user authentication API, common to most applications.</p> <p>App Engine will scale your application automatically in response to the amount of traffic it receives so you only pay for the resources you use. Just upload your code and Google will manage your app's availability. There are no servers for you to provision or maintain.</p> <p>A Platform as a Service (PaaS) that lets developers build and run applications on Google’s infrastructure, App Engine provides a wide range of services so you can rapidly develop applications from simple to complex. Developers can work with:<br/>Python<br/>Java<br/>PHP<br/>GO<br/>An overview of Google App Engine (<a href=\"https://cloud.google.com/appengine/docs\"><a href=\"https://cloud.google.com/appengine/docs\" class=\"linkified\">https://cloud.google.com/appengine/docs</a></a>) and the services it offers. </p> <p>Demo covering the deployment of a multi-module Web application uses of the datastore, Cloud Endpoints, REST APIs, different instance types and cron jobs.</p> <p>Omer (@omerio) is a Google Developer Expert for Cloud and specialises in software design and development. For the last 10+ years he has been designing and implementing enterprise systems for companies like Vodafone, HP, Colt and Google enterprise customers. Omer is passionate about software development, emerging technologies and cloud computing. He is also the founder of OfficeMA Timesheet. In his spare time Omer works on his part-time PhD research utilising the Google Cloud Platform in RDF cloud-based rule-based reasoning.</p> ","visibility":"public","member_pay_fee":false},{"created":1451493028000,"id":"227718351","name":"Machine Intelligence for Mobile Devices","rsvp_limit":20,"date_in_series_pattern":false,"status":"past","time":1462816800000,"local_date":"2016-05-09","local_time":"19:00","updated":1462829147000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":17,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/227718351/","description":"<p>Our Speaker: <br/>Blaise Agüera y Arcas is Principal Scientist at Google where he leads a team focusing on Machine Intelligence for mobile devices - including both basic research and new products. His group works extensively with deep neural nets for machine perception, distributed learning, and agents, as well as collaborating with academic institutions on connectomics research.</p> <p>Until 2014 he was a Distinguished Engineer at Microsoft, where he worked in a variety of roles, from inventor to strategist, and led teams with strengths in inter­ac­tion design, pro­to­typ­ing, computer vision and machine vision, augmented reality, wearable com­put­ing and graphics. Blaise has given TED talks on Sead­ragon and Pho­to­synth (2007, 2012) and Bing Maps (2010). In 2008, he was awarded MIT’s prestigious TR35 (“35 under 35”).</p> ","visibility":"public","member_pay_fee":false},{"created":1454336331000,"id":"228523125","name":"Google I/O Extended","date_in_series_pattern":false,"status":"past","time":1463590800000,"local_date":"2016-05-18","local_time":"18:00","updated":1463603325000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":24,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/228523125/","description":"<p>Come and watch the future of tech roll out before your eyes as Alphabet and Google show off some of the new things they plan to launch this year. Expect a new version of Android, something exciting on Tango 3D smartphones and at least one thing we didn't see coming.</p> <p>We have the live feed straight from Mountain View, California and some tee-shirts and other goodies too.</p> ","visibility":"public","member_pay_fee":false},{"created":1493038435000,"duration":15300000,"id":"239450801","name":"Google I/O Extended","date_in_series_pattern":false,"status":"past","time":1495039500000,"local_date":"2017-05-17","local_time":"17:45","updated":1495056104000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":9,"venue":{"id":24463366,"name":"Oxford Hackspace","lat":51.757225036621094,"lon":-1.2621560096740723,"repinned":false,"address_1":"Online only until further notice","address_2":"Oxford city centre","city":"Oxford, OX1","country":"gb","localized_country_name":"United Kingdom","phone":"07708 931042"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/239450801/","description":"<p>This year the Oxford GDG I/O Extended event will be focused around bringing local developers together to better understand the business landscape of Oxfordshire.</p> <p>We will start at 6:00 sharp with several 5 minute presentations from developers using Google technologies, break for 10 minutes and then start watching a slightly delayed stream of the keynote.</p> <p>Get in contact ASAP if you:</p> <p>* are willing to give a 5 minute presentation about what your company is doing using Android or other Google technologies;</p> ","visibility":"public","member_pay_fee":false},{"created":1539809241000,"duration":7200000,"id":"255617384","name":"GDG Oxford - 'Smooth Criminals': Animation in Android","rsvp_limit":33,"date_in_series_pattern":false,"status":"past","time":1540315800000,"local_date":"2018-10-23","local_time":"18:30","updated":1540327078000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":11,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":false,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/255617384/","description":"<p>Talk:</p> <p>Smooth Criminals, Animation in Android</p> <p>\"How did they do that?!\" How many times have you been just stunned, STUNNED by the work you see others do in a fully native app? Smooth, layered animations for every transition that work on even $20 phones? It's not magic and it may not be as difficult or as \"mathy\" as you might think. \"Wow\" effects that impress and delight! Stacy will be exploring how to use multiple ways to accomplish a standard set of animations and much slicker more complicated ones using native and external libraries.</p> <p>From the native side you will cover topics like using the new MotionLayout, animation XML definitions, Material Design AppCompat included tools, moving through ObjectAnimators, Animation Properties, Listeners, View Animators, AnimationSets, even AnimatedVectorDrawables, Morphs, and libraries like Lottie. Finally finishing with going \"manual\" in Canvas to get that precise experience. You will learn what to use where and how for Best Performance and Best Practices.</p> <p>Speaker:</p> <p>Stacy is a Google Developer Expert for Android, Intel Innovator, Google Developer Group Mentor, and WTM Lead. She has worked on Android Applications down to the whole Android OS and even developed IoT appliances from the ground up which are in use by companies like Apple and Amazon and has work featured on Wired, Gizmodo, and Geek.com . She has built Apps that have tens of millions of active users and developed cloud solutions at scale. She currently works for Nike s23NYC Labs doing Android apps like the SNKRS, focused on delivering exceptional customer mobile experiences through rich media, geo-synced content, and augmented reality.</p> <p>Agenda:</p> <p>18:30 - Registration, Pizza and Drinks<br/>19:00 - Intro to GDG Oxford<br/>19:05 - Stacy Devino<br/>20:00 - Networking<br/>20:30 - Home time!</p> ","visibility":"public","member_pay_fee":false},{"created":1543873000000,"duration":9000000,"id":"256924006","name":"Creating ML-powered applications","rsvp_limit":33,"date_in_series_pattern":false,"status":"past","time":1545330600000,"local_date":"2018-12-20","local_time":"18:30","updated":1545421557000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":33,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":true,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/256924006/","manual_attendance_count":22,"description":"<p>***Join us at GDG Oxford for a Christmas Special!***</p> <p>Each day we are hearing yet another application that announces a new cool feature powered by machine learning. It’s pretty exciting but when the time comes to deep diving into machine learning, it can be intimidating, especially if you don’t have machine learning background.</p> <p>In this session, you will get the gist of newly announced MLKit &amp; Tensorflow Lite. We'll be learning about MLKit features and creating custom Tensorflow model and using it in app via MLKit.</p> <p>Speaker: Buşra Deniz Akın<br/>Android Dev @TAB, Women Techmakers Lead, Co-Organiser @GDGLondon</p> <p>Buşra is a software engineer who has a keen interest in developing high-quality mobile applications. Currently, she’s working for The App Business. Besides being co-organiser in two different communities, Google Developer Group and WomenTechMakers London, she enjoys voluntarily organising and speaking at developer events.</p> <p>Agenda:<br/>18:30-19:00: Welcome, pizza and nibbles (vegetarian options available)<br/>19:00-19:15: Discussing Tech Inclusion, and listening to the attendees about what they'd like to see for 2019<br/>19:15-20:00: Speaker (Buşra Deniz Akın)<br/>20:00-20:15: Q&amp;A<br/>20:15-21:00: Networking</p> <p>N.B: Come equipped with your questions about ML Kit, and suggestions for upcoming events/speakers/topics/workshops you'd like for us to provide for you!</p> <p>If there are any dietary/other requirements, please feel free to inform the organisers and we will do our utmost best to make sure you are taken care of. Our events are for everyone :)</p> ","visibility":"public","member_pay_fee":false},{"created":1546961326000,"duration":10800000,"id":"257896257","name":"Google Cloud's IoT and ML - An opportunity to ask the experts from Google!","rsvp_limit":33,"date_in_series_pattern":false,"status":"past","time":1547229600000,"local_date":"2019-01-11","local_time":"18:00","updated":1547244062000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":33,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":true,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/257896257/","description":"<p>***Google Cloud's IoT and ML - An introduction, latest announcements and the opportunity to ask the experts ***</p> <p>In our first Meetup for 2019, we will be hosting 2 amazing Googlers specialised in the Internet of Things and Machine Learning. Come and join us to learn from the experts themselves!</p> <p>Speakers</p> <p>Concepcion Diaz: (people call her Conchita) works as a trainer in Big Data and Machine Learning at Google. Passionate about teaching technology and networks during her first 15 years of career she trained more than 5000 persons in different countries (Spain, UK, Brussels, Germany, Holland, Belgium, Portugal, Italy, Poland, Russia, Latvia, USA..) about how to design and optimized their networks. During this time also wrote 10 Educational IT Manuals used around Europe about LAN/WAN networks, Telephony over IP and Data Security. During this time becomes the unique woman in the world with six active CCIE certifications (less than 5 persons in the world). Few years ago she discovered the power of the data and machine learning technologies studying for her PhD, turning his career completely focusing on teaching those emerging and passionate technologies.</p> <p>Roberto Barbero: Since his father gave him his first electronics kit at the age of 5, he's been electrocuted more than once (per week). Nowadays he<br/>still plays with the same kits, but gets paid for it at Google, as an IoT Specialist supporting the EMEA region. Previously he worked for Salesforce IoT, VMware, Hewlett-Packard and Veritas Software. Passionate about Traveling, Photography and Architecture.</p> <p>Agenda:<br/>18:00-18:30: Welcome, pizza and nibbles (vegetarian options available)<br/>18:30-20:30: Talks and Q&amp;A<br/>20:30-21:00: Networking</p> <p>If there are any dietary/other requirements, please feel free to inform the organisers and we will do our utmost best to make sure you are taken care of. Our events are for everyone :)</p> ","visibility":"public","member_pay_fee":false},{"created":1550495790000,"duration":10800000,"id":"259062259","name":"Google Assistant Day - Ethics, Apps, and Personas!","rsvp_limit":33,"date_in_series_pattern":false,"status":"past","time":1551722400000,"local_date":"2019-03-04","local_time":"18:00","updated":1551736595000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":14,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":true,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/259062259/","description":"<p>Google Assistant Day - Ethics, Apps, and Personas!</p> <p>Join us for 3 talks/workshops, all about Google's Voice Recognition - The Google Assistant</p> <p>Talk 1 - Exploring ethical and privacy issues in the Assistant - Hawra Milani<br/>Talk 2 - Crafting a Character: Create a Persona for your Google Assistant App - Dr. Aygul Zagidullina<br/>Talk 3 - Creating Your First Google Assistant App - Kaan Mamikoglu</p> <p>Speaker Bios:</p> <p>Dr. Aygul Zagidullina is a Google Developer Expert (GDE) for Assistant based in London, UK. Her work experience includes Google, Todoist, MotaWord. She holds a PhD in quantum chemistry and prior to Google dedicated 6 years to scientific research at the University of Stuttgart. Aygul is a very active member of the London digital ecosystem and has been involved in many innovative projects. She is a Google Developer Group (GDG)/ Women Techmakers (WTM) London lead, Google Launchpad mentor, Google Product Expert (PE) for Assistant/ Trusted Tester (TT), and UK STEM Ambassador. Aygul has been a distinguished speaker at numerous international industry events in the US, UK, Germany, Austria, Ireland, Italy, France, UAE, Greece, Romania, Czech Republic, Poland, Turkey, Latvia, Georgia, Belarus, Russia. She was named as one of The NEXT 100 Top Influencers of the European Digital Industry in 2013.</p> <p>Kaan Mamikoglu is an Android developer and a Google Developer Expert (GDE) for Firebase, based in London, UK. As an active community builder, he has co-organized a lot of developer events in the UK and Turkey such as DevFests, Android Developer Days’, Android Study Jams, and has been a distinguished speaker at many international industry events in the US, UK, Austria, Italy, Czech Republic, Belarus, Romania, UAE, Turkey and Georgia. Besides being a Google Developer Group (GDG) London lead, he is a Google Product Expert (PE) for Google Play/ Trusted Tester (TT) and a Google Local Guide for London. Kaan is passionate about exploring new technologies and traveling around the world.</p> <p>Agenda:<br/>18:00-18:15: Welcome, pizza and nibbles (vegetarian options available)<br/>18:15-20:45: Talks and Q&amp;A<br/>20:45-21:00: Networking</p> <p>If there are any dietary/other requirements, please feel free to inform the organisers and we will do our utmost best to make sure you are taken care of. Our events are for everyone :)</p> ","visibility":"public","member_pay_fee":false},{"created":1559709604000,"duration":7200000,"id":"262055900","name":"Googler Tech Talk - Turn your app data into answers with Firebase and BigQuery","rsvp_limit":35,"date_in_series_pattern":false,"status":"past","time":1560274200000,"local_date":"2019-06-11","local_time":"18:30","updated":1560288796000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":20,"venue":{"id":4035442,"name":"Oxford Centre for Innovation","lat":51.752197265625,"lon":-1.2620340585708618,"repinned":true,"address_1":"New Road","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/262055900/","description":"<p>Join us this Tuesday for an exclusive talk from a renowned international speaker, and a Software Engineering Leader at Google.</p> <p>*exclusive GDG swag giveaway to all our attendees*</p> <p>Talk:</p> <p>Turn your app data into answers with Firebase and BigQuery.</p> <p>When you link a BigQuery project to your Firebase app, you can export a range of data, query, and even join your own data sources to perform custom analysis. In this session, you’ll learn how to answer questions through hands-on tips for building queries. Want to take it further? Learn how to leverage Data Studio to build your own reports and dashboards on top of your Firebase BigQuery data.</p> <p>Speaker:</p> <p>Tali Sason is a software engineering leader at Google, where she coaches the talented teams of engineers building Firebase App Quality products. This includes Crashlytics, the #1 crash reporting solution in the world, running on over 3 billion devices. She also serves as the Google Cambridge site lead, helping ensure the office is a respectful and inclusive place where all employees can do their best work to make a positive impact on Google and our community.</p> <p>Before joining Google via acquisition, Tali worked on Crashlytics at Twitter. During her tenure at the social media giant, she helped create Twitter Women in an effort to make the workplace more inclusive and diverse. Prior to that, Tali was a senior engineering manager at Wayfair where she founded Wayfair Labs.</p> <p>Tali has a BS in Computer Engineering from Bucknell University. When she’s not eating tater tots in the Google cafeteria, you might find her performing and taking classes at Improv Boston or at home in Arlington, MA with her husband and two dogs binge watching Netflix.</p> <p>Agenda:<br/>18:30-19:00: Welcome, pizza and nibbles (vegetarian options available)<br/>19:00-20:00: Talks and Q&amp;A<br/>20:00-20:30: Networking</p> <p>If there are any dietary/other requirements, please feel free to inform the organisers and we will do our utmost best to make sure you are taken care of. Our events are for everyone :)</p> ","visibility":"public","member_pay_fee":false},{"created":1568186448000,"duration":9000000,"id":"264744408","name":"Kotlin/Everywhere - Kübra Harmankaya ","rsvp_limit":30,"date_in_series_pattern":false,"status":"past","time":1569000600000,"local_date":"2019-09-20","local_time":"18:30","rsvp_open_offset":"PT168H30M","updated":1569018119000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":10,"venue":{"id":26634908,"name":"The H B Allen Centre, Middle Common Room","lat":51.76115798950195,"lon":-1.2603939771652222,"repinned":true,"address_1":"25 Banbury Road","city":"Oxfordshire","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/264744408/","description":"<p>We are hosting a Kotlin/Everywhere, featuring Kübra Harmankaya as our guest and speaker!</p> <p>She will talk to us about her experience, and what she learned from major sports brands. She has contributed to many Android Apps for FC Barcelona, Premier League, FFA, British Council, General Electric and for many other companies.</p> <p>It's a great opportunity for GDG Oxford community of developers to attend her talk and Codelab. Don't miss your chance to meet her and connect!</p> <p>TALK - WHAT I LEARNED FROM MAJOR SPORTS BRANDS<br/>Kübra will be talking about her experience using Kotlin/Everywhere in production to build mobile applications and give us tips and tricks to manage a Kotlin project.</p> <p>CODE LAB - REFACTORING TO KOTLIN<br/>Together, with Kübra, we will follow-up with a basic code lab that will help us understand the concepts brought by Kotlin to build great Android Apps!</p> <p>BRING YOUR LAPTOP!<br/>Don't forget your laptops and chargers if you want to take part in our code lab!</p> <p>WHAT SHOULD YOU HAVE INSTALLED ON YOUR LAPTOP?</p> <p>IntelliJ IDEA<br/>=&gt; <a href=\"https://www.jetbrains.com/idea/\" class=\"linkified\">https://www.jetbrains.com/idea/</a></p> <p>AND/OR</p> <p>Android Studio<br/>=&gt; <a href=\"https://developer.android.com/studio/\" class=\"linkified\">https://developer.android.com/studio/</a></p> ","visibility":"public","member_pay_fee":false},{"created":1570098866000,"duration":7200000,"id":"265371128","name":"CD & CI Done in Google Cloud","rsvp_limit":30,"date_in_series_pattern":false,"status":"past","time":1571158800000,"local_date":"2019-10-15","local_time":"18:00","updated":1571173040000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":22,"venue":{"id":26634908,"name":"The H B Allen Centre, Middle Common Room","lat":51.76115798950195,"lon":-1.2603939771652222,"repinned":true,"address_1":"25 Banbury Road","city":"Oxfordshire","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/265371128/","description":"<p>Talk:</p> <p>We set up a completely automated deployment process that starts with your code repository, builds automated images, and get them running in a Kubernetes Engine, all in Google Cloud. No more Server management, just focus on what you like doing most: building great stuff. We will use Docker, the Container Builder Kubernetes Engine, Code Repository and Cloud Code.</p> <p>Speaker:</p> <p>Mario is a Google Developer Expert, who focuses on Cloud Technologies and tries to spread the knowledge throughout the communities.</p> <p>As a Software Architect for Königspunkt Mario also is working with various Javascript based frameworks to develop SaaS solutions and move them to the cloud.</p> <p>Venue: Mille's Room, H B Allen centre, Keble College, 25 Banbury Road, OX2 6NN</p> <p>Food and drink will be available as always. Please let us know of any dietary restrictions!</p> ","visibility":"public","member_pay_fee":false},{"created":1571837549000,"duration":10800000,"id":"265898086","name":"How to Securely Share Sensitive Data in the Cloud using Blockchain and GKE","date_in_series_pattern":false,"status":"past","time":1573063200000,"local_date":"2019-11-06","local_time":"18:00","updated":1573080529000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":26,"venue":{"id":26697412,"name":"Keble College Annex","lat":51.76115798950195,"lon":-1.2603939771652222,"repinned":false,"address_1":"25 Banbury Rd","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/265898086/","description":"<p>We have a very special speaker for our next meetup, Gus Maskowitz from Gospel Technology.</p> <p>Talk Description:<br/>Securing data is an understood task - it’s doable and achievable if you work hard and pay attention. Securing *SHARED* data is a mess of all-or-nothing access, contracts and hope: handing over data en mass and hoping it goes well. Gospel Technology has worked out how to solve the problem - we use a blockchain for creating a fool-proof audit log and patented methods for consensus on READING data OUT to ensure reads are always logged and only granted to those with permissions, even as your data extends into a partner organisation, far beyond your access controls and policy enforcing middleware. How? We’ll show you! And help you build ridiculously secure data, PII and other sharing systems to solve real world problems.</p> <p>Speaker Bio:<br/>Gus Maskowitz heads up Gospel’s Developer Relations, consulting on product features and enhancements, developer initiatives, and technical strategy. He is a former Google Developer Advocate and spent 10 years at Rackspace in various product, engineering and technologist roles. You can find him at various speaking engagements, conferences and meetups throughout the UK and Nordics.</p> <p>* As always food will be provided so let us know if you have any dietary requirements!</p> ","how_to_find_us":"Millie's Room","visibility":"public","member_pay_fee":false},{"created":1579814392000,"duration":9000000,"id":"268150955","name":"Progressive Loading with a Progressive Framework","date_in_series_pattern":false,"status":"past","time":1580493600000,"local_date":"2020-01-31","local_time":"18:00","updated":1580505808000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":8,"venue":{"id":26827074,"name":"The H B Allen Centre","lat":51.76115798950195,"lon":-1.2603939771652222,"repinned":false,"address_1":"25 Banbury Rd","city":"Oxford","country":"gb","localized_country_name":"United Kingdom"},"group":{"created":1418806051000,"name":"GDG Oxford","id":18258480,"join_mode":"open","lat":51.75,"lon":-1.2799999713897705,"urlname":"GDG-Oxford","who":"GDG Oxford Members","localized_location":"Oxford, United Kingdom","state":"K2","country":"gb","region":"en_US","timezone":"Europe/London"},"link":"https://www.meetup.com/GDG-Oxford/events/268150955/","description":"<p>Happy New Year GDG Oxford!</p> <p>We are starting the year with an amazing talk by Vladimir Salin! Details below. As always, there will be pizza, so do let us know if you have any dietary requirements.</p> <p>Speaker Bio:<br/>Vladimir has been exposed to web development for more than a decade and currently works at Optellum on the MedTech/AI product helping clinicians with an early lung cancer diagnosis. Apart from the Fullstack Engineer role, he grows a few pet projects where he experiments with modern technologies and tries out new efficient ways of solving software problems.</p> <p>Talk Abstract:<br/>Let’s be honest: getting content instantaneously became today’s normal. Be it a wall of text or a wall of images, users want to see high-quality data on their devices straight away. With the myriad of devices, platforms and technology stacks, a seemingly simple task of serving images to the client takes a new form. Whereas we know a number of solutions used in the world of web and modern browsers, one would struggle to find a similar one-fits-all approach for the whole diversity of popular devices.</p> <p>In this talk, I share the results of an experiment aiming to find a reliable way to serve images progressively &amp; smoothly to a user on the main platforms supported by the Flutter toolkit. We will talk a bit about the current state of progressive images loading problem and potential ways of approaching it, and also have fun at a hands-on Dart coding session where we will try to achieve a seamless page load on different devices using a single codebase without touching any platform-specific framework. Zero knowledge of mobile development required!</p> ","visibility":"public","member_pay_fee":false}],"upcoming":[],"organizers":[{"id":184291957,"name":"Klaudia","status":"active","joined":1423479768000,"city":"Warsaw","country":"pl","localized_country_name":"Poland","lat":52.26,"lon":21.02,"photo":{"id":243661819,"highres_link":"https://secure.meetupstatic.com/photos/member/7/1/b/highres_243661819.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/7/1/b/member_243661819.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/7/1/b/thumb_243661819.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1571838971000,"created":1540288746000,"updated":1559212193000,"role":"coorganizer","group":{"id":18258480,"urlname":"GDG-Oxford","name":"GDG Oxford","status":"active","who":"GDG Oxford Members","members":422,"join_mode":"open","localized_location":"Oxford, United Kingdom"},"link":"https://www.meetup.com/GDG-Oxford/members/184291957/"},"is_pro_admin":false},{"id":188070954,"name":"Hawra M.","status":"active","joined":1433154155000,"city":"London","country":"gb","localized_country_name":"United Kingdom","state":"17","lat":51.52,"lon":-0.09,"photo":{"id":278549549,"highres_link":"https://secure.meetupstatic.com/photos/member/7/3/6/d/highres_278549549.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/7/3/6/d/member_278549549.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/7/3/6/d/thumb_278549549.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1580307254000,"created":1524943974000,"updated":1530568998000,"role":"organizer","group":{"id":18258480,"urlname":"GDG-Oxford","name":"GDG Oxford","status":"active","who":"GDG Oxford Members","members":422,"join_mode":"open","localized_location":"Oxford, United Kingdom"},"link":"https://www.meetup.com/GDG-Oxford/members/188070954/"},"is_pro_admin":false},{"id":195972512,"name":"Iulian A.","status":"active","joined":1448305275000,"city":"Oxford","country":"gb","localized_country_name":"United Kingdom","state":"K2","lat":51.76,"lon":-1.26,"photo":{"id":264130976,"highres_link":"https://secure.meetupstatic.com/photos/member/2/a/e/0/highres_264130976.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/2/a/e/0/member_264130976.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/2/a/e/0/thumb_264130976.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1572094114000,"created":1463511963000,"updated":1530128815000,"role":"coorganizer","group":{"id":18258480,"urlname":"GDG-Oxford","name":"GDG Oxford","status":"active","who":"GDG Oxford Members","members":422,"join_mode":"open","localized_location":"Oxford, United Kingdom"},"intro":"Developer of the 2000AD comic book reader and other mobile apps at Rebellion.","link":"https://www.meetup.com/GDG-Oxford/members/195972512/"},"is_pro_admin":false},{"id":256330535,"name":"Bushra A.","status":"active","joined":1528537096000,"city":"Oxford","country":"gb","localized_country_name":"United Kingdom","state":"K2","lat":51.76,"lon":-1.26,"group_profile":{"status":"active","visited":1581673188000,"created":1535191213000,"updated":1539812208000,"role":"coorganizer","group":{"id":18258480,"urlname":"GDG-Oxford","name":"GDG Oxford","status":"active","who":"GDG Oxford Members","members":422,"join_mode":"open","localized_location":"Oxford, United Kingdom"},"link":"https://www.meetup.com/GDG-Oxford/members/256330535/"},"is_pro_admin":false}]}
