{"events":[{"created":1548705437000,"duration":7200000,"id":"258475774","name":"Relanzamiento del GDG San Salvador. Firebase ML Kit, Android Jetpack y Kotlin.","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1549582200000,"local_date":"2019-02-07","local_time":"17:30","rsvp_open_offset":"PT80H30M","updated":1549594983000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":70,"venue":{"id":26124328,"name":"Banco Agricola Operations Center","lat":13.700606346130371,"lon":-89.22711944580078,"repinned":true,"address_1":"Pje Senda Florida Sur","city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/258475774/","description":"<p>Este es el primer evento del nuevo GDG San Salvador, grupo oficial de Google Developers de San Salvador.</p> <p>¿Eres un(a) profesional desempeñándote como Mobile App Developer, Data Analyst o Programador y programas en JavaScript, Java o cualquier otro lenguaje de programación orientado a objetos o funcional y/o un(a) estudiante Universitario de últimos años de carreras de Ingeniería en Sistemas o Ciencias de la Computación y/o entusiasta de tecnologías de Google?... ¡Este evento es para ti!</p> <p>Ven y conoce el increíble Centro de Innovación de Banco Agrícola, entérate de oportunidades laborales de nuestros patrocinadores y escucha interesantes charlas de las que aprenderás sobre diversas tecnologías de punta en desarrollo Android y Machine Learning impartidos por Desarrolladores y Conferencistas de nivel Internacional.</p> <p>PROGRAMA:</p> <p>5:30 PM: Ingreso.</p> <p>5:50 PM: Relanzamiento oficial GDG San Salvador. Palabras de Bienvenida del Organizador, agradecimiento a patrocinadores.</p> <p>6:00 PM, Charla: The quest for fire: Firebase ML Kit</p> <p>Descripción:</p> <p>Speaker: Adrián Catalán | <a href=\"https://ykro.github.io\" class=\"linkified\">https://ykro.github.io</a> | <a href=\"https://twitter.com/ykro\" class=\"linkified\">https://twitter.com/ykro</a></p> <p>Adrián ha estado involucrado en la industria del software por más de 15 años, trabajando tanto en aplicaciones web como móviles. Organizador del GDG Guatemala, GuatemalaJS y ex co-organizador del Facebook Developers Circle Guatemala y de Nodebots. Actualmente lidera el Laboratorio de Innovación en la Universidad de Galileo y es un Experto en Desarrollo de Google (GDE) para Android, IoT y Firebase.</p> <p>Adrián fue el primer Latinoamericano en ser reconocido por Google como Google Developer Expert (GDE) y es un Speaker (conferencista) de nivel Internacional que ha recorrido el Mundo entero impartiendo charlas sobre diferentes temas relacionados a la tecnología.</p> <p>6:45 PM, Charla: Hacia el Infinito y más allá con Android Jetpack y Kotlin.</p> <p>Speaker: Oscar Salguero | <a href=\"https://oscarsalguero.com\" class=\"linkified\">https://oscarsalguero.com</a> | <a href=\"https://twitter.com/OscarSalguero\" class=\"linkified\">https://twitter.com/OscarSalguero</a></p> <p>Oscar empezó a programar a los 12 años mientras estudiaba en la escuela secundaria en San Salvador. Desde el año 2,000, Oscar ha desarrollado software de todo tipo para compañías de todo tamaño usando varias tecnologías y lenguajes de programación, ha co-fundado startups en Estados Unidos, liderado el desarrollo tecnológico en un incubador y agencia digital en Nueva York, se ha especializado en desarrollo de aplicaciones móviles y ha asistido e impartido charlas sobre Android y Android Things en diferentes eventos Internacionales.</p> <p>Actualmente, Oscar esta a cargo del desarrollo de aplicaciones Android para la empresa BeenVerified basada en Nueva York. Apps Web y móviles desarrolladas por Oscar son usadas por millones de usuarios en más de 50 países alrededor del Mundo.</p> <p>7:20 PM: Rifa y cierre.</p> <p>Enlaces Relacionados:</p> <p>- Firebase ML Kit: <a href=\"https://firebase.google.com/products/ml-kit/\" class=\"linkified\">https://firebase.google.com/products/ml-kit/</a></p> <p>- Android Jetpack: <a href=\"https://developer.android.com/jetpack/\" class=\"linkified\">https://developer.android.com/jetpack/</a></p> <p>- Kotlin: <a href=\"https://kotlinlang.org/\" class=\"linkified\">https://kotlinlang.org/</a></p> <p>Refrigerio: Se servirá Pizza y bebidas no-alcohólicas.</p> <p>Nota Importante: El estacionamiento en Banco Agrícola es limitado, si vienes con colegas del trabajo, vecinos, familiares o estudiantes de tu mismo centro educativo, te recomendamos hacer car pooling con ellos.</p> ","how_to_find_us":"El Centro de Innovación de Banco Agrícola está en 3er nivel del edificio conocido como Centro de Operaciones ubicado en 69 Av Sur Pasaje Senda Florida, entre Avenida Olímpica y Paseo General Escalón en San Salvador.","visibility":"public","member_pay_fee":false},{"created":1553191671000,"duration":36000000,"id":"259962694","name":"IWD Women Techmakers El Salvador 2019 [Joint Event + GDG La Libertad]","rsvp_limit":75,"date_in_series_pattern":false,"status":"past","time":1554559200000,"local_date":"2019-04-06","local_time":"08:00","rsvp_open_offset":"PT152H","rsvp_close_offset":"PT20H","updated":1554597355000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":22,"venue":{"id":26266687,"name":"Telus Las Cascadas","lat":13.67847728729248,"lon":-89.25182342529297,"repinned":true,"city":"Cd Merliot","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/259962694/","description":"<p>Women Techmakers La Libertad, GDG La Libertad, Women Techmakers San Salvador y GDG San Salvador son comunidades en la cuales jovencitas y mujeres de todas las edades interesadas en incursionar o expandir sus habilidades en el mundo de la tecnología pueden compartir sus conocimientos y experiencias, inspirarse e incentivarse unas a otras para lograr superarse personal y profesionalmente.</p> <p>Este evento es para hombres y mujeres por igual.</p> <p>Women Techmakers La Libertad, GDG La Libertad, Women Techmakers San Salvador y GDG San Salvador te invitan a compartir un día lleno de inspiración, aprendizaje sobre tecnología, y networking.</p> <p>We are proud to be hosting the 2019 International Women's Day Celebration, a women's tech conference. This event will highlight the stories of our growing female community of designers, developers, and technology entrepreneurs.</p> <p>PARA ASISTIR A ESTE EVENTO DEBERÁS</p> <p>1. Obtener tus ticket en EVENTBRITE (<a href=\"https://iwd-wtm-elsalvador-2019.eventbrite.com\" class=\"linkified\">https://iwd-wtm-elsalvador-2019.eventbrite.com</a>) para asistir a:<br/>- Programa de la mañana: Taller Firebase Hosting (20).<br/>y/o<br/>- Programa de la tarde: Charlas y panel (125).<br/>2. Hacerte miembro de GDG San Salvador y/o GDG La Libertad aquí en Meetup para estar al tanto de este y otros eventos de la comunidad.</p> <p>IMPORTANTE: Necesitarás ambos tickets si quieres asistir tanto al taller de la mañana como charlas y panel de la tarde.</p> <p>PROGRAMA</p> <p>El evento tendrá un taller sobre tecnologías Google por la mañana, continuando en la tarde con charlas impartidas por Speakers de calibre Internacional y líderes en diversas áreas de la tecnología, además de un panel con mujeres en tecnología que compartirán con la audiencia sus experiencias incursionando y trabajando en este campo.</p> <p>PROGRAMA DE LA MAÑANA</p> <p>8:00 AM: Registro de asistentes<br/>9:00 AM: Taller: \"Crea tu sitio web personal o profesional usando Firebase Hosting\". Impartido por Oscar Salguero.<br/>12:00 M: Finaliza el taller.<br/>12:15 PM: Power Lunch &amp; Networking para los 20 participantes del taller</p> <p>NOTA: Los tickets para el programa de la mañana están agotados. Cada uno(a) de los asistentes al programa al taller deberá traer su propia laptop, notebook con Windows o Mac y tener un ticket de Eventbrite para el taller.</p> <p>PROGRAMA DE LA TARDE</p> <p>1:30 PM: Registro de asistentes<br/>2:00 PM: Palabras de bienvenida por organizadores de comunidades GDG<br/>2:15 PM: Mensajes de nuestros patrocinadores<br/>2:30 PM: Charla de Speaker Internacional Alejandra Gil, \"Android a 10K pies de Altura\".<br/>3:15 PM: Charla de Speaker Internacional Fernanda Ochoa (desde León, Guanajuato), \"Como construir tu propio Jarvis (asistente de Tony Stark) con Actions on Google, Firebase y Hardware de bajo costo\".<br/>4:00 PM: Coffee Break &amp; Networking<br/>4:15 PM: Panel con mujeres exitosas en tecnología. Nos acompañan: Rosa María Orantes, Juliana Ceballos, Ingrid Benítez, Camila Orantes y Alejandra Gil.<br/>5:45 PM: Dinámica para rifa<br/>6:00 PM: Agradecimientos y cierre</p> <p>PATROCINAN<br/>- TELUS International, El Salvador <a href=\"http://telusjobssv.com\" class=\"linkified\">http://telusjobssv.com</a><br/>- Vertex Studios <a href=\"https://vertexstudio.co\" class=\"linkified\">https://vertexstudio.co</a><br/>- Happy Punk Panda <a href=\"http://happypunkpanda.com\" class=\"linkified\">http://happypunkpanda.com</a><br/>- TechLovers FM <a href=\"https://www.facebook.com/TechLovers\" class=\"linkified\">https://www.facebook.com/TechLovers</a><br/>- elsalvador.com <a href=\"https://www.elsalvador.com\" class=\"linkified\">https://www.elsalvador.com</a><br/>- Real Action Software <a href=\"https://realactionsoft.com\" class=\"linkified\">https://realactionsoft.com</a></p> <p>NOTA: El cupo del programa de la tarde de charlas y panel es limitado. Cada uno(a) de los asistentes al programa de la tarde deberá tener su ticket de Eventbrite.</p> <p>NOTA: Debido a políticas de seguridad de nuestros patrocinadores de local para el evento, TELUS International y que no tenemos servicios de guardería, no se admitirá traer niños(as) pequeños. Todo(a) jovencito(a) menor de edad que asista al taller de la mañana y/o charlas y panel de la tarde, deberá traer consigo su carnet de minoridad y/o carnet de estudiante válido de su institución educativa.</p> <p>PARQUEO: Estacionarse en Centro Comercial Las Cascadas. El parqueo corre por cuenta del propietario del vehículo.</p> <p>COSTO: Evento GRATUITO.</p> ","how_to_find_us":"La entrada al evento de Women Techmakers El Salvador 2019 en TELUS estará ubicada en el segundo piso de SOHO (nueva ala del Centro Comercial Las Cascadas).\nRutas de buses cercanas: 101-D, 44 Coaster.","visibility":"public","member_pay_fee":false},{"created":1553286938000,"duration":14400000,"id":"259992972","name":"Google I/O Extended San Salvador 2019","rsvp_limit":65,"date_in_series_pattern":false,"status":"past","time":1562972400000,"local_date":"2019-07-12","local_time":"17:00","rsvp_close_offset":"PT48H","updated":1562989522000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":60,"venue":{"id":26099368,"name":"SEED ESCALON","lat":13.706817626953125,"lon":-89.25272369384766,"repinned":true,"address_1":"CP 1101","city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/259992972/","description":"<p>GDG San Salvador, la comunidad de desarrolladores de Google en San Salvador organiza el GDG Google I/O Extended San Salvador 2019.</p> <p>Veremos partes importantes del evento Google I/O 2019 que se llevó a cabo en los cuarteles generales de Google en Mountain View, CA en Mayo y que están relacionadas a varias tecnologías como Flutter, Android, y Google Cloud. Tendremos interesantes charlas sobre estos temas impartidas por conferencistas con amplia experiencia en el tema.</p> <p>Lugar: SEED Escalón<br/>Fecha: Viernes 12 de Julio<br/>Hora: 5PM a 9PM</p> <p>AGENDA:</p> <p>5:00 PM Registro de asistentes.</p> <p>5:30 PM Palabras de apertura y anuncios de la comunidad.</p> <p>5:45 PM Repasaremos los avances más importantes en tecnologías de Google que se usan y podemos usar en El Salvador dadas a conocer en Mayo el Google I/O 2019.</p> <p>6:30 PM Darvin Otero, Fundador de Aeegle y CTO de Better Ride, nos enseñará como hacer una app local en Kubernetes y como lanzarla en cualquier Nube.</p> <p>7:15 PM Carlos Morán, Chief Information Officer de Mussol, nos platicará sobre Experiencia de Usuario (UX) en Flutter.</p> <p>8:00 PM Pizza Break y Networking</p> <p>8:15 PM Amilcar Serrano, Lead Android Developer en Avantica Technologies y Fundador de Android Developers SV y Developers SV, nos compartirá Best &amp; Common Practices en desarrollo de Software y desarrollo Android.</p> <p>8:45 PM Rifa y palabras de cierre.</p> <p>Para poder asistir al #io19extended es indispensable que te hagas miembro de nuestra comunidad en Meetup y hacer RSVP a este etento de Meetup. El cupo es limitado y si no completas el proceso de RSVP en meetup no podrás ingresar.</p> <p>Se recomienda hacer \"car pooling\" para llegar al lugar y facilitar el parqueo cerca de Seed Escalón.</p> ","how_to_find_us":"SEED es un Centro de Negocios Colaborativo ubicado en 138 Pje. José Camilo Campos, 5ta Calle poniente, Colonia Escalón San Salvador San Salvador SV, CP 1101, San Salvador.\nPunto de referencia: Tres cuadras y media arriba de Starbucks Masferrer.","visibility":"public","member_pay_fee":false},{"created":1567448335000,"duration":7200000,"id":"264501860","name":"PyTorch Summer Hackathon #PTSH19","date_in_series_pattern":false,"status":"past","time":1567454400000,"local_date":"2019-09-02","local_time":"14:00","updated":1567463698000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":4,"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/264501860/","description":"<p>En este hackathon Global en la que puedes participar 100% remoto y en línea, tu o tu equipo tendrá la oportunidad de ganar más de USD$60,000.00 en premios en efectivo y más.</p> <p>PyTorch es un framework de aprendizaje automático de código abierto (Open Source) que es utilizado por investigadores y desarrolladores para construir, entrenar e implementar sistemas de machine learning que resuelven muchos desafíos complejos diferentes. GDG San Salvador y el equipo de PyTorch te invita a hackear con la comunidad de PyTorch para crear modelos innovadores y de impacto, aplicaciones y otros proyectos que generen un impacto positivo para las empresas o las personas.</p> <p>PyTorch evoluciona constantemente para facilitar la vida y brindar herramientas mas ágiles a los investigadores para pasar de la exploración e investigación al la implementación y lanzamiento a producción. Algunas de las capacidades y herramientas de PyTorch con las que puede trabajar para el hackathon incluyen:</p> <p>- Entrenamiento distribuido escalable y rendimiento optimizado<br/>- PyTorch JIT / TorchScript (<a href=\"https://pytorch.org/docs/stable/jit.html\" class=\"linkified\">https://pytorch.org/docs/stable/jit.html</a>) para la transición de modelos de investigación a producción<br/>- Un conjunto robusto de librerías y herramientas (<a href=\"https://pytorch.org/ecosystem\" class=\"linkified\">https://pytorch.org/ecosystem</a>) para acelerar el desarrollo de:<br/>- Visión por computadora - torchvision (<a href=\"https://github.com/pytorch/vision\" class=\"linkified\">https://github.com/pytorch/vision</a>)<br/>- Procesamiento del lenguaje natural - torchtext (<a href=\"https://github.com/pytorch/text\" class=\"linkified\">https://github.com/pytorch/text</a>)<br/>- Reconocimiento de voz y análisis de audio - torchaudio (<a href=\"https://github.com/pytorch/audio\" class=\"linkified\">https://github.com/pytorch/audio</a>)<br/>- Modelos pre-entrenados en PyTorch Hub (Beta) (<a href=\"https://pytorch.org/hub\" class=\"linkified\">https://pytorch.org/hub</a>)</p> <p>Los ganadores del primer lugar también recibirán pasajes aéreos de ida y vuelta para asistir a la Conferencia de Desarrolladores PyTorch y presentar sus proyectos en el evento.</p> <p>Requisito Principal</p> <p>Crea una solución creativa y bien implementada utilizando PyTorch que pueda generar un impacto positivo en las empresas o las personas. La solución puede ser un modelo de aprendizaje automático, una aplicación o un proyecto creativo como arte o música creados con PyTorch.</p> <p>Todas las soluciones junto con los activos requeridos a continuación deben enviarse antes de las 2:00 PM del 16 de septiembre de 2019.</p> <p>Deberás presentar lo siguiente:</p> <p>1. Video de demostración: (alojado en YouTube, Facebook Video, Vimeo o Youku). Su video debe durar alrededor de 1-3 minutos (puede ser un poco más largo si es necesario), incluir una demostración de su aplicación de trabajo a través de una demostración visual paso a paso y estar disponible en inglés. ¡Asegúrese de explicar cómo se utilizó PyTorch para construir su aplicación!</p> <p>2. Imágenes: Envíe al menos una imagen / captura de pantalla de su aplicación.</p> <p>3. Acceso: Proporcione un enlace a su repositorio de código de acceso público en GitHub o Bitbucket.</p> <p>Jueces<br/>El equipo de PyTorch</p> <p>Criterios de Evaluación</p> <p>1. Calidad de idea: Incluye creatividad y originalidad de la idea.</p> <p>2. Implementación de la idea: Incluye qué tan bien la idea fue ejecutada por el desarrollador.</p> <p>3. Impacto potencial: Incluye el posible impacto positivo de la aplicación, como mejorar la vida de las personas o el medio ambiente, o acelerar los resultados comerciales o de investigación.</p> <p>REGISTRATE AQUI: <a href=\"https://pytorch.devpost.com/register\" class=\"linkified\">https://pytorch.devpost.com/register</a></p> <p>¡Antes de empezar, consulta la sección de recursos (<a href=\"https://pytorch.devpost.com/details/resources\" class=\"linkified\">https://pytorch.devpost.com/details/resources</a>), y comunícate con la comunidad PyTorch en GitHub (<a href=\"https://github.com/pytorch/pytorch\" class=\"linkified\">https://github.com/pytorch/pytorch</a>) para obtener inspiración adicional!</p> <p>Para preguntas técnicas, visita el foro PyTorch: <a href=\"https://discuss.pytorch.org/c/hackathon\" class=\"linkified\">https://discuss.pytorch.org/c/hackathon</a>.</p> ","visibility":"public","member_pay_fee":false},{"created":1567451287000,"duration":702000000,"id":"264502613","name":"Global Voice & Travel Hackathon SV 2019 🗣️🤖✈️","rsvp_limit":20,"date_in_series_pattern":false,"status":"past","time":1569024000000,"local_date":"2019-09-20","local_time":"18:00","updated":1569729695000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":11,"venue":{"id":26269637,"name":"San Salvador","lat":13.692940711975098,"lon":-89.21819305419922,"repinned":false,"city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/264502613/","description":"<p>El Global Voice &amp; Travel Hackathon SV 2019 es una competencia organizada por las comunidades GDG (Google Developer Group) alrededor del mundo en el marco del Día Mundial del Turismo, que busca transformar la industria de los Viajes y Turismo a través de acciones para Google Assistant.</p> <p>En conmemoración del Día mundial del Turismo, el día 27 de Septiembre, se llevará acabo la competencia en más de 50 ciudades alrededor del Mundo; Desde New York, Bangkok, Hong Kong y Taiwan, Londres, Barcelona, San José, Sao Paulo, Amsterdam, Grecia, Tel Aviv, Nigeria, Bangalore, Delhi, San José, Costa Rica, Managua, Nicaragua entre otras.</p> <p>EL DESAFIO<br/>Transformar la industria del turismo. Ejemplos: Brinda la posibilidad a los turistas de obtener información de destinos turísticos, compra un tour o conoce cómo llegar a un destino por medio de un asistente de voz. En 24 horas (27 y 28 de Septiembre) deberás crear tu propia acción que transforme la industria del turismo usando Google Assistant.</p> <p>QUIENES PUEDEN PARTICIPAR<br/>Emprendedores(as), Programadores(as), Diseñador(a), Abogad@s, Financier@s, Estudiantes, Expertos en Mercado o simplemente un entusiastas de las tecnologías.</p> <p>LUGAR<br/>- Evento 100% en línea.</p> <p>AGENDA<br/>- Viernes 20 de Septiembre 6 PM a 9 PM: Charla y taller en línea (en vivo y en Español) sobre Google Assistant en donde podrás aprender cómo crear acciones y podrás conocer más sobre el Google Home mini. Luego cada persona o equipo tendrá la oportunidad hacer un pitch de su idea, y con las más votadas por los asistentes a este evento, se crearán los equipos para desarrollar su proyecto el día del hackathon.</p> <p>- Viernes 27 y Sábado 28 de Septiembre: Hackathon (desde 9:00 PM del Viernes hasta 9:00 PM del Sábado).</p> <p>El resultado del hackathon deberá ser un prototipo funcional que el equipo presente al jurado local. Se evaluará tu idea, la facilidad de uso, el ingenio y el beneficio general del proyecto.</p> <p>Deberás incluir un video de 2 minutos mostrando tu aplicación de voz (sin vender nada o anunciar productos o servicios de terceros). Este video será utilizado para elegir el equipo ganador del hackathon local, el proyecto de los gandadores del hackathon local será enviado a los jueces del hackathon global.</p> <p>EQUIPOS Y REQUISITOS<br/>Individual o en equipos de 3 personas máximo. El hackathon estará enfocado en obtener un prototipo funcional que conste de tres áreas:<br/>- PROPUESTA: interesante, creativa, innovadora o única.<br/>- CONVERSACIÓN: conocimiento común de la conversación \"humana\"<br/>- DESARROLLO: conocimiento de JavaScript y herramientas de Google.</p> <p>JURADO LOCAL<br/>- Los organizadores y patrocinadores locales de GDG San Salvador juzgarán el trabajo de cada equipo y escogerán al ganador local.</p> <p>JURADO GLOBAL<br/>- GDG, Google y Kiwi.com</p> <p>PREMIOS</p> <p>- Locales:<br/>- Aprenderás sobre Asistentes de Voz.<br/>- Una experiencia inolvidable.<br/>- Networking Global.<br/>- 1 Google Home mini para cada integrante del equipo ganador.</p> <p>- Global: El ganador de un hackathon local pasará a participar para ganar uno de 10 vouchers de EUR€500.00 redimibles en Kiwi.com. Los 10 ganadores a nivel Global serán juzgados por el equipo organizador Global.</p> ","visibility":"public","member_pay_fee":false},{"created":1560537751000,"duration":28800000,"id":"262321457","name":"Kotlin/Everywhere San Salvador 2019","rsvp_limit":50,"date_in_series_pattern":false,"status":"past","time":1570287600000,"local_date":"2019-10-05","local_time":"09:00","updated":1570319998000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":54,"venue":{"id":26517079,"name":"Elaniin - Tech Company","lat":13.707316398620605,"lon":-89.25146484375,"repinned":true,"address_1":"101 Avenida Norte #517","city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/262321457/","description":"<p>GDG San Salvador, la comunidad de desarrolladores de Google en San Salvador y sus partners Horchata JS, GDG La Libertad y Android Developers SV, organizan Kotlin/Everywhere San Salvador 2019 en donde aprenderás más sobre este lenguaje de programación que ha sido nombrado por Google el lenguaje predilecto para Desarrollo Android y que también te permite programar para la Web soportando Javascript, puedes crear back-ends y web services, IoT e inclusive usar Kotlin Multiplatform para desarrollar apps para iOS.</p> <p>Mira el promo de este evento en nuestro canal de YouTube: <a href=\"https://youtu.be/OXR7eWbNBts\" class=\"embedded\">https://youtu.be/OXR7eWbNBts</a>.</p> <p>Evento dirigido a programadores Android, iOS,Web ya sea de front-end o back-end de todo nivel professional, o estudiantes que deseen aprender más sobre este poderoso lenguaje de programación.</p> <p>AGENDA</p> <p>MAÑANA<br/>09:00 - 09:30 AM | Registro e Ingreso<br/>09:30 - 09:45 AM | Palabras de Bienvenida, Dinámica de Rifa<br/>09:45 - 10:15 AM | Espacio para Patrocinadores | BitLab</p> <p>CHARLAS<br/>10:15 - 11:00 AM | De Kotlin a JavaScript, but why? | Ricardo Ramírez<br/>11:00 - 12:00 M | Kotlin ARCore | José Arteaga<br/>12:00 - 01:00 PM | Kotlin En Segundo Plano | Jorge López</p> <p>01:00 - 01: 45 PM | Lunch Break</p> <p>TARDE<br/>02:00 - 02:45 PM | Paginando con Kotlin | Amilcar Serrano<br/>TALLERES<br/>03:00 - 03: 45 PM | Android y Firebase como Estrategia para Startups | David García<br/>03:45 - 04: 30 PM | Kotlin En Todas Partes | Oscar Salguero<br/>04:30 - 04: 45 PM | Espacio para Patrocinadores | Elaniin<br/>04:45 - 05:00 PM | Cierre y Rifa</p> <p>Lugar: Elaniin, Tech Company<br/>Fecha: Sábado 5 de Octubre de 2019<br/>Hora: De 9:00 AM a 5:00 PM</p> <p>Para más detalles sobre este evento visita: <a href=\"https://kotlin.gdgsansalvador.dev\" class=\"linkified\">https://kotlin.gdgsansalvador.dev</a>.</p> <p>Te invitamos a suscribirte a nuestro canal de YouTube: <a href=\"http://bit.ly/gdgsansal-youtube\" class=\"linkified\">http://bit.ly/gdgsansal-youtube</a> y a habilitar las notificaciones para enterarte cuando se publiquen los videos de las charlas y talleres de este evento y en donde podrás ver más contenidos de nuestra comunidad.</p> <p>IMPORANTE<br/>- Evento gratuito.<br/>- Nos reservamos el derecho de admisión.<br/>- Solamente las personas en la lista de asistentes confirmados en la lista de los que asistirán en el evento en Meetup podrán ingresar a las instalaciones del evento, mostrar interés en el evento en Facebook no reserva cupos. No se harán excepciones.</p> ","how_to_find_us":"Elaniin Tech Company está ubicada en 101 Av Nte, #517, Col. Escalón, San Salvador. (Parte del distrito Lomas Verdes Tech)\nPunto de referencia: Detrás de Casa Presidencial.","visibility":"public","member_pay_fee":false},{"created":1571070261000,"duration":10800000,"id":"265662037","name":"Chrome Dev Summit Extended","rsvp_limit":100,"date_in_series_pattern":false,"status":"past","time":1573603200000,"local_date":"2019-11-12","local_time":"18:00","updated":1573626543000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":95,"venue":{"id":26265307,"name":"Applaudo Studios","lat":13.694275856018066,"lon":-89.2306900024414,"repinned":true,"city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/265662037/","description":"<p>GDG San Salvador, el Grupo de Desarrolladores Google de San Salvador, te invita a un evento especial dedicado a Web Developers, pero también está invitada toda la comunidad tecnológica de El Salvador, en este evento se hará especial énfasis en tecnologías Web de Google y se celebrará en el contexto del Chrome Dev Summit 2019 que Google realiza en San Francisco, CA. Este evento es el primero de su naturaleza en El Salvador y es un evento Extended oficialmente registrado en <a href=\"https://developer.chrome.com/devsummit/remote/#extended\" class=\"linkified\">https://developer.chrome.com/devsummit/remote/#extended</a> y coordinado de la mano con el Chrome Team de Google.</p> <p>Ven y miremos juntos lo que esta sucediendo en el evento Chrome Dev Summit 2019 (<a href=\"https://developer.chrome.com/devsummit/\" class=\"linkified\">https://developer.chrome.com/devsummit/</a>). Aprende sobre la últimas técnicas en desarrollo para la Web, lo último en Progressive Web Apps, Web Assembly, herramientas como Chrome Dev Tools y más.</p> <p>Tendremos charlas sobre tecnologías y herramientas Web impartidas por experimentados Speakers. ¡También se podrán enterar de oportunidades de empleo y entrenamiento en Applaudo Studios, habrá pizza break, swag de Google Chrome y otras sorpresas!</p> <p>AGENDA</p> <p>5:45 PM - Registro de asistentes y distribución de \"swag\"<br/>6:15 PM - Apertura y palabras de nuestros patrocinadores.<br/>6:30 PM - Highlights del Chrome Dev Summit 2019 sucediendo el 11 y 12 de Noviembre en San Francisco, CA.<br/>7:00 PM - Charla: \"Progressive Web Apps: ¿Qué son y cómo funcionan?\" por Julio Mixco, Frontend Developer, Applaudo Studios<br/>7:45 PM - Dinner Break &amp; Networking<br/>8:00 PM - Charla: \"DevTools: Tus mejores amigos\" por Jonathan Lopez, Frontend Developer, Applaudo Studios<br/>8:45 PM - Palabras de nuestros patrocinadores, rifa y cierre.</p> <p>IMPORANTE</p> <p>- Evento GRATUITO (solamente regístrate aquí en Meetup).<br/>- Nos reservamos el derecho de admisión.<br/>- No se admitirán personas menores de 15 años de edad.<br/>- Solamente las personas en la lista de asistentes confirmados en la lista de los que asistirán en el evento en Meetup podrán ingresar a las instalaciones del evento, mostrar interés en el evento en Facebook no reserva cupos. No se harán excepciones.</p> ","how_to_find_us":"Applaudo Studios esta en el Centro Comercial Plaza San Benito, locales 1-3.","visibility":"public","member_pay_fee":false}],"upcoming":[{"created":1560561599000,"duration":36000000,"id":"262332298","name":"DevFest San Salvador 2019","rsvp_limit":200,"date_in_series_pattern":false,"status":"upcoming","time":1574517600000,"local_date":"2019-11-23","local_time":"08:00","rsvp_open_offset":"PT672H","updated":1574266028000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":198,"venue":{"id":26640822,"name":"Salvadoran Industry Association","lat":13.695328712463379,"lon":-89.2259292602539,"repinned":true,"city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/262332298/","description":"<p>GDG San Salvador, la comunidad de desarrolladores de Google en San Salvador y WTM San Salvador organizan el DevFest San Salvador 2019.</p> <p>Los DevFest son una verdadera celebración de la comunidad tecnológica y queremos que todas la comunidades activas de Desarrolladores de El Salvador participen. Durante el evento, tendremos charlas por expertos en desarrollo de software locales e Internacionales, talleres para aprender a usar diversas tecnologías.</p> <p>Video sobre qué son los DevFest: <a href=\"https://youtu.be/hTJ_-MxHKMY\" class=\"embedded\">https://youtu.be/hTJ_-MxHKMY</a></p> <p>Comunidades Participantes</p> <p>- HorchataJS<br/>- NodeSchools San Miguel<br/>- Android Developers SV (Android Quesadilla)<br/>- GDG La Libertad y WTM La Libertad</p> <p>Este evento está dirigido a personas de 16 años en adelante, entusiastas, estudiantes y profesionales en tecnología, miembros de comunidades de desarrolladores y publico en general que deseen aprender más sobre las tecnologías que están transformando digitalmente al mundo.</p> <p>AGENDA</p> <p>8:00 AM - Ingreso y registro de asistentes, ¡y repartición de swag!<br/>9:00 AM - Bienvenida y palabras de apertura de los líderes de las comunidades de desarrolladores y de nuestros patrocinadores.<br/>9:30 AM - Charlas y talleres de la mañana (Auditorio, Salón de Charlas, Salón de Talleres y WomenTechmakers Central)<br/>12:00 M - Lunch &amp; Networking<br/>1:00 PM - Charlas y talleres de la tarde (Auditorio, Salón de Charlas, Salón de Talleres y WomenTechmakers Central)<br/>5:15 PM - Palabras de nuestros patrocinadores, rifa y palabras de cierre por de los líderes de las comunidades de desarrolladores.</p> <p>Para información en detalle sobre las charlas, por favor ver agenda en imágenes o album de fotos del evento.</p> <p>TALLERES</p> <p>SALÓN DE TALLERES<br/>Mañana<br/>09:30 AM \"Cómo construir una app grande con Flutter\" (60 min) por Carlos Morán<br/>10:30 AM “End-to-end Testing con Cypress” (60 min) por Jaime Suncín<br/>Tarde<br/>01:00 PM “Eclipse MicroProfile para Microservicios” (60 min) por Julián Rivera-Pineda<br/>02:15 PM “Conociendo Big Data” (60 min) por Ángel Quintanilla<br/>03:30 PM “Generando arte con p5.js” (60 min) por Ricardo Ramírez</p> <p>WOMENTECHMAKERS CENTRAL<br/>Mañana<br/>09:30 AM \"I am Remarkable Workshop\". (90 min) Taller especial para mujeres en tecnología por Aidé Cabrera de México<br/>11:15 AM \"Data Visualization con Google Data Studio\" (60 min) por Carol Monroe<br/>Tarde<br/>01:00 PM “Google Design Sprint” (2 hrs) por Esmeralda Álvarez de Costa Rica</p> <p>La inscripción a los talleres es en Eventbrite (<a href=\"http://bit.ly/gdgsansal-devfest-workshops\" class=\"linkified\">http://bit.ly/gdgsansal-devfest-workshops</a>). Los asistentes confirmados en Meetup recibieron la clave para los talleres via mensaje directo en Meetup.</p> <p>NOTAS IMPORTANTES</p> <p>- Talleres: El cupo para los talleres es limitado a 25 participantes y suceden al mismo tiempo que las charlas, por lo que sí estás inscrito en un taller, no podrás asistir a charlas u otro taller que suceda en paralelo a la misma hora. Se darán a conocer enlaces a tickets en Eventbrite y una clave para que los asistentes confirmados al evento puedan inscribirse a los talleres.</p> <p>- Charlas: Las charlas serán impartidas en el Auditorio y en el Salón de Charlas. Todas las charlas serán grabadas para que podamos verlas en YouTube después del evento. No necesitarás inscribirte en nada adicional para presenciar a las charlas.</p> <p>- Menores de Edad: Debido a políticas de seguridad de nuestros patrocinadores de sede para el evento y ya que no contamos con recursos para un servicios de guardería, no se admitirá traer niños(as) pequeños. Todo(a) jovencito(a) menor de edad que asista al evento deberá traer consigo su carnet de minoridad y/o carnet de estudiante válido de su institución educativa.</p> <p>- Estacionamiento: Estacionarse dentro del lugar o en los alrededores, el estacionamiento dentro del lugar es limitado (40-50 vehículos). El estacionamiento dentro y fuera del lugar corre por cuenta del propietario del vehículo. Ni ASI ni los patrocinadores, comunidades participantes u organizadores del evento nos hacemos responsables por daños a su vehículo o por objetos perdidos.</p> <p>- Costo: Evento GRATUITO.</p> ","how_to_find_us":"El evento se llevará a cabo en el primer nivel del edificio de la Asociación Salvadoreña de Industriales (ASI) en Calle Roma y Liverpool, Colonia Roma; San Salvador, El Salvador.","visibility":"public","member_pay_fee":false},{"created":1570587223000,"duration":9000000,"id":"265519553","name":"Café con WomenTechmakers San Salvador","rsvp_limit":40,"date_in_series_pattern":false,"status":"upcoming","time":1574897400000,"local_date":"2019-11-27","local_time":"17:30","rsvp_open_offset":"PT513H","updated":1574029653000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":35,"venue":{"id":26673651,"name":"POINT El Salvador","lat":13.687302589416504,"lon":-89.22566986083984,"repinned":true,"address_1":"Calle Los Castanos","city":"San Salvador","country":"sv","localized_country_name":"El Salvador"},"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/265519553/","description":"<p>Ven al primer evento de WomenTechmakers San Salvador sólo para mujeres en tecnología organizado con el apoyo de GDG Pura Vida y WomenTechmakers Costa Rica y tómate un café, platica, aprende, inspírate y conversa libremente con mujeres Centroamericanas de gran trayectoria en este rubro.</p> <p>Este es un evento especial para mujeres en tecnología vinculado a nuestro primer DevFest en la historia de El Salvador a celebrarse el sábado 23 de Noviembre de 2019. El registro a estos dos eventos es por separado.</p> <p>INVITADA INTERNACIONAL</p> <p>Karol Rojas, Ingeniera de Software, WomenTechmaker Ambassador, Costa Rica.</p> <p>AGENDA</p> <p>5:30 PM - Recibimiento de asistentes<br/>6:00 PM - Bienvenida GDG San Salvador<br/>6:15 PM - Charla: \"WomenTechmakers Ambassadors y sus Retos\" por Karol Rojas<br/>6:30 PM - Café &amp; Networking<br/>6:45 PM - \"Integrando Google Assistant en tus Apps\" por Arely Viana<br/>7:15 PM - \"Prototipando Rápido y Furioso con Angular y Firebase\" por Paola Mancía<br/>7:45 PM - \"Conoce a Flutter, una de las Sailor Scout de Google\" por Liliana Girón</p> <p>UBICACIÓN</p> <p>Dirección: Avenida Las Camelias y calle Los Castaños #17, San Salvador.<br/>Punto de referencia: Sobre la calle principal de la colonia San Francisco, en las cercanías del distrito 4 de la Alcaldía de San Salvador.</p> <p>IMPORTANTE</p> <p>- Evento gratuito.<br/>- Nos reservamos el derecho de admisión.<br/>- No se admitirán personas menores de 15 años de edad.<br/>- Solamente las personas en la lista de asistentes confirmados, la lista de los que asistirán en Meetup podrán ingresar a las instalaciones del evento, mostrar interés en el evento en Facebook no reserva tu cupo. No se harán excepciones.</p> ","how_to_find_us":"Point/ImpactHub esta en: Avenida Las Camelias y calle Los Castaños #17, San Salvador.\nPunto de referencia: Sobre la calle principal de la colonia San Francisco, en las cercanías del distrito 4 de la Alcaldía de San Salvador.","visibility":"public","member_pay_fee":false},{"created":1573686833000,"duration":28800000,"id":"266447365","name":"Flutter Interact Viewing Party","rsvp_limit":50,"date_in_series_pattern":false,"status":"upcoming","time":1576335600000,"local_date":"2019-12-14","local_time":"09:00","rsvp_open_offset":"PT336H","rsvp_close_offset":"PT144H","updated":1573758176000,"utc_offset":-21600000,"waitlist_count":0,"yes_rsvp_count":1,"group":{"created":1537983199000,"name":"GDG San Salvador","id":29966564,"join_mode":"open","lat":13.6899995803833,"lon":-89.19000244140625,"urlname":"GDG-SanSalvador","who":"Miembros","localized_location":"San Salvador, El Salvador","state":"","country":"sv","region":"en_US","timezone":"America/El_Salvador"},"link":"https://www.meetup.com/GDG-SanSalvador/events/266447365/","description":"<p>Reunámonos para ver el livestream y aprender sobre lo último de Dart y Flutter anunciado en el evento Flutter Interact 2019 y ver las sesiones mientras compartimos algunos bocadillos.</p> <p>Este evento es parte de de una serie de Viewing Parties sucediendo alrededor del mundo en el contexto del evento Flutter Interact (<a href=\"https://developers.google.com/events/flutter-interact\" class=\"linkified\">https://developers.google.com/events/flutter-interact</a>). Más información sobre los Viewing Parties esta disponible en: <a href=\"https://developers.google.com/events/flutter-interact/viewing-parties\" class=\"linkified\">https://developers.google.com/events/flutter-interact/viewing-parties</a>.</p> <p>Lugar: A definirse.</p> <p>Pronto se darán a conocer más detalles sobre este evento tentativo.</p> ","visibility":"public","member_pay_fee":false}],"organizers":[{"id":12768945,"name":"Oscar S.","bio":"Turning caffeine into code.","status":"active","joined":1282052440000,"city":"San Salvador","country":"sv","localized_country_name":"El Salvador","lat":13.69,"lon":-89.19,"photo":{"id":291431851,"highres_link":"https://secure.meetupstatic.com/photos/member/2/e/4/b/highres_291431851.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/2/e/4/b/member_291431851.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/2/e/4/b/thumb_291431851.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1574449850000,"created":1537983200000,"updated":1565906354000,"role":"organizer","group":{"id":29966564,"urlname":"GDG-SanSalvador","name":"GDG San Salvador","status":"active","who":"Miembros","members":657,"join_mode":"open","localized_location":"San Salvador, El Salvador"},"answers":[{"question_id":8910072,"question":"¿Por qué deseas ser miembro del GDG San Salvador?"},{"question_id":8910073,"question":"Profesión o Carrera Universitaria"}],"link":"https://www.meetup.com/GDG-SanSalvador/members/12768945/"},"is_pro_admin":false}]}
