{"events":[{"created":1549717339000,"duration":12600000,"fee":{"accepts":"cash","amount":5,"currency":"EUR","description":"","label":"Price","required":false},"id":"258813933","name":"Workshop: All we must know about Android","rsvp_limit":30,"date_in_series_pattern":false,"status":"past","time":1552123800000,"local_date":"2019-03-09","local_time":"09:30","updated":1557172137000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":3,"venue":{"id":26158817,"name":"Jesuit College of Funchal","lat":32.65007781982422,"lon":-16.90921974182129,"repinned":true,"address_1":"R. dos Ferreiros Estrada","city":"Funchal","country":"pt","localized_country_name":"Portugal"},"group":{"created":1548015482000,"name":"GDG Madeira","id":30971433,"join_mode":"open","lat":32.650001525878906,"lon":-16.899999618530273,"urlname":"gdgmadeira","who":"Membros","localized_location":"Funchal, Portugal","state":"","country":"pt","region":"en_US","timezone":"Atlantic/Madeira"},"link":"https://www.meetup.com/gdgmadeira/events/258813933/","manual_attendance_count":33,"description":"<p>Nowadays, who doesn’t know what is Android OS? Do you know how to develop an Android application? Do you know where to start? You don’t have deep programming skills, but you still want to? Are you an expert and you would love also to learn, improve or even share some skills?</p> <p>In this tech talk, you will learn the basics of Android programming with Tiago Ornelas. Because he has a vast experience in developing Android applications, he will help you to overcome your first difficulties, so you can conquer anything with your future application(s)!</p> <p>The price of the workshop has a symbolic price of € 5.00, which includes a coffee break and a certificate - go to <a href=\"https://gdgmadeira.xyz\" class=\"linkified\">https://gdgmadeira.xyz</a> for more payment details. Just bring a computer and we will take care of the rest for you 👌!</p> <p>Places are limited, book your ticket now!</p> ","how_to_find_us":"We will be present at the Jesuits' College of Funchal starting at 9:30 am, to begin the process of accreditation.","visibility":"public","member_pay_fee":false},{"created":1557088255000,"duration":16200000,"fee":{"accepts":"cash","amount":5,"currency":"EUR","description":"","label":"Price","required":false},"id":"261212161","name":"Workshop: Let's dive into Flutter","rsvp_limit":33,"date_in_series_pattern":false,"status":"past","time":1559377800000,"local_date":"2019-06-01","local_time":"09:30","updated":1559395454000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":23,"venue":{"id":26158817,"name":"Jesuit College of Funchal","lat":32.65005874633789,"lon":-16.90921974182129,"repinned":true,"address_1":"R. dos Ferreiros Estrada","city":"Funchal","country":"pt","localized_country_name":"Portugal"},"group":{"created":1548015482000,"name":"GDG Madeira","id":30971433,"join_mode":"open","lat":32.650001525878906,"lon":-16.899999618530273,"urlname":"gdgmadeira","who":"Membros","localized_location":"Funchal, Portugal","state":"","country":"pt","region":"en_US","timezone":"Atlantic/Madeira"},"link":"https://www.meetup.com/gdgmadeira/events/261212161/","manual_attendance_count":31,"description":"<p>Flutter is a free and open-source software development kit created by Google, that enables you to develop applications for both Android and iOS using a single codebase. With Flutter, you can design beautiful and modern UIs, and develop fast and high-performance native apps for your company, startup, … helping designers, prototypers and developers.</p> <p>For your reference, here are some Flutter videos that let you have a deep dive into this framework: <a href=\"https://www.youtube.com/flutterdev\" class=\"embedded\">https://www.youtube.com/flutterdev</a> .</p> <p>In this tech talk, you will learn the basics of the Flutter SDK programming with Filipe Barroso, a software developer that has been advocating the new Flutter SDK by Google, around Portugal, by organizing Flutter Talks and workshops.</p> <p>The price of each ticket is 5,00 €, and it can be bought on ti.to, using the following link: <a href=\"https://ti.to/gdg-madeira/let-s-dive-into-flutter\" class=\"linkified\">https://ti.to/gdg-madeira/let-s-dive-into-flutter</a> . There is only one type of ticket, and It includes full access to the tech talk and its contents, a certificate of participation and a coffee-break, where the ideas can be shared and discussed.</p> <p>Registration at the event is only validated after ticket purchase at ti.to and confirmation at this Meetup event.</p> <p>ADDITIONAL INFORMATION</p> <p>ABOUT THE EVENT<br/>The event will take place on 1st of July 2019, at 09:30 am, in the Jesuits' College of Funchal, one of the most remarkable historic buildings of the island, with more than 400 years of existence.</p> <p>This workshop is intended for people who have already some experience with programming in mobile and new to Flutter development.</p> <p>The workshop will be tended in English. Despite this, there, you will be invited to ask questions (don’t be afraid of), to suggest, to try, to fail, to play… in Portuguese (if you can’t speak English) or in English.</p> <p>In the following days, after the end of the workshop, we will send to your email your certificate of participation in the workshop, so you can share with your friends what have you just conquered!</p> <p>WHAT DO I NEED TO BRING WITH ME?<br/>Just bring a computer with the peripherals that you use on a normal day. Further information about the software that you need to have pre-installed on your computer, for the workshop, will be sent to your email a few days before it. Thus, in the day, we can jump right into the framework.</p> <p>We will provide you with a free wireless connection and access to all the files used during the talk so that you can review and try it at home.</p> <p>PROGRAM<br/>09:30 – Conference registration;<br/>10:00 – Workshop: Let's dive into Flutter (part I);<br/>11:00 – Coffee-break;<br/>11:30 – Workshop: Let's dive into Flutter (part II);<br/>14:00 – Wrap up.</p> <p>The workshop will start strictly at 10:00, but the rest of the program is just something that we got it down and may be changed on the day, according to the attendees.</p> <p>For the conference registration, you don't need to print your ticket. Just show us the e-ticket that you received when you bought the ticket on ti.to.</p> <p>SPEAKER<br/>Filipe Barroso is not your usual software developer, he loves getting out of the zone of comfort and if you don't see him at a tech event, he is probably organizing the next tech event for Google Developer Group Lisbon, that he is an organizer for the last last 3 years, where he organized more than 60 events, 4 of them being full-day conferences. He is always reading about psychology or supporting a local community to grow. He has a strong opinion about social impact, inclusivity and the importance of communities. Lately, he has been advocating the new Flutter SDK by Google, around Portugal, by organizing Flutter Talks and workshops.</p> <p>As a developer, he has worked in android applications for companies such as Altice, Brisa, Federação Portuguesa Futebol, TAP, Bayer among many others and currently is working remotely as an Android Developer and Machine Learning Engineer.</p> ","how_to_find_us":"We will be present at the Jesuits' College of Funchal starting at 9:30 am, to begin the process of accreditation. The entrance will be made by Rua dos Ferreiros.","visibility":"public","member_pay_fee":false},{"created":1565030894000,"duration":16200000,"fee":{"accepts":"cash","amount":5,"currency":"EUR","description":"","label":"Price","required":false},"id":"263755104","name":"Workshop: A Brief Introduction to Machine Learning","rsvp_limit":3,"date_in_series_pattern":false,"status":"past","time":1567845000000,"local_date":"2019-09-07","local_time":"09:30","updated":1567862729000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":16,"venue":{"id":26158817,"name":"Jesuit College of Funchal","lat":32.65005874633789,"lon":-16.90921974182129,"repinned":true,"address_1":"R. dos Ferreiros Estrada","city":"Funchal","country":"pt","localized_country_name":"Portugal"},"group":{"created":1548015482000,"name":"GDG Madeira","id":30971433,"join_mode":"open","lat":32.650001525878906,"lon":-16.899999618530273,"urlname":"gdgmadeira","who":"Membros","localized_location":"Funchal, Portugal","state":"","country":"pt","region":"en_US","timezone":"Atlantic/Madeira"},"link":"https://www.meetup.com/gdgmadeira/events/263755104/","description":"<p>With machine learning, we could change the world. But… let’s take it slow. First, let’s talk about machine learning: is the scientific study of algorithms that computer systems use in order to perform a task without explicit instructions, relying on patterns and inference instead. There’s a lot of tools that allow us to create systems based on “training data”, but on this workshop, only the scikit-learn will be the used tool.</p> <p>Scikit-learn features various classification, regression and clustering algorithms, and this is just the tip of the iceberg. It is designed to interoperate with the Python numerical and scientific libraries NumPy and SciPy. Besides the fact that was created 12 years ago, it’s is a tool that is described as “well maintained and popular”.</p> <p>A lot of worldwide companies use scikit-learn to improve their services, through standard algorithms for prediction tasks, such as Spotify, Evernote and Booking.com, to improve their service quality and user satisfaction.</p> <p>If you are curious about this tool, you can check more information and documentation through this URL: <a href=\"https://scikit-learn.org/\" class=\"linkified\">https://scikit-learn.org/</a>. In this way, you will improve your skills in order to change our world!</p> <p>ADDITIONAL INFORMATION</p> <p>ABOUT THE EVENT</p> <p>The event will take place on 7th of September 2019, at 09:30 am, in the Jesuits' College of Funchal (<a href=\"https://goo.gl/maps/S1PGEamLtm42\" class=\"linkified\">https://goo.gl/maps/S1PGEamLtm42</a>), one of the most remarkable historic buildings of the island, with more than 400 years of existence.</p> <p>This workshop is intended for people who don’t have any experience with Machine Learning (ML) but is very curious to give the first steps at ML development.</p> <p>The workshop will be tended in English. Despite this, there, you will be invited to ask questions (don’t be afraid of), to suggest, to try, to fail, to play… in Portuguese (if you can’t speak English) or in English.</p> <p>In the following days, after the end of the workshop, we will send to your email your certificate of participation in the workshop, so you can share with your friends what have you just conquered!</p> <p>WHAT DO I NEED TO BRING WITH ME?</p> <p>Just bring a computer with the peripherals that you use on an average day. Further information about the software that you need to have pre-installed on your computer, for the workshop, will be sent to your email a few days before it. Thus, in the day, we can jump right into this machine learning library.</p> <p>We will provide you with a free wireless connection and access to all the files used during the talk so that you can review and try it at home.</p> <p>PROGRAM</p> <p>09:30 – Conference registration;<br/>10:00 – Workshop: A brief introduction to Machine Learning (part I);<br/>11:00 – Coffee-break;<br/>11:30 – Workshop: A brief introduction to Machine Learning (part II);<br/>14:00 – Wrap up.</p> <p>The workshop will start strictly at 10:00, but the rest of the program is just something that we got it down and may be changed on the day, according to the attendees.</p> <p>For the conference registration, you don't need to print your ticket. Just show us the e-ticket that you received when you bought the ticket on ti.to.</p> <p>TICKETS</p> <p>The price of each ticket is 5,00 €, and it can be bought on ti.to, using the following link <a href=\"https://ti.to/gdg-madeira/a-brief-introduction-to-machine-learning/\" class=\"linkified\">https://ti.to/gdg-madeira/a-brief-introduction-to-machine-learning/</a>. More information at ti.to page event!</p> <p>SPEAKER</p> <p>Eduardo Gomes has a Masters degree in Computer Engineering from the University of Madeira, where he worked with audio manipulation for triggering emotional states in games by utilizing Machine Learning algorithms. He also worked as a consultant, assisting the development of interactive cross-platform music sheet renderer and player.</p> <p>Eduardo currently works at M-ITI, focusing his work on non-intrusive load monitoring using Machine Learning techniques. He has a broad language knowledge in C# and Python as well as hands-on experience in Unity3D and the TensorFlow framework.</p> ","how_to_find_us":"We will be present at the Jesuits' College of Funchal starting at 9:30 am, to begin the process of accreditation. The entrance will be made by Rua dos Ferreiros.","visibility":"public","member_pay_fee":false},{"created":1574103703000,"duration":16200000,"fee":{"accepts":"cash","amount":1,"currency":"EUR","description":"","label":"Price","required":false},"id":"266562447","name":"Cloud Study Jam: Kubernetes in the Google Cloud","rsvp_limit":3,"date_in_series_pattern":false,"status":"past","time":1576315800000,"local_date":"2019-12-14","local_time":"09:30","updated":1576334437000,"utc_offset":0,"waitlist_count":0,"yes_rsvp_count":13,"venue":{"id":26158817,"name":"Jesuit College of Funchal","lat":32.65005874633789,"lon":-16.90921974182129,"repinned":true,"address_1":"R. dos Ferreiros Estrada","city":"Funchal","country":"pt","localized_country_name":"Portugal"},"group":{"created":1548015482000,"name":"GDG Madeira","id":30971433,"join_mode":"open","lat":32.650001525878906,"lon":-16.899999618530273,"urlname":"gdgmadeira","who":"Membros","localized_location":"Funchal, Portugal","state":"","country":"pt","region":"en_US","timezone":"Atlantic/Madeira"},"link":"https://www.meetup.com/gdgmadeira/events/266562447/","description":"<p>📍Tickets can be bought at <a href=\"https://ti.to/gdg-madeira/cloud-Study-Jam-Kubernetes-in-the-Google-cloud\" class=\"linkified\">https://ti.to/gdg-madeira/cloud-Study-Jam-Kubernetes-in-the-Google-cloud</a></p> <p>In this lab, we will learn the basics of Docker and Kubernetes and how they can be used together for developing, shipping, and running applications faster.</p> <p>To do that, we will use Google Cloud Platform — a suite of cloud computing services provided by Google.</p> <p>If you are a developer, this is the part of operations that you need to know to become a DevOps.</p> <p>WHAT IS DOCKER?</p> <p>Docker is an open-source platform that enables you to build, share, and run distributed applications through containers.</p> <p>Let's think about virtual machines: each one of them is isolated from the other ones, and are unique to each application. As you can imagine, this adds an overload of processing to the server, beyond what your app really needs.</p> <p>That's why they come up with containers. With containers, you can deploy and run distributed applications without launching an entire virtual machine for each application.</p> <p>Each container image has all the runtime components (such as files, environment variables, and libraries) necessary to run any application, isolated from others ones. Besides that, they are lightweight processes that have some additional features that enable them to create an abstraction layer over the network infrastructure and over the operating system.</p> <p>Application containerization is also associated with microservices. This development architecture is used when an extensive monolithic application is split into modules that are specific for each task.</p> <p>But, how to manage containers, deployments, scaling, and failover of your application? That's why Kubernetes is used for!</p> <p>WHAT IS KUBERNETES?</p> <p>Kubernetes is an open-source platform that makes easy the tasks of managing containerized workloads and services, and deployment patterns (like the Blue-Green deployment).</p> <p>You can create new containers for your deployment, remove existing containers, and configure the limitations of their resources (CPU limitations, etc.).</p> <p>For example, if traffic to a container is high, Kubernetes can load balance and distribute the network traffic, keeping the deployment stable. Once configured by the developer, the system automatically handles it.</p> <p>Kubernetes can restart containers that fail, replaces containers, kills containers that don't respond, and much more!</p> <p>TELL ME MORE ABOUT THE EVENT:</p> <p>The event will take place on the 14th of December 2019 at 09:30 am in the Jesuits' College of Funchal (<a href=\"https://goo.gl/maps/S1PGEamLtm42\" class=\"linkified\">https://goo.gl/maps/S1PGEamLtm42</a>), one of the most remarkable historic buildings of the island, with more than 400 years of existence.</p> <p>The lab contents will be in English. Despite this, there, you will be invited to ask questions (don't be afraid of), to suggest, to try, to fail, to play… in Portuguese (if you can't speak English) or in English.</p> <p>Agenda:<br/>- 09:30 – Conference registration;<br/>- 10:00 – Introduction to Docker;<br/>- 10:30 – Hello, Node Kubernetes;<br/>- 11:00 – Managing Deployments Using Kubernetes Engine;<br/>- 12:30 – Build a Slack Bot<br/>- 14:00 – Wrap up.</p> <p>The lab will start strictly at 09:30 with the conference registration. Still, the rest of the program is just something that we got it down and maybe changed on the day, according to the attendees.</p> <p>Throughout the lab, you will have access to free snacks and coffee!</p> <p>WHAT IS A CLOUD STUDY JAM?</p> <p>A Study Jam is a cooperative learning program combining practical developer experience with Google Cloud expertise.</p> <p>So, we will not have a speaker to talk about Kubernetes in the Google Cloud.</p> <p>FOR WHO IS THIS LAB?<br/>This is an introductory lab. Little to no prior experience with Docker, containers, or Kubernetes is assumed. Familiarity with the Linux command line is suggested, but not required. You should know the basic of algorithms and programming.</p> <p>WHAT DO I NEED TO BRING WITH ME?<br/>Just bring a computer with the peripherals that you use on an average day. Don't forget your charger!</p> <p>For the best experience, make sure your laptop has Firefox or Chrome installed.</p> ","how_to_find_us":"We will be present at the Jesuits' College of Funchal starting at 9:30 am, to begin the process of accreditation. The entrance will be made by Rua dos Ferreiros.","visibility":"public","member_pay_fee":false}],"upcoming":[{"created":1580417087000,"duration":14400000,"fee":{"accepts":"cash","amount":5,"currency":"EUR","description":"","label":"Price","required":false},"id":"268327871","name":"Let’s dive again into Flutter!","rsvp_limit":4,"date_in_series_pattern":false,"status":"upcoming","time":1583575200000,"local_date":"2020-03-07","local_time":"10:00","updated":1580558320000,"utc_offset":0,"waitlist_count":3,"yes_rsvp_count":14,"venue":{"id":26158817,"name":"Jesuit College of Funchal","lat":32.65005874633789,"lon":-16.90921974182129,"repinned":true,"address_1":"R. dos Ferreiros Estrada","city":"Funchal","country":"pt","localized_country_name":"Portugal"},"group":{"created":1548015482000,"name":"GDG Madeira","id":30971433,"join_mode":"open","lat":32.650001525878906,"lon":-16.899999618530273,"urlname":"gdgmadeira","who":"Membros","localized_location":"Funchal, Portugal","state":"","country":"pt","region":"en_US","timezone":"Atlantic/Madeira"},"link":"https://www.meetup.com/gdgmadeira/events/268327871/","description":"<p>📍Tickets can be bought at <a href=\"https://ti.to/gdg-madeira/let-s-dive-again-into-flutter\" class=\"linkified\">https://ti.to/gdg-madeira/let-s-dive-again-into-flutter</a></p> <p>In this workshop, we will learn the basics of Fluter, an open-source software development kit created by Google, that will help you develop applications for both Android and iOS.</p> <p>If you have some basics about mobile development, and you want to improve your mobile development skills, this workshop is all that you need.</p> <p>⏺ WHAT'S FLUTTER?</p> <p>Flutter is a free and open-source software development kit created by Google, that enables you to develop applications for both Android and iOS using a single codebase. Because it was released in 2017, it has now a wide online community of developers and contributors.</p> <p>With Flutter, you can design beautiful and modern UIs, and develop fast and high-performance native apps for your company, startup, … helping designers, prototypers and developers. Dart is the object-oriented programming language that is used to code Flutter apps and to access platform APIs and services.</p> <p>Besides this, Flutter has a comprehensive widget catalogue available to use in any app. Widgets are components that can be integrated with your apps, that enables you to bring smooth animations to them, gestures, scrolling, icons, styling and so forth...</p> <p>Flutter integrates with most popular integrated development environments, like Android Studio, IntelliJ IDEA or Xcode, and it was thought to be accessible for both new and experienced developers in mobile development.</p> <p>For your reference, here are some Flutter videos that let you have a deep dive into this framework: <a href=\"https://www.youtube.com/flutterdev\" class=\"embedded\">https://www.youtube.com/flutterdev</a>.</p> <p>⏺ TELL ME MORE ABOUT THE EVENT:</p> <p>The event will take place on 7th of March 2020, at 09:30 am, in the Jesuits' College of Funchal, one of the most remarkable historic buildings of the island, with more than 400 years of existence.</p> <p>The workshop will be tended in English. Despite this, there, you will be invited to ask questions (don’t be afraid of), to suggest, to try, to fail, to play… in Portuguese (if you can’t speak English) or in English, in writing or verbally.</p> <p>In the following days, after the end of the workshop, we will send to your email your certificate of participation in the workshop, so you can share with your friends what have you just conquered!</p> <p>⏺ FOR WHO IS THIS LAB FOR?</p> <p>This workshop is intended for people who have already some experience with programming in mobile and new to Flutter development.</p> <p>⏺ WHAT DO I NEED TO BRING WITH ME?</p> <p>Just bring a computer with the peripherals that you use on a normal day. Further information about the software that you need to have pre-installed on your computer, for the workshop, will be sent to your email a few days before it. Thus, in the day, we can jump right into the framework.</p> <p>We will provide you with a free wireless connection and access to all the files used during the talk so that you can review and try it at home.</p> <p>⏺ ARE THE CONTENTS OF THIS WORKSHOP THE SAME OF THE PREVIOUS ONE?</p> <p>Yes, it is. If you attended our last Flutter’s workshop, you should consider that the contents may get repeated.</p> <p>Please, take that into consideration before buying your ticket. However, if you want to consolidate your knowledge, remember something that you forgot about Flutter, as well as having the opportunity to ask other things about it, you are more than welcome to join us!</p> <p>⏺ AGENDA</p> <p>09:30 – Conference registration;<br/>10:00 – Workshop: Let's dive again into Flutter! (part I);<br/>11:00 – Coffee-break;<br/>11:30 – Workshop: Let's dive again into Flutter! (part II);<br/>14:00 – Wrap up.</p> <p>The workshop will start strictly at 10:00, but the rest of the program is just something that we got it down and maybe changed on the day, according to the attendees.</p> <p>For the conference registration, you don't need to print your ticket. Just show us the e-ticket that you received when you bought the ticket on ti.to.</p> ","how_to_find_us":"We will be present at the Jesuits' College of Funchal starting at 9:30 am, to begin the process of accreditation. The entrance will be made by Rua dos Ferreiros.","visibility":"public","member_pay_fee":false}],"organizers":[{"id":268075449,"name":"Carlos Silva A.","status":"active","joined":1542583451000,"city":"Funchal","country":"pt","localized_country_name":"Portugal","lat":32.65,"lon":-16.9,"photo":{"id":282525245,"highres_link":"https://secure.meetupstatic.com/photos/member/b/0/b/d/highres_282525245.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/b/0/b/d/member_282525245.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/b/0/b/d/thumb_282525245.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1582133625000,"created":1548015483000,"updated":1548333118000,"role":"organizer","group":{"id":30971433,"urlname":"gdgmadeira","name":"GDG Madeira","status":"active","who":"Membros","members":91,"join_mode":"open","localized_location":"Funchal, Portugal"},"answers":[{"question_id":8921874,"question":"What are your technological topics of main interest?"},{"question_id":8921873,"question":"Learn by doing or learn by listening?"}],"link":"https://www.meetup.com/gdgmadeira/members/268075449/"},"is_pro_admin":false},{"id":270596040,"name":"Diogo F.","status":"active","joined":1545869114000,"city":"Funchal","country":"pt","localized_country_name":"Portugal","lat":32.65,"lon":-16.9,"photo":{"id":283534929,"highres_link":"https://secure.meetupstatic.com/photos/member/8/8/7/1/highres_283534929.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/8/8/7/1/member_283534929.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/8/8/7/1/thumb_283534929.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1582048290000,"created":1548336072000,"updated":1548336086000,"role":"coorganizer","group":{"id":30971433,"urlname":"gdgmadeira","name":"GDG Madeira","status":"active","who":"Membros","members":91,"join_mode":"open","localized_location":"Funchal, Portugal"},"answers":[{"question_id":8921874,"question":"What are your technological topics of main interest?"},{"question_id":8921873,"question":"Learn by doing or learn by listening?"}],"link":"https://www.meetup.com/gdgmadeira/members/270596040/"},"is_pro_admin":false},{"id":274083605,"name":"Fernando M.","status":"active","joined":1549739875000,"city":"Funchal","country":"pt","localized_country_name":"Portugal","lat":32.65,"lon":-16.9,"photo":{"id":284932473,"highres_link":"https://secure.meetupstatic.com/photos/member/c/c/f/9/highres_284932473.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/c/c/f/9/member_284932473.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/c/c/f/9/thumb_284932473.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1582059808000,"created":1549757277000,"updated":1549985866000,"role":"coorganizer","group":{"id":30971433,"urlname":"gdgmadeira","name":"GDG Madeira","status":"active","who":"Membros","members":91,"join_mode":"open","localized_location":"Funchal, Portugal"},"answers":[{"question_id":8921874,"question":"What are your technological topics of main interest?"},{"question_id":8921873,"question":"Learn by doing or learn by listening?"}],"link":"https://www.meetup.com/gdgmadeira/members/274083605/"},"is_pro_admin":false}]}
