{"events":[{"created":1537196178000,"duration":7200000,"id":"254759647","name":"Le lancement du LAUG : Industrialisation des dévs & IoT avec Android Things","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1538584200000,"local_date":"2018-10-03","local_time":"18:30","updated":1538620758000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":60,"venue":{"id":25098788,"name":"Leroy merlin","lat":50.61201477050781,"lon":3.1223440170288086,"repinned":true,"address_1":"Rue Chanzy","city":"Lezennes","country":"fr","localized_country_name":"France"},"group":{"created":1534978365000,"name":"Lille Android User Group","id":29598998,"join_mode":"open","lat":50.63999938964844,"lon":3.069999933242798,"urlname":"Lille-Android-User-Group","who":"bugdroids","localized_location":"Lille, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/Lille-Android-User-Group/events/254759647/","description":"<p>Pour le lancement du Lille Android User Group, nous aurons le plaisir de nous rencontrer autour de Gautier Mechling (Google Developer Expert IOT), Florian Paillard et Alexandre Lecerf, pour parler industrialisation des développements et IoT avec Android Things.</p> <p>📱👨‍🏫 Programme de la soirée :<br/>- Accueil entre 18h30 et 18h45<br/>- “Et si l’industrialisation d’un projet mobile devenait facile ?” par Florian Paillard et Alexandre Lecerf<br/>- “Introduction à Android Things à travers 5 projets à construire soi-même” par Gautier Mechling<br/>- Discussions informelles autour de pizzas/bières/soft</p> <p>Talk n°1 : Et si l’industrialisation d’un projet mobile devenait facile ?</p> <p>Durant cette session de 20 minutes nous aurons le plaisir de vous présenter \"Delivery\". Nous mettrons à l’épreuve ce projet Open Source sur des cas concrets d’industrialisation.</p> <p>Présenté par Florian Paillard :<br/>Lead développeur des équipes mobilité LMFR depuis 3 ans. Je travaille principalement sur le socle technique de nos applications et outils pour accélérer les devs. Je développe sur Android depuis Froyo et travaille en tant que développeur professionnel depuis 2013.</p> <p>Ainsi qu'Alexandre Lecerf :<br/>Développeur Java depuis 2014. J’ai principalement les mains sur des applications serveurs et Android. J’ai pris la voie du Kotlin depuis 2017</p> <p>Talk n°2 : Introduction à Android Things à travers 5 projets à construire soi-même</p> <p>On a quand même grave de la chance, nous, les développeurs Android, de pouvoir développer sur une plate-forme aussi moderne, mature, optimisée et sécurisée.<br/>Les applications qu'on écrit peuvent fonctionner sur des smartphones, des Chromebooks, des télés, des voitures, des montres… Et maintenant, avec Android Things, on peut finalement créer n'importe quel type d'appareil tournant sur une version officielle d'Android, si c'est pas trop cool ça !</p> <p>À travers 5 exemples de projets à construire soi même, on va voir en quoi ça peut être intéressant d'utiliser Android pour des appareils IoT et embarqués.</p> <p>Présenté par Gautier Mechling, développeur Android et Google Developer Expert IoT.</p> <p>À l’issue de ces deux présentations, nous pourrons terminer la soirée en bavardant autour de 🍕🍻 pizzas, bières et softs fournis par Leroy Merlin.</p> <p>Que vous soyez développeur mobile de la région ou simple intéressé, nous comptons sur vous pour relayer l'événement et venir nombreux à cette première édition du LAUG.</p> <p>📍Lieu / Sponsor<br/>Nous tenons à remercier Leroy Merlin qui nous accueillera et sponsorisera la soirée.<br/>Rendez-vous au siège de Leroy Merlin à Lezennes dès 18h30.<br/>L’inscription au meetup est obligatoire afin que vous puissiez retirer votre badge nominatif à l’accueil ! Nous serons contraints de fermer les inscriptions 3 jours avant l’évènement.</p> ","visibility":"public"},{"created":1542908134000,"duration":10800000,"id":"256628009","name":"Conquête de l'espace en VR et Modularisation des applications","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1544117400000,"local_date":"2018-12-06","local_time":"18:30","updated":1544135822000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":38,"venue":{"id":24892809,"name":"Decathlon Campus","lat":50.64579772949219,"lon":3.1424810886383057,"repinned":true,"address_1":"4 boulevard de Mons","city":"Villeneuve d'Ascq","country":"fr","localized_country_name":"France"},"group":{"created":1534978365000,"name":"Lille Android User Group","id":29598998,"join_mode":"open","lat":50.63999938964844,"lon":3.069999933242798,"urlname":"Lille-Android-User-Group","who":"bugdroids","localized_location":"Lille, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/Lille-Android-User-Group/events/256628009/","description":"<p>Après une session Android organisée par le GDG-Lille fin octobre, nous vous proposons une soirée accompagnés de Sylvain Nieuwlandt, Gérard Paligot et Othman Barhdadi pour parler conquête de l'espace 🚀 (VR) et modularisation des applications Android.</p> <p>📱👨‍🏫 Programme de la soirée :<br/>- Accueil entre 18h30 et 18h45<br/>- “Modularisation d'une application monolithique existante” par Gérard Paligot et Othman Barhdadi<br/>- “La conquête de l'espace se déroule dans votre poche” par Sylvain Nieuwlandt<br/>- Discussions informelles autour d'un buffet/bières/soft</p> <p>➡️ Talk n°1 : Modularisation d'une application monolithique existante</p> <p>Depuis toujours, le développement d’applications Android consistait à développer des projets monolithiques. Mais dès que votre projet commence à grossir, il devient difficile à maintenir et l’ajout de nouvelles fonctionnalités peut devenir délicat. Cette présentation est un retour d’expérience sur la transformation d’un projet Android monolithique vieux de plusieurs années vers une approche modulaire en responsabilisant chaque module sur sa fonctionnalité.</p> <p>Présenté par Gérard Paligot (Décathlon) :<br/>Technical Leader Android des outils mobiles collaborateurs en magasin chez Decathlon depuis 2 ans. Je travaille sur l’architecture logicielle de l’ensemble de nos applications mobiles.</p> <p>Ainsi qu'Othman Barhdadi (Modis) :<br/>Lead développeur Android chez Modis, actuellement en prestation chez Decathlon. Passionné par les technologies innovantes, j’ai travaillé pendant 5 ans autour du développement Android.</p> <p>➡️ Talk n°2 : La conquête de l'espace se déroule dans votre poche</p> <p>Et si je vous disais que pour partir dans l'espace vous n'avez pas besoin de passer par la NASA ?</p> <p>Venez embarquer dans un talk qui vous fera traverser un champ d'astéroïdes, conquérir Mars, et même peut-être trouver des aliens...</p> <p>Votre navette ? Un smartphone. Votre fusée ? Un bout de carton et deux lentilles. Votre départ ? Immédiat !</p> <p>Présenté par Sylvain Nieuwlandt (SFEIR) :<br/>Passionné d'informatique, de jeux vidéos et d'autres mondes depuis tout petit, je passe mon temps à bidouiller des petits univers en VR et à tester tous les nouveaux frameworks VR/AR disponibles, dans le seul but de pouvoir un jour voir passer le Tardis depuis la plateforme d'observation de mon StarDestroyer.</p> <p>À l’issue de ces deux présentations, nous pourrons terminer la soirée en bavardant autour d'un 🍿 buffet, 🍻 bières et softs fournis par Decathlon.</p> <p>📍Lieu / Sponsor<br/>Nous tenons à remercier Decathlon qui nous accueillera et sponsorise la soirée.</p> <p>Rendez-vous au Decathlon Campus dès 18h30</p> ","visibility":"public"},{"created":1547572836000,"duration":7200000,"id":"258099776","name":"Soirée Kotlin du LAUG","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1548351000000,"local_date":"2019-01-24","local_time":"18:30","updated":1548361676000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":63,"venue":{"id":26083519,"name":"EFFICOM Lille","lat":50.63113021850586,"lon":3.063415050506592,"repinned":true,"address_1":"159-161 Boulevard de la Liberté","city":"Lille","country":"fr","localized_country_name":"France"},"group":{"created":1534978365000,"name":"Lille Android User Group","id":29598998,"join_mode":"open","lat":50.63999938964844,"lon":3.069999933242798,"urlname":"Lille-Android-User-Group","who":"bugdroids","localized_location":"Lille, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/Lille-Android-User-Group/events/258099776/","description":"<p>Bonne année 2019 à tous les chtis'droids lillois !<br/>Pour la rentrée, nous vous proposons une soirée accompagnés de Yassine Benabbas et Salomon Brys pour parler de Kotlin 1.3 et Multiplatform 🚀</p> <p>📱👨‍🏫 Programme de la soirée :<br/>- Accueil entre 18h30 et 18h45<br/>- “Les nouveautés de Kotlin 1.3 en Live Coding” par Yassine Benabbas<br/>- “Kotlin pour Android, iOS et le Web” par Salomon Brys<br/>- Discussions informelles autour d'un buffet</p> <p>➡️ Talk n°1 : Les nouveautés de Kotlin 1.3 en Live Coding</p> <p>Découvrons ensemble les nouveautés de Kotlin 1.3. Au programme on verra notamment les inline classes, les contrats et la les coroutines qui ont été stabilisées.<br/>Live coding signifie que tout sera illustré avec du code et un IDE (IntelliJ). Donc c’est garanti 0% slides.</p> <p>Présenté par Yassine Benabbas (Atos Worldline) :<br/>Développeur d’applications mobiles chez Worldline depuis 2011, également enseignant et docteur (en informatique). Je m’intéresse aux sujets mobiles et web mais j’aime bien toucher un peu à tout. Je programme avec passion depuis plus d’un dizaine d’années.<br/>Twitter : @yostane</p> <p>➡️ Talk n°2 : Kotlin pour Android, iOS et le Web</p> <p>Kotlin est un des langages officiels pour le développement Android, et il est maintenant officiellement supporté par plusieurs framework backends comme Spring. Saviez vous que vous pouvez utiliser Kotlin pour compiler pour iOS via LLVM ou pour le web via JS ?<br/>Durant cette présentation, je montrerai comment créer une application mobile qui tourne sur Android, sur iOS et sur le web tout en restant fidèle à chaque plateforme.<br/>Nous verrons comment organiser votre code pour partager la logique métier entre les plateformes tout en conservant la présentation spécifique à chacune.<br/>Enfin, nous discuterons de l’état actuel de la technologie Kotlin multi-plateformes, ainsi que son futur.</p> <p>Présenté par Salomon Brys (Kodein Koders) :<br/>Passionné de Kotlin, Salomon est le créateur du premier framework multi-plateforme en Kotlin : Kodein Framework, et de la première société entièrement dédiée à Kotlin en Europe : Kodein Koders. Dans son temps libre, il joue à tous les jeux de société qui lui passent par la main, ou il vole aux manettes d’avions de tourisme.<br/>Twitter: @salomonbrys</p> <p>À l’issue de ces deux présentations, nous pourrons terminer la soirée en bavardant autour d'un 🍿 buffet.</p> <p>📍Lieu / Sponsors<br/>Nous tenons à remercier :<br/>* EFFICOM Lille qui nous accueillera et sponsorise la venue des speakers,<br/>* Atos Worldline grâce à qui nous bénéfécierons d'un buffet !</p> <p>Rendez-vous à EFFICOM Lille dès 18h30.</p> ","visibility":"public"},{"created":1551963055000,"duration":9000000,"id":"259559900","name":"Soirée Flutter du LAUG","rsvp_limit":80,"date_in_series_pattern":false,"status":"past","time":1553016600000,"local_date":"2019-03-19","local_time":"18:30","updated":1553031987000,"utc_offset":3600000,"waitlist_count":0,"yes_rsvp_count":63,"venue":{"id":26083519,"name":"EFFICOM Lille","lat":50.63113021850586,"lon":3.063415050506592,"repinned":true,"address_1":"159-161 Boulevard de la Liberté","city":"Lille","country":"fr","localized_country_name":"France"},"group":{"created":1534978365000,"name":"Lille Android User Group","id":29598998,"join_mode":"open","lat":50.63999938964844,"lon":3.069999933242798,"urlname":"Lille-Android-User-Group","who":"bugdroids","localized_location":"Lille, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/Lille-Android-User-Group/events/259559900/","description":"<p>Après un meetup de rentrée centré sur Kotlin, nous vous proposons une soirée accompagnés d'Edouard Marquez et Mehdi Slimani pour parler Flutter 🤳</p> <p>📱👨‍🏫 Programme de la soirée</p> <p>- Accueil entre 18h30 et 18h45<br/>- \"Introduction à Flutter\" par Edouard Marquez<br/>- \"Fast and Flutterious\" par Mehdi Slimani<br/>- Discussions informelles autour d'un buffet</p> <p>➡️ Introduction à Flutter</p> <p>Flutter est un projet de Google visant à produire des applications natives multiplateforme pour Android et iOS. Désormais disponible en version stable, nous verrons ce qu'apporte et comment fonctionne ce framework très performant.<br/>… mais Flutter gère aussi des applications pour le desktop (Windows/Mac/Linux) et bientôt pour le web. Vous voulez en savoir plus, alors rendez-vous le 19 Mars !</p> <p>🗣 Edouard Marquez - @g123k<br/>Fervant supporter d'Android, Edouard a découvert Flutter en début d'année 2018 et ne peut plus s'en passer depuis. Il est également organisateur du Flutter Paris et l'un des membres du Paris Android User Group (organisateur de l'Android Makers).</p> <p>➡️ Fast and Flutterious, live coding</p> <p>Le développement d’applications mobiles laisse plusieurs possibilités en termes de technologie, le développement en natif pour de bonnes performances mais avec l’inconvénient de devoir développer deux applications (Android et iOS), ou les frameworks hybrides comme Ionic/ReactNative/Xamarin/… souvent au détriment d’une expérience utilisateur fluide.<br/>Découvrez la puissance de Flutter lors de cette session de live coding.</p> <p>🗣 Mehdi Slimani de INEAT Group - @mslimanii<br/>Du développement mobile aux solutions Cloud j’applique mon expertise au sein de la direction technique d’Ineat Group.<br/>Amoureux de Flutter depuis près d’un an je dispense des formations pour Ineat Academy.</p> <p>À l’issue de ces deux présentations, nous pourrons terminer la soirée en bavardant autour d'un 🍿 buffet.</p> <p>📍Lieu / Sponsors<br/>Nous tenons à remercier :<br/>- EFFICOM Lille qui nous accueille pour la deuxième fois d'affilé,<br/>- INEAT qui sponsorise la venue des speakers et grâce à qui nous profiterons d'un buffet !</p> <p>Rendez-vous à nouveau à EFFICOM Lille dès 18h30.</p> ","visibility":"public"},{"created":1558516820000,"duration":7200000,"id":"261668500","name":"Google Assistant et MotionLayout","rsvp_limit":40,"date_in_series_pattern":false,"status":"past","time":1561566600000,"local_date":"2019-06-26","local_time":"18:30","updated":1561578043000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":26,"venue":{"id":26365784,"name":"SFEIR Lille","lat":50.639686584472656,"lon":3.065174102783203,"repinned":true,"address_1":"74 Rue des Arts","city":"Lille","country":"fr","localized_country_name":"France"},"group":{"created":1534978365000,"name":"Lille Android User Group","id":29598998,"join_mode":"open","lat":50.63999938964844,"lon":3.069999933242798,"urlname":"Lille-Android-User-Group","who":"bugdroids","localized_location":"Lille, France","state":"","country":"fr","region":"en_US","timezone":"Europe/Paris"},"link":"https://www.meetup.com/Lille-Android-User-Group/events/261668500/","description":"<p>Avant de partir en vacances et de profiter du beau temps, nous vous proposons de venir écouter Elaine Dias Batista et Sandra Dupré pour une soirée autour du récent Motion Layout et de l'intégration à Google Assistant.</p> <p>📱👩‍🏫 Programme de la soirée</p> <p>- Accueil entre 18h30 et 18h45<br/>- \"Let's play with MotionLayout\" par Sandra Dupré<br/>- \"Google Assistant for Android developers\" par Elaine Dias Batista<br/>- Discussions informelles autour d'un apéritif</p> <p>➡️ Let's play with MotionLayout</p> <p>Ces dernières années, les Activity/Fragment se sont allegées grâce aux nouvelles architectures et outils (Clean Architecture, Reactive pattern, Architecture component…). Il restait, entre autre, cette gestion d'animation qui transformait vite chaque classe \"de vue\" en un véritable enfer à lire et comprendre.<br/>MotionLayout est l'une des nouvelles features de ConstraintLayout 2.0, qui pourrait bien devenir le nouvel outil de prédilection pour créer des UI attractives.<br/>Qu'est-il possible de faire? Comment l'utiliser?</p> <p>🗣 Sandra Dupré - @SandraDdev<br/>Android Developer who is crazy about making things even smarter. She works for Disney (where all the dreams come true) Streaming Services. These days, she is passionate about MotionLayout.</p> <p>➡️ Google Assistant for Android developers</p> <p>The fact that \"apps\" for the Google Assistant and for Android are both available on Android smartphones can be the cause of some confusion. Do I have to go to the Play Store to download and install an \"app\" for the Google Assistant? Can I launch a Google Assistant experience from an Android app? How to integrate advanced voice recognition (NLP or other) on existing apps? What experience should I offer on my app? In this talk I will answer these questions, do a comparison of the ecosystems and how they can work together.</p> <p>🗣 Elaine Dias Batista - @elainedbatista<br/>Elaine has been working with mobile apps development for the past 6 years. Since the launch of the Google Assistant, she has been following the developments around that area. She truly believes that interacting with technology using natural language will define the future of computing. Born and raised in Brazil, she's been living in France since 2004 and loves everything multicultural. She's a GDE for the Google Assistant.</p> <p>À l’issue de ces deux présentations, nous pourrons terminer la soirée en bavardant autour d'un apéritif offert par SFEIR.</p> <p>📍Lieu / Sponsors<br/>Nous tenons à remercier SFEIR Lille qui nous accueillera dans ses nouveaux locaux Lillois et offrira l'apéritif à l'issu des deux présentations !</p> <p>Rendez-vous chez SFEIR dès 18h30.</p> ","visibility":"public"}],"organizers":[{"id":180638132,"name":"Mohammed B.","status":"active","joined":1414565325000,"city":"Lille","country":"fr","localized_country_name":"France","lat":50.64,"lon":3.07,"photo":{"id":280712383,"highres_link":"https://secure.meetupstatic.com/photos/member/7/e/7/f/highres_280712383.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/7/e/7/f/member_280712383.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/7/e/7/f/thumb_280712383.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1561825903000,"created":1534978365000,"updated":1537138945000,"role":"organizer","group":{"id":29598998,"urlname":"Lille-Android-User-Group","name":"Lille Android User Group","status":"active","who":"bugdroids","members":319,"join_mode":"open","localized_location":"Lille, France","group_photo":{"id":476541486,"highres_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/highres_476541486.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/600_476541486.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/thumb_476541486.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"link":"https://www.meetup.com/Lille-Android-User-Group/members/180638132/"},"is_pro_admin":false},{"id":194014106,"name":"Gerard","status":"active","joined":1444678192000,"city":"Lille","country":"fr","localized_country_name":"France","lat":50.64,"lon":3.07,"photo":{"id":276155526,"highres_link":"https://secure.meetupstatic.com/photos/member/8/a/c/6/highres_276155526.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/8/a/c/6/member_276155526.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/8/a/c/6/thumb_276155526.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1561565543000,"created":1537275689000,"updated":1551432913000,"role":"coorganizer","group":{"id":29598998,"urlname":"Lille-Android-User-Group","name":"Lille Android User Group","status":"active","who":"bugdroids","members":319,"join_mode":"open","localized_location":"Lille, France","group_photo":{"id":476541486,"highres_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/highres_476541486.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/600_476541486.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/thumb_476541486.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"link":"https://www.meetup.com/Lille-Android-User-Group/members/194014106/"},"is_pro_admin":false},{"id":195378018,"name":"Louis D.","status":"active","joined":1447175905000,"city":"Lille","country":"fr","localized_country_name":"France","lat":50.64,"lon":3.07,"photo":{"id":276355113,"highres_link":"https://secure.meetupstatic.com/photos/member/d/7/4/9/highres_276355113.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/d/7/4/9/member_276355113.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/d/7/4/9/thumb_276355113.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1562922727000,"created":1535121208000,"updated":1535366122000,"role":"coorganizer","group":{"id":29598998,"urlname":"Lille-Android-User-Group","name":"Lille Android User Group","status":"active","who":"bugdroids","members":319,"join_mode":"open","localized_location":"Lille, France","group_photo":{"id":476541486,"highres_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/highres_476541486.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/600_476541486.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/5/3/e/e/thumb_476541486.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"link":"https://www.meetup.com/Lille-Android-User-Group/members/195378018/"},"is_pro_admin":false}]}
