{"events":[{"created":1242249719000,"id":"10405405","name":"Kickoff Meeting: Making the Android UI Fast and Efficient by Romain Guy","rsvp_limit":85,"date_in_series_pattern":false,"status":"past","time":1247621400000,"local_date":"2009-07-14","local_time":"18:30","updated":1251426882000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":77,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/10405405/","manual_attendance_count":101,"description":"<p>This is our first kick-off event! Come and learn about Android and meet other folks that live in the SF Bay Area and are interested in this exciting new platform!</p> <p>We are extremely fortunate that Romain Guy from Google's Android UI team offered to do a presentation at our first event. For those that don't know, Romain is also the brains behind Android's home screen.</p> <p>We'll start off the evening with a <i>short</i> introduction to Android, to make sure everyone is on board.</p> <p>Then, Romain will deliver his <a href=\"http://code.google.com/events/io/sessions/TurboChargeUiAndroidFast.html\"><i>Turbo-charge your UI: How to Make your Android UI Fast and Efficient</i></a> talk from this year's <a href=\"http://code.google.com/events/io/\">Google I/O</a>.<br/>We will <i>learn practical tips, techniques and tricks for making your Android applications fast and responsive</i>. The talk <i>will focus on optimizations recommended by the Android framework team to make the best use of the UI toolkit</i>.</p> <p>And unlike at Google I/O, Romain will have plenty of time to answer any and all questions you may have! Come prepared!</p> <p>Pizzas will be sponsored by Diana Henninger from <a href=\"http://www.teksystems.com/\">TEKsystems</a> and refreshments will be brought in by Thao-Linh Bui from <a href=\"http://vircon.com\">Vircon</a>!</p> <p>We'll be giving away five copies of <i><a href=\"http://oreilly.com/catalog/9780596521479/\">Android Application Development</a></i> book published (and donated to our group) by <a href=\"http://conferences.oreilly.com/toc/\">O'Reilly</a>.</p> <p>Note that if you plan to attend, you absolutely need to RSVP before the cut-off date, or you risk not being able to get past the security guard.</p> <p>Also, this <a href=\"http://www.sfjava.org/calendar/10674274/\">event is co-hosted</a> by <a href=\"http://www.sfjava.org/\">the San Francisco Java User Group</a>, and if you belong to both groups please do not double-RSVP as the space is limited.</p> <p>See you on July 14th at 6:30pm!</p> <p>About Romain Guy<br/><a href=\"http://www.curious-creature.org/about/\">Romain Guy</a> is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.</p> ","visibility":"public"},{"created":1247625647000,"id":"10879399","name":"Learn what it takes to make a good Android app great - at our August meetup","rsvp_limit":120,"date_in_series_pattern":false,"status":"past","time":1251423000000,"local_date":"2009-08-27","local_time":"18:30","updated":1255055936000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":74,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/10879399/","manual_attendance_count":45,"description":"<p>At our <a href=\"http://www.sfandroid.org/calendar/10405405/\">kick-off event</a>, many of you asked about how to make your Android apps better and how to make your development efforts worthwhile... so you'll be happy to know that a panel of three mobile-industry gurus will address exactly those questions at our August 27th meetup!</p> <p><i>Join a discussion of technical enhancements, product strategies, and marketing opportunities for Android application development. Jason, John, and David from <a href=\"http://developer.handson.com/\">Hands-On Mobile</a> will be presenting a technical overview of ways to improve your application’s stickiness, boost adoption, engage users, and increase monetization and ROI. This will include a technical deep dive on implementing some of these key strategies and a discussion on best practices for Android from 8 years of traditional mobile experience. The session will wrap up with an open-discussion and one-on-one concept/app reviews, time permitting.</i></p> <p>Like <a href=\"http://www.sfandroid.org/calendar/10405405/\">the last time</a>, we'll be giving away free Android books from O'Reilly!</p> <p>The <a href=\"http://maps.google.com/maps?source=ig&amp;hl=en&amp;ie=UTF8&amp;q=cnet+san+francisco&amp;fb=1&amp;split=1&amp;gl=us&amp;cid=0,0,9301680954302663928&amp;ei=ASR7Ssa6BoyIsgOlnbzvCg&amp;ll=37.786911,-122.397265&amp;spn=0.010192,0.021522&amp;z=16&amp;iwloc=A\">venue</a> is sponsored by <a href=\"http://www.sfphp.org/members/2267793/\">Michael Tougeron</a> from <a href=\"http://www.cbsinteractive.com/\">CNET Networks</a>, who also happens to run the <a href=\"http://www.sfphp.org/\">SF PHP Meetup</a>. A great guy!</p> <p>Food and drinks for this event will be sponsored by Hands-On Mobile. Thanks guys!</p> <p>The rough agenda for the evening is as follows:<br/>6:30pm - Arrive and network<br/>6:50pm - Announcements<br/>7:00pm - The start of the presentation<br/>9:00pm - Wrap-up and book giveaways!</p> <p>See you all on the 27th!</p> <p><b>About the speakers</b><br/>Hands-On Mobile is a premier mobile technology company as well as an award-winning developer and publisher of mobile entertainment.</p> <p><a href=\"http://jtomlinson.blogspot.com/\">Jason Tomlinson</a><br/>Jason is responsible for all internal Android development at Hands-On Mobile, and serves as the engineering liaison with external partners - i.e. Google, Sprint etc.... Jason works with Android on a daily basis and has been coding for the platform since before the first handsets were released to market. One of his earlier works is the <a href=\"http://www.androidappreviewsource.com/2009/07/15/amazed-2-android-app-review/\">Amazed</a> game for Android (<a href=\"http://www.youtube.com/watch?v=JUmachL5IW4\">video</a> of the original).</p> <p>John P. Joseph<br/>John is the Senior Product Manager / Producer responsible for the Hands-On Mobile Developer Network (HDN), a program that helps developers successfully bring their visions to digital distribution marketplaces. While at Hands-On, John splits his time between finding ways to make HDN more interesting and valuable to indie developers, and working with members to make great games and apps. Prior to Hands-On Mobile, John had worked in the mobile space for 8 years, both around the world and in the US, at number of mobile startups and a mobile carrier.</p> <p>David McCaman, Senior Director of Marketing, Hands-On Mobile</p> <p>As Head of Marketing, Mr. McCaman oversees all marketing functions for Hands-On Mobile, including the Hands-On Mobile Developer Network (HDN), a program that creates partnerships with developers to bring new content to all platforms. He manages Hands-On Mobile’s marketing relationships with mobile operators, OEMs and license partners. Mr. McCaman also directs PR, research and advertising for all mobile games and applications.</p> <p>Mr. McCaman has worked at Hands-On for over 4 years. He previously headed marketing for GamePro Magazine and has nearly 15 years experience in marketing and gaming. He holds a BA degree from the University of California, Los Angeles.</p> ","visibility":"public"},{"created":1252688449000,"id":"11347898","name":"Learn how to develop for Android, beyond the HelloWorld","rsvp_limit":45,"date_in_series_pattern":false,"status":"past","time":1255051800000,"local_date":"2009-10-08","local_time":"18:30","updated":1258514858000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":43,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/11347898/","manual_attendance_count":23,"description":"<p>While many of our members are Android gurus, there are quite a few of us who yet have to take the plunge and get our hands dirty with Android development.</p> <p>Marko Gargenta, who is responsible for <a href=\"http://marakana.com/training/android/android_bootcamp.html\">Android training</a> at Marakana (and happens to be my brother), offered to show us how to build a real-world (not HelloWorld) Android application from scratch in around two hours.</p> <p>You can either sit back, relax, and enjoy the show... <i>or</i> you can take a more active role, and follow along, building your own version of the app. If you opt for the latter, you need to bring your own laptop - already <a href=\"http://developer.android.com/sdk/1.5_r3/installing.html\">configured with the Android SDK</a> (including Eclipse)- though there may be some classroom workstations for our use.</p> <p>For those of you that are already proficient with Android, you may still want to swing by, share your wisdom with the fellow attendees, and network with others in the Android community.</p> <p><a href=\"http://marakana.com/\">Marakana</a> will provide drinks and pizzas for this event and we'll give a way some free Android books.</p> <p>Because the space is limited, make sure you RSVP sooner... rather than later if you want to reserve your seat.</p> <p>See you on Oct 8th.</p> ","visibility":"public"},{"created":1256234476000,"id":"11687435","name":"Learn about Data Persistence in Android","rsvp_limit":45,"date_in_series_pattern":false,"status":"past","time":1258511400000,"local_date":"2009-11-17","local_time":"18:30","updated":1264563682000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":41,"venue":{"id":780555,"name":"Marakana Classroom","lat":37.752925872802734,"lon":-122.39375305175781,"repinned":false,"address_1":"1071 Mississippi St","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"415-647-7000","zip":"94107","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/11687435/","manual_attendance_count":21,"description":"<p>Now that we <a href=\"http://www.sfandroid.org/calendar/11347898/\">know how to build some basic Android apps</a>, it's time to expand on that knowledge.</p> <p>Marko Gargenta, who is responsible for <a href=\"http://marakana.com/training/android/\">Android training at Marakana</a> (and happens to be my brother), offered to give another talk, this time on a wide range of data persistence options available in the Android SDK, including:<br/>- Shared Preferences<br/>- SQLite Database<br/>- Content Providers<br/>- File System</p> <p>As before, you can either sit back, relax, and enjoy the show... or you can take a more active role, and follow along, building your own version of the <a href=\"http://marakana.com/forums/android/general/23.html\">GolfScore</a> app. If you opt for the latter, you need to bring your own laptop - already <a href=\"http://developer.android.com/sdk/1.6_r1/installing.html\">configured with the Android SDK</a> (including Eclipse).</p> <p>For those of you that are already proficient with Android, you may still want to swing by, share your wisdom with the fellow attendees, and network with others in the Android community.</p> <p><a href=\"http://marakana.com/\">Marakana</a> will provide drinks and pizzas for this event and we'll give a way some free Android books, courtesy of <a href=\"http://www.pearsoned.com/\">Pearson Education</a> and <a href=\"http://conferences.oreilly.com/toc/\">O'Reilly Media</a>.</p> <p>Because the space is limited, make sure you RSVP sooner... rather than later if you want to reserve your seat.</p> <p>If any of you would like to give a <a href=\"http://www.sfandroid.org/pages/Presentation/\">talk</a> at one of our future meetups (e.g. share your wisdom about a specific API, or talk about an app you built), <a href=\"http://www.sfandroid.org/suggestion/\">I want to hear from you</a>!</p> <p>About Marko Gargenta<br/>Marko Gargenta has been programming in Java even before it was named Java. His background is in very large enterprise web application development but he's also had a fair-share of UI experience having rewritten the entire AWT into lightweight components before Java Swing ever came out. He's a big believer in agile development processes, being a certified ScrumMaster himself as well as contributor to eXtreme Programming methodology.</p> <p>Marko is a professional consultant and instructor. He's taught teams of organizations such as Sony-Ericsson, Ericsson Canada, MetroPCS, Experian, DoJ, DoD, and many others. He's published a PHP/MySQL by Example book with Prentice Hall (world's largest tech publisher) as well as created many of Marakana's courseware, including the Android series.</p> ","how_to_find_us":"The Marakana Classroom will be reserved for our exclusive use. Mississippi @25th (look for a sign)","visibility":"public"},{"created":1259791556000,"id":"12002846","name":"Get a behind-the-scenes look of a real-world Android app","rsvp_limit":140,"date_in_series_pattern":false,"status":"past","time":1264559400000,"local_date":"2010-01-26","local_time":"18:30","updated":1266982629000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":134,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/12002846/","manual_attendance_count":85,"description":"<p>For our January 26th meetup we are going to take a break from the GolfCaddy application we've been building and turn our attention to <a href=\"http://blog.dannyroa.com/\">Danny Roa</a>, who generously offered to give us a behind the scenes look of his <a href=\"http://www.androlib.com/android.application.com-dannyroa-sfmuniplus-zpAD.aspx\">San Francisco Muni Plus</a> application, selling for $1.99 on Android Market.</p> <p>Here are some of the questions I asked Danny to address while showing us his app:How and why did you get involved with the Android platform?<br/>What motivated you to build a Muni app?<br/>How did you get started? Did you get help from anyone else? Did you base your app on any existing apps out there?<br/>What was your thought process with respect to the design of the UI? What about the app architecture?<br/>What were some of the technical problems you ran into when building your app? How did you overcome them?<br/>How did you go about publishing and promoting your app?<br/>Did you enter your app in any contents (e.g. ADC) and how did you do?<br/>What kind of a user feedback have you been getting? Is it useful? How do you interact with your users?<br/>How do you plan to monetize your app/Android expertise?<br/>etc.</p> <p>Additionally, Danny promised to talk about:Newbie Mistakes Made while developing for Android<br/>Development Experience (Dev Environment, Learning Java, etc.)<br/>Best resources to get help</p> <p>Note, this meeting is taking place at <b>our new venue sponsor</b>: <a href=\"http://www.supinfo.com/en/supinfo_san_francisco.aspx\">SUPINFO of San Francisco</a> at <a href=\"http://maps.google.com/maps?f=q&amp;source=s_q&amp;hl=en&amp;geocode=&amp;view=map&amp;q=2738+Hyde+St,+San+Francisco,+CA&amp;sll=37.807512,-122.42044&amp;sspn=0.010308,0.018132&amp;gl=us&amp;ie=UTF8&amp;hq=&amp;hnear=2738+Hyde+St,+San+Francisco,+California+94109&amp;ll=37.806292,-122.420461&amp;spn=0.010308,0.018132&amp;z=16\">2738 Hyde St</a> (between Beach and North Point Streets, near Cable Car Turntable). Big thanks goes out to Joel Marty for putting me in touch with Lisa Tenor, who will be our host at SUPINFO!</p> <p>The food and drinks for this event will be sponsored by <a href=\"http://www.linkedin.com/in/chrismiddlemass\">Chris J. Middlemass</a> from <a href=\"http://www.apexsystemsinc.com/\">Apex Systems</a>!</p> <p>Be sure to stick around until the end to get a shot at winning a couple of Android books from Pearson!</p> <p>As before, this event is organized through Marakana, which happens to provide <a href=\"http://marakana.com/training/android/\">Android training</a> - in case anyone's interested :-)</p> ","how_to_find_us":"Follow the signs when you get in","visibility":"public"},{"created":1264626788000,"id":"12442173","name":"Learn about Android Internals and NDK","rsvp_limit":140,"date_in_series_pattern":false,"status":"past","time":1266978600000,"local_date":"2010-02-23","local_time":"18:30","updated":1270003232000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":107,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/12442173/","manual_attendance_count":107,"description":"<p>For our February meetup, we are going to take a step back from the <a href=\"http://en.wikipedia.org/wiki/Dalvik_virtual_machine\">Dalvik virtual machine</a> (i.e. the Java SDK) and explore the often-overlooked (and somewhat poorly documented) Android Internals and <a href=\"http://developer.android.com/sdk/ndk/1.6_r1/index.html#overview\">NDK</a>.</p> <p>Specifically, Marko Gargenta (who happens to be my brother) plans to show us the anatomy of Android system, how various parts work as well as how to use JNI and NDK to write our own native libraries to be called from our Android applications. We will learn how Android system starts up, what major pieces run as part of the C library, how each application is isolated from others, what they use to communicate between them.</p> <p>Here is a rough outline of Marko's talk:</p> <p>Anatomy of Android<br/>Linux kernel<br/>Native Libraries<br/>Android Runtime<br/>Application Framework</p> <p>Android Physiology<br/>Startup Walkthrough<br/>Layer Interaction</p> <p>JNI Overview<br/>JNI Overview<br/>JNI Development - Java<br/>JNI Development - C<br/>Compiling JNI sample application</p> <p>Using NDK<br/>What is NDK<br/>Installing and setting up NDK<br/>Getting started with NDK<br/>Creating a simple application using NDK</p> <p>Pizzas for this event will be sponsored by Jenny Roy from <a href=\"http://mylookout.com/\">Lookout</a>, the makers for a Android security app (which utilizes the NDK). As before, we'll give out a couple of Android books from Pearson (and possibly some other swag).</p> <p>About <a href=\"http://marakana.com/expert/marko_gargenta,2.html\">Marko Gargenta</a>:<br/>Marko founded Marakana back in 2001 to help underprivileged youth, minorities, and inner-city kids learn web technologies and get ahead in life. So Marakana emerged with goal of helping people get better at what they do professionally, focused on open source software training.</p> <p>Marko is the developer of <a href=\"http://marakana.com/training/android/\">Marakana Android Training</a> series. He has taught Android for companies such as Sony-Ericsson, Qualcomm, Ericsson Canada, and many others. Marko is a co-founder of San Francisco Android Users Group and regularly teaches <a href=\"http://marakana.com/training/android/android_bootcamp.html\">Android Bootcamp</a> at Marakana.</p> <p>In 2006 Marko Gargenta published \"PHP and MySQL By Example\", a collection on PHP examples. The book was published by Prentice Hall, world's largest technology publisher and has been also translated to Spanish.</p> <p>Marko Gargenta obtained his Bachelor of Mathematics Degree from University of Waterloo (Canada's MIT) and has been developing in Java since 1996. He lives in San Francisco, California.</p> ","visibility":"public"},{"created":1267911274000,"id":"12803170","name":"Learn about power consumption and battery life on Android devices","rsvp_limit":140,"date_in_series_pattern":false,"status":"past","time":1269999000000,"local_date":"2010-03-30","local_time":"18:30","updated":1272422085000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":45,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/12803170/","manual_attendance_count":43,"description":"<p>Some of you might have already attended/seen Jeffrey Sharkey's talk <a href=\"http://code.google.com/events/io/2009/sessions/CodingLifeBatteryLife.html\"><i>Coding for Life -- Battery Life, That Is</i></a> from Google I/O 2009, but hopefully all of you get that power consumption of your Android app can play a significant role in the overall user experience.</p> <p>For our March 30th event, we are very fortunate to have Frank Maker, Eric Jung, and Yichuan Wang, a trio of very smart PhD students, come and share what they've learned about power consumption / battery life on mobile/Android devices in their years of research.</p> <p>Specifically, they plan to talk about:Mobile Architecture - Talk about differences with desktop/laptop computers, where power goes, etc.<br/>Measuring Power/Energy - difference between energy and power, battery technology, why the problem isn't going away anytime soon<br/>Software Optimizations - different ideas you can use to lower the power consumption of your application</p> <p><a href=\"http://marakana.com/\">Marakana</a> will be sponsoring food and drinks for this event. We'll also give away an Android book, courtesy of <a href=\"http://oreilly.com/\">O'Reilly</a>, plus a couple of T-Shirts (from Sun).</p> <p>About Frank Maker - Main Speaker</p> <p>Frank Maker is a PhD student at the University of California, Davis studying Embedded Systems focusing on low power mobile platforms. He has expertise in cross-layer embedded systems work ranging from low-level device drivers to high level application. Previously, he worked in embedded automotive electronics with BMW and Motorola Automotive. Currently he is a member of the Micropower Circuits and Systems Group (MCSG) working on: cell phone solar panel power supplies, processes for repurposing used cell phones and a cell phone computing cluster. In addition to his research work, he also runs an smartphone consulting company, Handy Codeworks LLC, focusing on the Android and iPhone platforms.</p> <p>About Eric Jung - \"Using user-profiles to inform design\"</p> <p>Eric Jung is a fourth year Ph.D. student in the Electrical and Computer Engineering department at University of California, Davis. He obtained his B.S. and M.S. from the same university, in 2006 and 2009 respectively. His research interests include wireless networking and context-based phone resource optimization.</p> <p>About Yichuan Wang - \"New Synchronization and Authentication mechanism in Android 2.0\"</p> <p>A PhD student in the Department of Computer Science at University of California, Davis, Yichuan Wang's research interest includes mobile Internet, and dynamic optimization. He received his B.S from Zhejiang University in 2006. After working for Nokia, he got M.S from Georgia State University in 2009.</p> ","visibility":"public"},{"created":1270063396000,"id":"13050451","name":"Learn about Android IDEs and Tools","rsvp_limit":140,"date_in_series_pattern":false,"status":"past","time":1272418200000,"local_date":"2010-04-27","local_time":"18:30","updated":1272591560000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":67,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/13050451/","manual_attendance_count":52,"description":"<p>By popular-demand, our April 27th event will focus on Android IDEs (<a href=\"http://developer.android.com/guide/developing/eclipse-adt.html\">Eclipse</a>, and <a href=\"http://developer.android.com/guide/developing/other-ide.html\">other</a>) and <a href=\"http://developer.android.com/guide/developing/tools/index.html\">Tools</a>.</p> <p>This is going to be a multi-speaker event!</p> <p>We'll start of with Rose Roark, Andreas Schobel, and Harry Tormey from <a href=\"https://snaptic.com/\">Snaptic</a> who offered to discuss:<br/>- Android developer tools in general and how they contrast with Xcode, Visual Studio and other setups.<br/>- Code sources of information (example code, code snippits).<br/>- Common problems developers encounter when building their apps.<br/>- How to debug Android code.<br/>- Odd issues with Android.</p> <p>We will then go to Joachim Pfeiffer who plans to cover Android debugging and profiling tools: adb, ddms, Traceview, sqlite3, and Emulator dev tools in more detail.</p> <p>Feel free to come ready to share your experiences with Android tools!</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from <a href=\"http://techcu.com/personal/\">Technology Credit Union</a>. Nicholas Koch from Nestle Taster's Choice will be keeping us awake with free coffee and he'll also give away a $50 Apple Store gift card to a lucky winner. We'll also give away some \"goodies\" from Sun :-)</p> <p><b>Note: <a href=\"http://www.sfagile.org/\">SF-Agile User Group</a> also has <a href=\"http://www.sfagile.org/calendar/12991250/\">an event this evening at SUPINFO</a> (just in a different room). This will be a great opportunity to network with those folks.</b></p> <p>About Joachim Pfeiffer:<br/>Coding since age 16, and obtaining a formal degree in Computer Science in 1992, Joachim has been involved in building fleet tracking systems for public transportation operators, utilizing purpose built land mobile data and voice radio networks.<br/>Joachim is currently with Booz Allen Hamilton, assisting the San Francisco Municipal Transportation Agency (SFMTA) and Golden Gate Bridge Highway and Transportation District in the design and build of their new wireless communications and transit management systems. Burried in these activities, he has also helped start up the mobile app development effort at Booz Allen.</p> <p>Disclaimer: This event is organized by Marakana, who happens to offer <a href=\"http://marakana.com/training/android/\">Android training</a>.</p> ","visibility":"public"},{"created":1272948834000,"id":"13377543","name":"Android Mixer in San Francisco","rsvp_limit":1,"date_in_series_pattern":false,"status":"past","time":1274232600000,"local_date":"2010-05-18","local_time":"18:30","updated":1274248408000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":1,"venue":{"id":1254986,"name":"Twilio","lat":37.786956787109375,"lon":-122.39446258544922,"repinned":false,"address_1":"501 Folsom Street","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"877-889-4546","zip":"94105","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/13377543/","manual_attendance_count":150,"description":"<p>Georgi from <a href=\"http://www.meetup.com/Informal-Android-Developer-Meetup/\">Informal-Android-Developer-Meetup</a> is organizing <a href=\"http://www.meetup.com/Informal-Android-Developer-Meetup/calendar/13311471/\">Android Mixer in San Francisco on May 18th</a> - a day before the Google I/O!</p> <p><i>San Francisco will be filled with Android developers from all over the world for Google IO To help build ties within the Android community, both locally and internationally, a networking mixer will be held Tuesday evening, May 18, 2010, the day before Google IO. This free mixer is open to all people interested in Android.</p> <p>Bring tons of business cards, or download a free barcode reader from the Android Market to use your new Android phone to read and send contact info.</p> <p>A limited number of developers can sign up to demo one of the Android apps that they have created before the crowd. Sign up to demo your Android app at <a href=\"http://androidmixerdemomay182010.eventbrite.com/\"><a href=\"http://androidmixerde\" class=\"linkified\">http://androidmixerde</a>...</a></p> <p>Drinks will be provided by Twilio. Food and other beverages will be provided by AdMob and GetJar.</p> <p>This mixer and the Informal Android Developer Meetup have no affiliation with Google, Inc.</i></p> <p>I hope most of you can make it as this is a once-a-year opportunity to network with some of the not-so-local Android folks!</p> <p><b>To RSVP go to the <a href=\"http://www.meetup.com/Informal-Android-Developer-Meetup/calendar/13311471/\">official event page</a></b>.</p> ","how_to_find_us":"Corner of First and Folsom in the SoMa district (just a few blocks from the Moscone Center). 3rd Floor.","visibility":"public"},{"created":1272865069000,"id":"13364569","name":"Demo Your Code and Share Ideas at Hacker/Coder Get-Together on May 25th","rsvp_limit":130,"date_in_series_pattern":false,"status":"past","time":1274837400000,"local_date":"2010-05-25","local_time":"18:30","updated":1274855011000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":31,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/13364569/","description":"<p>(Note that we moved real-time game/app development event to June)</p> <p>At our <a href=\"http://www.sfandroid.org/calendar/13050451/\">April 27th discussion of Android Tools</a> many of you suggested that we get together for an informal Hacker/Coder session.</p> <p>To quote our member Keith M. Williams, <i>I envision [this session] as a simple way for people to describe what they are building at a deeper level than they can in the general meetup. At this time, so much of Android knowledge appears to reside in inter-personal networks, and this would be an additional way to \"spread the info\"</i>.</p> <p>So, <b>we are looking for 5-15 of you who wish to take 2-20 minutes each and demo your apps/code/design-patterns, or simply ask for suggestions/help with something you don't quite know how to tackle</b>.</p> <p>If you wish to participate (i.e. present/ask questions/etc) let us know via <a href=\"http://www.sfandroid.org/messages/boards/thread/9045330/0/#[masked]\">the following discussion thread</a> or simply come willing to get involved.</p> <p>Since last week's Google I/O was very focused on Android, we can also discuss the highlights of the conference.</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from Technology Credit Union and coffee will be provided by Nicholas Koch from Nestle Taster's Choice. As before, we'll have plenty of interesting give-aways!</p> ","visibility":"public"},{"created":1276836401000,"id":"13837746","name":"Learn how to target all Android devices from Google's own Justin Mattson","rsvp_limit":150,"date_in_series_pattern":false,"status":"past","time":1277861400000,"local_date":"2010-06-29","local_time":"18:30","updated":1280285224000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":90,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/13837746/","manual_attendance_count":65,"description":"<p>Having rescheduled our <a href=\"http://www.sfandroid.org/calendar/13242054/\">real-time app and game development event for July 27th</a> we are super-excited to welcome <b>Justin Mattson from Google</b> who generously offered to fill our June 29th slot!</p> <p>Justin promised not only to re-deliver his <a href=\"http://code.google.com/events/io/2010/sessions/casting-wide-net-android-devices.html\">Google I/O talk titled \"Casting a wide net: how to target all Android devices\"</a>, but also to expand it with the material that he had to cut for time at the I/O. As a bonus, he'll be able to take a lot more questions from the audience! Anyone care to ask about <a href=\"http://arstechnica.com/open-source/news/2010/06/ars-explains-android-fragmentation.ars\">android fragmentation</a>? :-)</p> <p>Here's the description of Justin's presentation:<br/><i>One of Android's strengths is its flexibility to run on a wide variety of devices. In this session, we will explore the facilities the Android resource system provides to developers to make supporting many devices from one application binary easier, as well as common pitfalls. In addition to hardware heterogeneity, more than one version of Android may exist in the wild at any given time. We will go over strategies for providing cross-version compatibility.</i></p> <p>Even though some of you might have already seen Justin's I/O talk (live or on YouTube), you will not want to miss this opportunity to chat with him in person! This event will \"sell-out\" so RSVP soon!</p> <p>Special thanks goes out to Stephanie Liu from Google who helped make this event happen!</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from <a href=\"http://techcu.com/personal/\">Technology Credit Union</a>. As before, we'll be giving away books and other swag to the lucky winners.</p> <p>About Justin Mattson<br/>Justin is a Developer Advocate at Google. For the past two years he has devoted his time to Android. Before that he spent time on some of Google's ads products. He has a strong interest in operating system architectures, macro economics, and advanced armchair physics.</p> ","visibility":"public"},{"created":1271807886000,"id":"13242054","name":"Learn about real-time app and game development on Android","rsvp_limit":170,"date_in_series_pattern":false,"status":"past","time":1280280600000,"local_date":"2010-07-27","local_time":"18:30","updated":1281394379000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":143,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/13242054/","manual_attendance_count":75,"description":"<p><b>(Note this event was originally scheduled for May, then June, but we had to move it to again to July)</b></p> <p>After some delay, we are finally on track to welcome Michael Leahy, the founder of <a href=\"http://www.egrsoftware.com/\">EGR Software</a>, who generously offered to talk about real-time app and game development on Android at our July 27th meetup.</p> <p>In addition to to discussing what you may already know about the state of<a href=\"http://code.google.com/events/io/2009/sessions/WritingRealTimeGamesAndroid.html\"> real-time game development on Android</a>, Michael also plans to cover <a href=\"http://typhon.egrsoftware.com/\">TyphonRT</a>, Android 2D API, and OpenGL 1.x. He even offered to do a follow-up session on OpenGL 2.x - though we yet have to add this to our schedule.</p> <p>Pizzas and drinks for this event will be sponsored by Sarah Samuel from <a href=\"http://www.techcu.com/\">Technology Credit Union</a> and will be giving away Android books from Pearson!</p> ","visibility":"public"},{"created":1281374462000,"id":"14367370","name":"Learn how to build your mobile back-end with MongoDB","rsvp_limit":160,"date_in_series_pattern":false,"status":"past","time":1283304600000,"local_date":"2010-08-31","local_time":"18:30","updated":1283384392000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":76,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/14367370/","manual_attendance_count":37,"description":"<p>Having <a href=\"http://www.sfandroid.org/calendar/14243010/\">postponed our event on mobile-web</a>, we are super-excited to welcome Will Shulman, from MongoLab, who generously offered to fill our August 31st slot and show us how to persist our mobile app data in the cloud using a super-scalable and amazingly developer-friendly <a href=\"http://en.wikipedia.org/wiki/MongoDB\">MongoDB</a> back-end.</p> <p><i>Build your next mobile back-end with MongoDB! MongoDB is one of the fastest growing NoSQL databases and an excellent alternative to MySQL as a server-side backing store for mobile applications. MongoDB's JSON-style storage model and mobile-friendly features (like built-in geo-spatial indexing / search) make it a great tool for mobile developers and a great topic for our Android group. Will Shulman, CEO and co-founder of MongoLab will introduce the group to MongoDB, discuss its applicability to mobile apps, and show us how to use MongoLab's cloud-based data service to make off-device data storage a snap.<br/></i></p> <p>Pizzas/drinks will be sponsored by Imtiaz Hussain from <a href=\"http://www.xcubelabs.com/\">[x]Cube Labs</a>. As before, we'll be giving away books and other swag to the lucky winners.</p> <p>About William Shulman:<br/>Will Shulman is a technologist and entrepreneur with over 13 years of experience building software platforms and products, and has played various executive roles at small and medium sized software companies. Currently he is CEO and co-founder of MongoLab, an exciting new cloud MongoDB provider. Prior to MongoLab Will was the CTO and co-founder of Merced Systems, a growing and profitable enterprise software company with over 500,000 end-users worldwide. Will holds a B.S. degree in Computer Science from Stanford University, where he did undergraduate research in automated theorem proving, distributed database systems, and early semantic-web technologies. Will is also a contributer to the MongoDB Java driver codebase.</p> <p>This event is organized by Marakana, which happens to offer <a href=\"http://marakana.com/training/mongodb/mongodb.html\">MongoDB training courses</a> in partnership with 10gen, the creators of MongoDB.</p> ","visibility":"public"},{"created":1280342046000,"id":"14243010","name":"Check out Samsung Tab, Corona, InMobi, and MoPub","rsvp_limit":170,"date_in_series_pattern":false,"status":"past","time":1285723800000,"local_date":"2010-09-28","local_time":"18:30","updated":1288147603000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":126,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/14243010/","manual_attendance_count":87,"description":"<p>We are postponing our mobile-web-development/PhoneGap presentation originally planned for September 28th until we get a confirmation from the speakers.</p> <p>Instead, we are doing an Android Mixer, with a number of interesting presentations:</p> <p>First up will be Martin Tannerfors and Hod Greeley from Samsung who generously offered to show us <b>Samsung Galaxy Tabs</b> running Froyo (2.2) and discuss some of the best practices of developing apps that are able to take advantage of the tab-form-factor. You'll even be able to test your own apps on the Samsung Tabs Martin and Hod plan to pass around. About 30 mins.</p> <p>Our second speaker will be Eric Herrmann, who also generously offered to do a short demo/presentation on <i>rapid development of native games and apps using <b>Corona SDK</b> and Game Edition. Corona SDK allows cross-compilation to Android and iOS devices from the same source code. All graphics are fully OpenGL accelerated; Android 1.6 through 2.2 are supported; dynamic content scaling permits apps to easily adapt to multiple device resolutions; native UI and hardware support, sqlite, and many multimedia features are incredibly easy to use in Corona. Corona Game Edition, further accelerates game development with the addition of an integrated physics engine, texture-memory optimized sprite sheet support, and more</i>. About 30 mins.</p> <p>Our third speaker will be Gregory Kennedy, who offered to introduce us to <b>InMobi</b> and share interesting information regarding advertising monetization strategies. About 10 minutes.</p> <p>Our final speaker will be James Payne from <b>MoPub</b>, who also offered to introduce us to their cross platform mobile ads serving platform. They <i>want to help developers make more money without sacrificing their user experience</i>. About 10 minutes.</p> <p>As you can tell, this format is different than what we are used to, but it should be a lot of fun nevertheless!</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from <a href=\"http://techcu.com/personal/\">Technology Credit Union</a>. As before, we'll be giving away books and other swag to the lucky winners.</p> ","visibility":"public"},{"created":1285790814000,"id":"14941362","name":"Learn How to Unit Test Your Android Application (with Robolectric)","rsvp_limit":180,"date_in_series_pattern":false,"status":"past","time":1288143000000,"local_date":"2010-10-26","local_time":"18:30","updated":1288206867000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":63,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/14941362/","manual_attendance_count":43,"description":"<p>Did you know that <a href=\"http://en.wikipedia.org/wiki/Do_Androids_Dream_of_Electric_Sheep\">Androids Dream of Robolectric Sheep</a>?<br/>:-)</p> <p><a href=\"http://pivotal.github.com/robolectric/\">Robolectric</a> is an open source Android unit testing framework that makes it possible to run unit tests against your Android application code outside of the emulator - in the IDE. Robolectric gives you the scaffolding to run your tests quickly so you can make fast iterations and refactor your code with confidence.</p> <p>So we are fortunate to welcome Tyler Schultz who generously offered to show us the features of his framework and how to use it. Start test driving your Android applications!</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from <a href=\"http://techcu.com/personal/\">Technology Credit Union</a>. We'll be giving away an unlocked HTC Tattoo as well as other books and swag to the lucky winners.</p> <p>About Tyler Schultz:<br/>Tyler Schultz, a San Francisco resident, works as an Agile Engineer at Pivotal Labs. He's been writing Android applications for the last year, and Java for 10+ years. He strives to unit test the all of the code he writes.</p> ","visibility":"public"},{"created":1287725852000,"id":"15191630","name":"Learn About Android Graphics, Animations & UI tips+tricks directly from Google","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1291169700000,"local_date":"2010-11-30","local_time":"18:15","updated":1296013212000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":192,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/15191630/","description":"<p>For our November 30th event we are super fortunate to have not one, but two extremely distinguished Android engineers from Google share some of their wisdom with us.</p> <p>Romain Guy (who <a href=\"http://www.sfandroid.org/calendar/10405405/\">spoke at our very first event</a>) and Chet Haase (who <a href=\"http://www.sfjava.org/calendar/9809945/\">presented on Flex at SF-JUG</a>) generously offered to give their <a href=\"http://www.devoxx.com/display/Devoxx2K10/Home\">Devoxx 2K10</a> talks at our group. That's right, we get to hear these without having to fly to Belgium.</p> <p><a href=\"http://www.devoxx.com/display/Devoxx2K10/Android+Graphics+and+Animations\">Android Graphics and Animations</a> (1 hour)<br/><i>Come learn about what Android has to offer to help you create compelling visuals and animations. This talk will show you advanced effects and present you what new APIs are coming in these areas.<br/></i></p> <p><a href=\"http://www.devoxx.com/display/Devoxx2K10/Android+UI+Development++Tips%2C+Tricks%2C+and+Techniques\">Android UI Development: Tips, Tricks, and Techniques</a> (1 hour)<br/><i>Join Romain Guy and Chet Haase from the Android UI Toolkit team at Google as they talk about approaches for developing more effective user interfaces in Android applications. From performance to widgets to layout to animations, you'll learn tons of top techniques that will make your UIs totally terrific.</i></p> <p>Do I have to say that you do not want to miss this event? I will be surprised if we don't \"sell out\" quickly, so RSVP sooner, rather than later. You've been warned :-)</p> <p>Pizzas/drinks will be sponsored by the folks at <a href=\"http://developer.motorola.com/\">Motorola</a>. We'll be giving away an unlocked HTC Tattoo as well as other books and swag to the lucky winners.</p> <p>About Romain Guy:<br/>Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.</p> <p>About Chet Haase:<br/>Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.<br/>Chet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics.<br/>Chet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK.<br/>Chet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.<br/>Finally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at <a href=\"http://chetchat.blogspot.com\"><a href=\"http://chetchat.blogs\" class=\"linkified\">http://chetchat.blogs</a>...</a>.</p> ","visibility":"public"},{"created":1287775812000,"id":"15196582","name":"Beginning Android Flash Development","rsvp_limit":180,"date_in_series_pattern":false,"status":"past","time":1296009000000,"local_date":"2011-01-25","local_time":"18:30","updated":1298515331000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":139,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/15196582/","description":"<p>We are scheduling our December event earlier in the month than usual (on the 9th), so that we can all enjoy the holidays.</p> <p>And our treat for the holidays is to learn about how we can re-purpose our Flash/Flex skills and develop amazing eye-candy-like apps for the Android platform, now that Flash Player 10.1 and AIR for Android are out. The range of devices that we can target and deploy Flash on has grown significantly.</p> <p>Learn from Stephen Chin and Oswald Campesato, the co-authors of the upcoming <a href=\"http://proandroidflash.com/\">Pro Android Flash book</a>, how to write applications for the Android platform using Flash and Flex technologies. End to end samples in both Flash Professional and Flash Builder will be demonstrated on device.</p> <p>This event is organized by Marakana, which specializes in providing training on open source software.</p> <p><b>About Marakana:</b><br/>Marakana's raison d'être is to help people get better at what they do professionally. They accomplish this by organizing <a href=\"http://marakana.com/\">software training courses</a> (both public and private) as well as supporting the <a href=\"http://marakana.com/usergroups.html\">open-source community</a> and publishing <a href=\"http://marakana.com/forums/blog/\">useful learning resources</a>. Our focus is open source software. See what else is going on in the world of Marakana by checking out their <a href=\"http://marakana.com/\">website</a>.</p> <p>Pizzas/drinks will be sponsored by Sarah Samuel from <a href=\"http://techcu.com/personal/\">Technology Credit Union</a>. We'll be giving away books and other swag to the lucky winners.</p> ","visibility":"public"},{"created":1298083053000,"id":"16620208","name":"Free tickets for SF New Tech on Wed Feb 23 in San Francisco for your resume","date_in_series_pattern":false,"status":"past","time":1298511000000,"local_date":"2011-02-23","local_time":"17:30","updated":1298572147000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":16,"venue":{"id":415485,"name":"Mighty","lat":37.768184661865234,"lon":-122.40679168701172,"repinned":false,"address_1":"119 Utah","address_2":"@ 15th Street","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"415-626-7001","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/16620208/","why":"SKOUT is hiring--if you rock, let's talk. Shoot your resume to jobs@skout.com. If you are among the first 5, you get in free & we buy you beer! Meet Christian Wiklund (CEO) and Andreas Weigend (board). If we hire someone you refer, you get $2500.","visibility":"public"},{"created":1297847153000,"id":"16584764","name":"Learn about Android Cloud to Device Messaging (C2DM) Framework","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1301446800000,"local_date":"2011-03-29","local_time":"18:00","updated":1301544609000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":136,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/16584764/","why":"C2DM Rocks and Google asked us to postpone our original presentation on Google TV!","manual_attendance_count":73,"description":"<p><b>Update (3/23/2011)</b>: It seems that our eagerness to learn more about Google TV was a bit premature as Google has asked us to postpone Dimitris' presentation until more info on the future direction of GTV is released to the public. I understand that this may come as a disappointment to many of you, but I guess we'll just have to be patient a while longer :-(</p> <p>So, given the last-minute change of plans on this event, I decided to step up a give <b>a talk on Android Cloud to Device Messaging (C2DM) framework</b>, which I recently delivered at <a href=\"http://www.andevcon.com/classes.html\">AnDevCon</a> (<a href=\"http://marakana.com/forums/android/general/272.html\">C2DM slides + screencast available</a>). Rather than just recycle what I did then, I'll have more time to dive into the details, show you a working demo, step through the code, and answer more questions :-)</p> <p>So, here is what you'll learn if you come:</p> <p><i>While many people agree that Android's 2.2 release was a major milestone in its evolutionary path, one of the most important features is yet waiting to be discovered: C2DM.</p> <p>The Android Cloud to Device Messaging framework, which was first introduced at Google I/O 2010, has the potential to enable a whole new breed of applications for the platform. In a nutshell, C2DM makes it possible for developers to <b>push data</b> from their servers to their applications on Android devices.</p> <p>C2DM is a relatively simple and light-weight messaging technology that transcends carriers' networks and allows innovative ways to connect with our users - all without having to drain batteries on their phones or waste wireless data, which is what we were forced to do with pull/polling-based approaches.</p> <p>In this session you will learn about C2DM, the protocol, its requirements, its limitations, and how to get started in building applications that take advantage this amazing framework. You will get to see a complete end-to-end application (both the Android-client and its server-side counterpart) and understand how all of the pieces fit together.</i></p> <p>Also, many of you suggested that we should do more to <b>make our events a bit more social </b>(e.g. allow folks to present their apps, ask for help, team up on interesting projects, etc.). If you would like to brainstorm on how we can best do this, or would simply like to be a part of this effort, I invite you to come a bit earlier (<b>6pm</b>) so that we can create a battle plan for our future events.</p> <p>As before, we'll be giving away books and swag at the end of the evening. Food and drinks will be provided by Apex Systems.</p> <p> </p> <p>About Aleksandar (Saša) Gargenta:</p> <p>Aleksandar (Saša) Gargenta is the technology brains at <a href=\"http://marakana.com/\">Marakana</a>. Always on top of the latest in software, Aleksandar is company's radar for technology that matters. His latest ventures are perfecting Marakana's Android Internals and Security courses.</p> <p>As an Android and Java expert, Aleksandar is the author of Marakana's Java, Advanced Java, Android Security, Spring/Hibernate, JBoss, Apache, XML/XSL, and JUnit/TestNG training courses. Phew. And if that's not enough, he's also the chief architect of Marakana Spark, the on-demand software platform that powers marakana.com and a number of other training companies. As an instructor he's taught hundreds of classes for everyone from Apple to Disney, from NASA to the Department of Defense.</p> <p>In his spare time Aleksandar runs the San Francisco <a href=\"http://www.sfjava.org/\">Java</a>, <a href=\"http://www.sfandroid.org/\">Android</a>, and <a href=\"http://www.sfhtml5.org/\">HTML5</a> User Groups with over five thousand members across the three groups.</p> <p>Aleksandar holds a bachelor’s degree in Mathematics and Computer Science from the University of Waterloo.</p> ","visibility":"public"},{"created":1302021463000,"id":"17192126","name":"Developing for Android, iOS, and Windows Phone 7 – learn what it takes!","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1304555400000,"local_date":"2011-05-04","local_time":"17:30","updated":1308104406000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":187,"venue":{"id":1116861,"name":"Microsoft - San Francisco","lat":37.785545349121094,"lon":-122.40608978271484,"repinned":false,"address_1":"835 Market Street","address_2":"7th floor / Golden Gate room","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/17192126/","why":"For those of us who are just starting to get into mobile development, or have simply been too ignorant of other platforms, this event will contrast the motivation and approaches for getting started with Android, iOS, and WP7 development","description":"<p><b>Update: Date changed from April 26th (our regular meeting time) to May 4th - to avoid conflicting with <a href=\"http://www.meetup.com/javascript-9/events/17064537/\">SV JavaScript event on HTML5</a>.</b></p> <p>This is <i>slightly</i> different than what we are used to... and you are going to like it :-)</p> <p>We are joining forces with a number of local communities (<a href=\"http://www.sfjava.org/events/17369330/\">Java</a>, <a href=\"http://www.sfphp.org/events/17280114/\">PHP</a>, <a href=\"http://www.sfhtml5.org/events/17382201/\">HTML5</a>, .Net, iOS, etc.) to put together an event with <b>four expert speakers</b> showcasing what it takes to develop for <b>Android</b>, <b>iOS</b>, and <b>Windows Phone 7</b>.</p> <p>This will be a perfect opportunity to check out the mobile landscape, whether you are just getting into mobile, or simply want to see what the \"competition\" is up to.</p> <p>Here is the rough agenda for the evening:</p> <p>5:30pm-6:15pm: Arrive and mingle (enjoy free food and drinks)<br/>6:15pm-6:30pm: Announcements<br/>6:30pm-7:15pm: Larry Lieberman on <i>Developing for WP7</i><br/>7:15pm-7:30pm: Break<br/>7:30pm-8:15pm: Frank Maker on <i>Developing for Android</i><br/>8:15pm-8:30pm: Break<br/>8:30pm-9:15pm: Alain \"Lino\" Tadros and Lance C. Bullock on <i>Developing for iOS</i><br/>9:15pm-9:30pm: Wrap-up and give-aways</p> <p>You don't want to miss this one. In fact, invite your friends as well, if you want to get them excited about mobile! But hurry, as <b>this event will sell out</b>. </p> <p>Food, drinks, and give-aways are provided by our sponsors!</p> <p>Please note that <b>this event is hosted by Microsoft</b>, at 835 Market Street (next to Westfield Mall). Thanks Bruno Terkaly!</p> <p> </p> <p>About Frank Maker (Founder, Handy Codeworks LLC)</p> <p>Frank is a Ph.D. candidate at the University of California, Davis concentrating on Embedded Software and Systems. Since its introduction, he has been doing systems research with Android on automatic low power adaptation techniques. He has worked various fortune 500 embedded systems companies such as Broadcom, Motorola and BMW. He also owns his own consulting firm, <a href=\"http://www.handycodeworks.com\">Handy Codeworks</a>, which offers technical services for Andoid systems software and Android training for <a href=\"http://marakana.com/\">Marakana</a>. Professionally he enjoys embedded Linux/Android systems hacking and the occasional hardware project. In his spare time he spends time with his wonderful wife, baby daughter and dog.</p> <p> </p> <p>About Alain \"Lino\" Tadros (Chairman &amp; CEO, Falafel Software):</p> <p>Alain \"Lino\" Tadros is Chairman &amp; CEO of Falafel Software, a Silicon Valley based company, with presence in Colorado and Texas, dedicated to providing world-class consulting, training, and software development for small, medium, and enterprise level businesses. Prior to founding Falafel, Lino was a member of the development team at Borland for Delphi and C++Builder. Mr. Tadros has been awarded Microsoft MVP status eight years in a row (2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011) for his numerous contributions to the C# community and is an expert in .NET, LINQ, ASP.NET, COM, and Web Services. Tadros is an industry renowned speaker and has given numerous presentations on 5 different continents since 1994. He also currently sits on the Board of Directors of 4 Silicon Valley corporations.</p> <p> </p> <p>About Lance C. Bullock (Director of Mobile Solutions, Falafel Software):</p> <p>Lance has over 20 years’ experience leading teams, architecting, and developing enterprise-level solutions for some of the world’s largest corporations. Prior to joining the Falafel team, Lance served as a Group Manager at Check Point Software Technologies. As a leader and engineer, he was responsible for scalability, performance, feature development, federation/clustering, and protocol work on the Check Point Endpoint Security Secure Access Server; which managed tens of thousands of desktop security installations. Prior to Check Point, Lance was CTO/Vice President of Technology at Full Moon Interactive and .class Corporation, where he was a recognized industry expert in Delphi, JBuilder, and Windows development; as well as a speaker, author, and trainer. Lance holds a B.S. in Computer Science/Mathematics from California State University Sacramento. In his spare time, Lance can usually be found at some random Bay Area sports venue, watching his sons in their various athletic pursuits.</p> <p> </p> <p>About Larry Lieberman (Sr. Product Manager, Microsoft):</p> <p>Larry Lieberman is a Sr. Product Manager for the Windows Phone Application Platform. He's responsible for coordinating the creation and delivery of all the official developer educational documentation, labs, videos, and session content you see published by Microsoft, on developing applications and games for Windows phone. He's worked at Microsoft since 1998, and on Mobile specifically since 2003.</p> ","how_to_find_us":"Suite 700","visibility":"public"},{"created":1285799852000,"id":"16257543","name":"Collaborative Android projects -- finding others with complementary talents","date_in_series_pattern":false,"status":"past","time":1308103200000,"local_date":"2011-06-14","local_time":"19:00","updated":1308459327000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":228,"venue":{"id":1529496,"name":"IGN Entertainment, Inc.","lat":37.78145217895508,"lon":-122.39131164550781,"repinned":false,"address_1":"625 2nd Street","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94107","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/16257543/","description":"<p>Less than week till the event....get your presentations ready, even if it is just a one minute introduction!  Read on for more....</p> <p>For this to work, we need people to get up and introduce themselves to the group and talk for a bit -- hopefully, lots of people.  There will be plenty of time after the presentations to follow up with presenters. The short presentations can be any of the following:</p> <p>You're hoping to start an android commercial venture, and are looking for partners with complementary talents. You're hoping to start an android open source project, and are looking for collaborators. You have a technical issue you're working on that might be of general interest, and would like to find others with insights on the issue. You've written some code (free or open source) that others may find generally useful, and you want to demo it. You just want to introduce yourself and say what kind of things you do or are interested in doing.<br/>If you want to talk for more than a minute, please do your best to polish your presentation.  Graphics are great, but if you really need to show an app running in an emulator, you can do that.  For most people, I suggest putting things together in a web page, pdf, or google docs -- so it is easy to load onto the demo computer, and you can show images, screen shots, source code, etc.  And of course, rehearse what you are going to say, and try to avoid rambling on too much. :)</p> <p>We'll allow presentations up to ten minutes, but the longer they are, the more we expect you to have done your homework (that is, made slides/graphics, practiced your talk, etc).  If you have a decent laptop, we can probably hook it to the projector. (we're working on that now)</p> <p>If you have questions or want to be involved in organizing, please email me (Rob) at rjbrown at gmail.</p> <p> --------------------------------------------------------</p> <p>(here's the original idea as posted 6 months ago)</p> <p>Most of the event could consist of short (&lt; 10 minute) pitches by those who are looking to join forces with others, whether for fun, or with entrepreneurial aspirations. The idea being to find collaborators who have complementary skills and interests, and are interested in working together to build and release Android apps (or developing some other Android-oriented project or business). Presenters could pitch their ideas, talk about what skills and time commitment they have to offer, what they are looking for in others, etc. Presenters should probably try to have something visual to show, such any work they have already done. (powerpoint? prototype app?)</p> <p>There might also be a couple longer presentations on the \"how\" of forming and organizing a collaborative project that could become a company, if anyone with appropriate experience volunteers for that.</p> <p>Even if you are not interested in going entrepreneurial, it might be fun to see the ideas others are exploring.</p> ","visibility":"public"},{"created":1301434686000,"id":"17106322","name":"Learn about 3D with Renderscript from Roman Guy and Chet Haase","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1309311000000,"local_date":"2011-06-28","local_time":"18:30","updated":1309471789000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":126,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/17106322/","why":"Android Renderscript rocks!","manual_attendance_count":67,"description":"<p>They are back! Yes, the same duo from Google that presented on <a href=\"http://www.sfandroid.org/events/15191630/\">Android Graphics, Animations &amp; UI tips+tricks back in November '10</a>, generously offered to share their wisdom on the new and super-sexy <a href=\"http://developer.android.com/guide/topics/graphics/renderscript.html\">Android Renderscript</a> (ok, it's not \"new\", but it's finally made public)!</p> <p>Hot off the Honeycomb press, the Renderscript system offers <i>high performance 3D rendering and mathematical computation at the native level</i>. Wanna see it for yourself? Just check out the page-turn animations in Google Books app on your [friend's] Xoom tablet. Pretty impressive!</p> <p>Well, we are extremely fortunate to have Romain Guy and Chet Haase, the gods of everything Android-UI, come show us how we can start taking advantage of this amazing technology.</p> <p>As always, food, drinks, giveaways will be provided by our sponsors!</p> <p> </p> <p>About Romain Guy:<br/>Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.</p> <p>About Chet Haase:<br/>Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.<br/>Chet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics.<br/>Chet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK.<br/>Chet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.<br/>Finally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at <a href=\"http://chetchat.blogspot.com/\"><a href=\"http://chetchat.blogs\" class=\"linkified\">http://chetchat.blogs</a>...</a>.</p> ","visibility":"public"},{"created":1309564136000,"id":"24284311","name":"Lightning talks and mini-presentations","rsvp_limit":225,"date_in_series_pattern":false,"status":"past","time":1311730200000,"local_date":"2011-07-26","local_time":"18:30","updated":1311791326000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":79,"venue":{"id":1131487,"name":"SUPINFO International University","lat":37.80630111694336,"lon":-122.42046356201172,"repinned":false,"address_1":"2738 Hyde St","address_2":"Suite 100","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"(415) 441-1070","zip":"94109","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/24284311/","description":"<p>As a follow up to the <a href=\"http://www.sfandroid.org/events/16257543/\">June 14th meetup</a> that Rob Brown put together, we thought it would be great to do another \"social\" event... to give us an opportunity to meet each other and see what are SF Android techies up to.</p> <p>So, if you are interested in presenting on something near-and-dear to you that is related to Android, then this is your shot at the podium.</p> <p>Use <a href=\"http://www.sfandroid.org/messages/boards/thread/13166681/\">this discussion thread</a> to reserve your spot for a lightning talk or a mini presentation.</p> <p>You just need to provide us with four pieces of info:</p> <p>1) A short title of your mini-presentation</p> <p>2) A short summary of what you plan to talk about</p> <p>3) An expected duration of your talk (rounded to 5 minute increments)</p> <p>4) A short blurb about yourself (bio)</p> <p> </p> <p>Here is a taste of what you can expect for this evening:</p> <p>'Start with a prototype' in mobile app projects <br/>  by Xavier Renom Portet, founder of Justinmind<br/><i>Why it's useful for mobile app developers to start with a hi-fi prototype and explain more about 'instant simulation' and 'simulation with real data'</i></p> <p>How to Make Money With Android Apps Through Mobile Advertising<br/>  by Gregory Kennedy, head of InMobi's Developer Community<br/><i>We use data from the InMobi network to show what is required to make money through advertising. A economic model in Excel is provided so developer can estimate their earnings</i></p> <p><i><br/></i> Android Real-time Bidirectional JSON Broadcasting<br/>by Stephen Blum, founder of PubNub<br/><i>How to use PubNub to send notifications and receive notifications on Android. It's only 2 functions so it's easy to explain quickly.</p> <p></i> HearPlanet's geo referenced audio discovery and sharing platform for Android (and other) mobile devices <br/>by Steven Echtman, CEO of HearPlanet<br/><i>We will demonstrate HearPlanet's platform, from creating geo referenced content on the web or mobile device, to distribution to mobile devices as well as sharing content with others. We will aslo discuss how developers can use the HearPlanet API to include Geo Referenced Audio content in their apps.</p> <p></i> Distribution / Monetization -- what works, what doesn't<br/>by Kate Zhang, Business Development at Tapjoy<br/><i>Provide some data on what Tapjoy has seen regarding Distribution/Monetization</i></p> <p> </p> <p>As always, food, drinks, and giveaways will be provided by our sponsors.</p> ","visibility":"public"},{"created":1310262705000,"id":"25177751","name":"How to Build Killer Apps for 4G/LTE Networks","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1314752400000,"local_date":"2011-08-30","local_time":"18:00","updated":1317174863000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":185,"venue":{"id":2713121,"name":"Square","lat":37.78179168701172,"lon":-122.4061050415039,"repinned":false,"address_1":"110 5th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/25177751/","manual_attendance_count":100,"description":"<p>Every once in a while a new technology changes the game. Some benefit from it while other fail to adapt. <a href=\"http://en.wikipedia.org/wiki/3GPP_Long_Term_Evolution\">Long Term Evolution</a>, or LTE for short, is on surface just yet another fast wireless standard bringing us faster mobile networking. But just like the freeway was much more than just a faster road, LTE actually has a chance to change the rules for app developers and create new possibilities.</p> <p>In this talk,  you will learn what LTE is. We will explore it from application developer's point of view. By the end of the talk, you should be able to identify the opportunities for new applications as well as how to take advantage of new capabilities in your existing apps.</p> <p>We will talk about why you'd care about 4G, how to leverage it in your apps, how to manage for mixed networks, how to speed things up, how to use sessions effectively, and how to future-proof your apps.</p> <p>As always, food, drinks, and giveaways will be provided by our sponsors.</p> <p>Note that this event is taking place at Square (110 5th St @ Mission) thanks to our new host, Bob Lee!</p> <p> </p> <p><b>About Marko Gargenta</b></p> <p>Marko founded  <a href=\"http://marakana.com/\"> Marakana</a>  back in 2001 to help underprivileged youth, minorities, and inner-city kids learn web technologies and get ahead in life. So Marakana emerged with goal of  <b>helping people get better at what they do professionally</b>, focused on open source software training. Marko is also the author of  <a href=\"http://oreilly.com/catalog/0636920010883\"> Learning Android</a>  book published by O'Reilly Media. This book is based on Android Bootcamp and incorporates best learning practices for new developers to start creating applications for this exciting open source mobile platform. <i> <a href=\"http://marakana.com/expert/marko_gargenta,2.html\">More about Marko.</a></i></p> <p><b>About Alex Gaber</b></p> <p>Alex Gaber, Alcatel-Lucent Technical Evangelist, Application Enablement Platform.  Alex brings a wealth of technical expertise in cross-platform mobile app development, web development, API enabled platforms, and software development tools.  His focus at Alcatel Lucent is to promote the adoption of APIs of Service Providers who utilize 2G,3G and 4G LTE technologies globally, and assist the developer community with best practices for application integration. Alex was most recently with Rhomobile, a leading cross platform framework for iOS, Android, Blackberry and Windows Phone 7 applications.  Prior to that he was with Mashery, one of the earliest entrants in the Cloud and API Management infrastructure industry.  He has also held an executive role at TechExcel, a leader in software development tools (SDLC / ALM), where he managed major development process transformations at clients such as Motorola and John Deere.  Earlier, Alex was a Strategy Consultant with Keystone Strategy, working with Harvard Business School professors to advise Microsoft on their developer ecosystem strategy.</p> <p> </p> <p><b><br/></b></p> ","visibility":"public"},{"created":1312584452000,"id":"28425231","name":"Cleaner APIs, Cleaner UIs with Visage Android","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1317173400000,"local_date":"2011-09-27","local_time":"18:30","updated":1319595366000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":158,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/28425231/","manual_attendance_count":65,"description":"<p>Steve Chin is back! First he showed us how to <a href=\"http://www.sfandroid.org/events/15196582/\">leverage our Flash/Flex skills on Android</a>, now he is going to teach us how to write cleaner UIs using an Android domain specific language called Visage.</p> <p><a href=\"http://code.google.com/p/visage/\">Visage</a> is the successor to the JavaFX Script Language, a DSL for writing UIs. It excels at rapid application design and can be used on any platform that supports Java.</p> <p>In this session you will learn how to supercharge your Android development by using Visage to create declarative UIs. Visage Android exposes the full set of Android APIs, allows you to mix Java and Visage code in the same application, and generates code that deploys to and runs on Android mobile devices.</p> <p>As always, food/drinks/giveaways will be provided by our sponsors.</p> <p>Note that this event will take place at Square (110 5th St @ Mission).</p> <p> </p> <p>About Stephen Chin</p> <p>Stephen Chin is a technical expert in RIA technologies, and Chief Agile Methodologist at GXS. He coauthored the Apress Pro JavaFX Platform title, which is the current leading technical reference for JavaFX, and is lead author of Pro Android Flash. In addition, Stephen runs the Silicon Valley JavaFX User Group and the Flash on Devices User Group. Finally, he is a Java Champion, co-chair at OSCON JAVA, and an internationally recognized speaker featured at Devoxx, Jazoon, and JavaOne, where he received a Rock Star Award. Stephen can be followed on twitter @steveonjava and reached via his blog: <a href=\"http://steveonjava.com/\" class=\"linkified\">http://steveonjava.com/</a></p> ","visibility":"public"},{"created":1314004062000,"id":"30397751","name":"Taming Android UIs","rsvp_limit":220,"date_in_series_pattern":false,"status":"past","time":1319590800000,"local_date":"2011-10-25","local_time":"18:00","updated":1322622899000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":219,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/30397751/","manual_attendance_count":107,"description":"<p>Android isn't known for beautiful UIs, but you can fix this. In this month's talk, Eric Burke shows how Square customizes every aspect of the UI to create delightful user experiences. Through real code taken directly from Square, we'll see how to create custom views that defy expectations.</p> <p>As always, expect awesome food, drinks, giveaways from our sponsors.</p> <p>Please note the <b>change of venue</b>: this event will take place at StackMob (541 8th St, San Francisco, CA).</p> <p> </p> <p>About Eric Burke<br/>Eric Burke is the Android lead with Square. He's used Java since version 1.0 and has always enjoyed UI development. He is on Twitter at @burke_eric and can be reached at [masked].</p> ","visibility":"public"},{"created":1319698288000,"id":"38897002","name":"Learn about Ice Cream Sandwich (Android 4.0) from Romain Guy and Chet Haase","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1322618400000,"local_date":"2011-11-29","local_time":"18:00","updated":1323831951000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":200,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/38897002/","manual_attendance_count":142,"description":"<p>And they are back! Yet again :-)</p> <p>For our November 29th event, Romain Guy and Chet Haase (from Google) generously offered to introduce us to the highly anticipated <a href=\"http://developer.android.com/sdk/android-4.0-highlights.html\">Android 4.0 release (a.k.a. Ice Cream Sandwich)</a> and cover some of the new APIs! Enough said! RSVP soon if you want to reserve your spot!</p> <p>(Hopefully, <a href=\"http://www.google.com/nexus/\">Galaxy Nexus</a> will be out by the 29th, so we'll have some devices to play with)</p> <p>The rough agenda for the evening looks like this:</p> <p>6:00-6:45pm: Arrive and mingle (light dinner)<br/>6:45-7:00pm: Announcements and introductions<br/>7:00-8:45pm: Romain Guy and Chet Haase on ICS/Android 4.0! <br/>8:45-9:00pm: Wrap-up and giveaways! </p> <p>As always, food, drinks, giveaways are provided by our sponsors!</p> <p> </p> <p>About Romain Guy:<br/>Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.</p> <p>About Chet Haase:<br/>Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.<br/>Chet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics. Chet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK. Chet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.<br/>Finally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at <a href=\"http://chetchat.blogspot.com/\" class=\"linkified\">http://chetchat.blogspot.com/</a>.</p> ","visibility":"public"},{"created":1320693797000,"id":"40298882","name":"10 Million Users: Lessons Learned and How to Prepare Your App for Growth","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1323828000000,"local_date":"2011-12-13","local_time":"18:00","updated":1328065053000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":215,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/40298882/","manual_attendance_count":72,"description":"<p>For this meetup, we are really happy to welcome Edith Yueng from <a href=\"http://www.dolphin-browser.com/about\">MoboTab</a> (the makers of <a href=\"https://market.android.com/details?id=mobi.mgeek.TunnyBrowser&amp;hl=en\">Dolphin Browser</a>) come and share some of their secret sauce with us.</p> <p><i>In this talk, we will discuss how we built Dolphin Browser, the No. 1 third-party browser on the Android platform, what lessons we've learned in building the browser, optimizing it for user growth, pain points of scale and device proliferation. After the talk, you will come away with a superior understanding of what goes into the making of a highly successful Android app as well as some tips on app development from first-hand sources who know what they're talking about.</i></p> <p><i><br/></i></p> <p>As a bonus presentation, Don Cowan from MarketImpacts.com, offered to share his latest research on <b>Android Market Search Results Ranking:</b></p> <p><i>In mid 2011, Google made a series of significant changes to the Android Market, including how search results are rank ordered.  This had a significant impact on the visibility of many apps and caused a heated exchange of opinions on the Android Market Forum.  During these events, MarketImpacts.com was releasing a suite of apps with a variety of app names.  This gave the company the opportunity to develop key insights into market rank order factors.  Don Cowan will present their findings and lead a discussion with attendees.</i></p> <p> </p> <p>As always, food, drinks and giveaways will be provided by our sponsors!</p> <p> </p> <p>The rough agenda for this event looks like this:</p> <p>6:00-6:50pm: Arrive and mingle<br/>6:50-7:00pm: Announcements<br/>7:00-8:45pm: Presentations<br/>8:45-9:00pm: Wrap-up and give-aways </p> <p> </p> <p>About Edith Yueng:<br/>Edith is the head of marketing for Dolphin Browser and a founding partner at RightVentures. Her focus is on mobile and consumer Internet companies. Prior to her current role, Edith founded BizTechDay, a voice of news, events &amp; research for small business, mobile and Chinese technology. She previously worked with AT&amp;T Wireless, Oracle, Siebel, Autodesk, Cisco, Telstra and Hungary Telecom. Edith has appeared on CBS, NPR and in the Wall Street Journal and is frequently quoted in ReadWriteWeb, Small Business Trends and other tech and SMB publications. She also often speaks on mobile, women and international entrepreneurship.</p> <p>About Don Cowan:<br/>Don Cowan is an Android application developer with a history of pioneering work in a number of computing and telecommunications technologies.  He has most recently developed a suite of apps for the Android market.  Don was product manager for the first commercial release of the UNIX operating system and C programming language while working for AT&amp;T.  He implemented the first large scale packet switched local area network in AT&amp;T and was a leader in the development of a variety of software tools.  Don has worked internationally in a number of countries including Brazil, the Netherlands, Germany, Japan and South Africa.  Don is currently the Director of Software Engineering for MarketImpacts.com.</p> ","visibility":"public"},{"created":1321256942000,"id":"41078342","name":"The Big Picture: Learn how to develop apps for Google TV","rsvp_limit":300,"date_in_series_pattern":false,"status":"past","time":1328061600000,"local_date":"2012-01-31","local_time":"18:00","updated":1330485477000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":278,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/41078342/","manual_attendance_count":187,"description":"<p>For our January 31st event, we are extremely happy to have Christian Kurzke from Google TV team talk to us about the latest (Honeycomb) release of the platform.</p> <p><i>First phones. Then tablets. Now TVs. Your Android app can run on all of them... if you write it carefully and follow the rules. Christian's presentation will explore what those techniques are, plus what TV-specific capabilities your application can ruthlessly exploit to your (and your users) advantage.</i></p> <p>Food and drinks will be provided by the <a href=\"https://events.linuxfoundation.org/events/android-builders-summit\">Linux Foundation</a>. Be sure to stick around until the end for your chance at some cool giveaways from our sponsors. </p> <p> </p> <p>About Christian Kurzke:<br/>Christian is Developer Advocate for Google TV. He is also an open source enthusiast, committer in the Eclipse Foundation and has been working at the intersection of Linux and Java since the early 90s. Prior to Google, Christian worked in Motorola's Mobile Phone and Set-Top Box divisions. Before that, Christian was at SUN working on Java for Embedded Systems. He holds a Dipl. Inf. degree from University Erlangen, Germany, and an MBA from Santa Clara University. Follow him at @Cnkurzke.</p> ","visibility":"public"},{"created":1324175380000,"id":"44785082","name":"Wearable Android: Coming to a Wrist Near You","rsvp_limit":350,"date_in_series_pattern":false,"status":"past","time":1330480800000,"local_date":"2012-02-28","local_time":"18:00","updated":1332900838000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":277,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/44785082/","description":"<p>What do you get when you shrink Android down into a 32×36×12.5mm water-resistent <a href=\"http://www.wimm.com/platform-technology.html\">package</a> weighing only 22g, yet you manage to cram a capacitive touch screen, WiFi, Bluetooth, a bunch of sensors, and up to 32GB of storage? You get the latest in wearable computing, powered by your favorite OS*.</p> <p>At this event, you'll hear from Ted Ladd, who comes to us from <a href=\"http://www.wimm.com/\">WiMM Labs</a> (the creators of this amazing platform), and you'll learn about what happens when you put Android on a wrist near you. Oh, and you'll also get a chance to win one of these puppies!</p> <p><img src=\"http://www.wimm.com/images/wimmone_preloaded_apps.png\" /><i>In the last few months, several companies have announced and launched wearable products with a variety of different hardware and software specs, price points, target segments, and different business models. This session will talk about the primary uses cases for wearable technology, and then dive into the details of the WIMM platform from WIMM Labs (www.WIMM.com), which combines hardware, Android software, and web services to provide subtle, glanceable micro-experiences. With its investor and partner Foxconn, the largest manufacturer of consumer electronics in the world, WIMM Labs licenses the platform to consumer brands to quickly customized and deliver wearable products to their own channel. We'll have several devices to demo and give away.</i></p> <p>As always, venu, food, drinks, and giveaways will be provided by our sponsors!</p> <p>The rough agenda for the evening looks like this:</p> <p>6:00pm-6:25pm: Arrive and mingle<br/>6:25pm-6:30pm: Announcements<br/>6:30pm-8:00pm: Ted Ladd on Wearable Android<br/>8:00pm-8:20pm: Wrap-up and giveaways! </p> <p>Based on your comments from our last event, we moved the presentation start time from 7:00pm to 6:30pm! Make sure that you arrive early to grab your seat as we expect a full house.</p> <p> </p> <p>About Ted Ladd<br/>Ted Ladd is the Director of Developer Relations for WIMM Labs. Ted was the first platform evangelist at Palm Inc, introducing developers and partners to mobile computing. He holds an MBA from Wharton, an MA in international economics from Johns Hopkins, a BA from Cornell, and a certificate from the Oklahoma Horseshoeing School. He is addicted to gadgets, chocolate, and trail running. Unfortunately, they do not cancel each other out.</p> <p> </p> <p>* While the WiMM platform is based on Android, it does not qualify fully as <a href=\"http://source.android.com/compatibility/index.html\">Android-compatible</a>, mostly due to its unique form-factor (and business model).</p> ","visibility":"public"},{"created":1330990356000,"id":"55122342","name":"Touch Based Authentication Interfaces/Systems plus Lightning Talks","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1332896400000,"local_date":"2012-03-27","local_time":"18:00","updated":1332967104000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":116,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/55122342/","manual_attendance_count":35,"description":"<p>Hate typing passwords on smartphone? Everyone does! Passwords/PINS have been the primary method of access control and authentication on computers for long time. Even though technology has evolved towards touch based and natural UI’s; passwords have remained the same. With the rise of smartphones and tablets, entering passwords has become even harder. All the major mobile OSes provide pattern/gesture based screen unlock features (e.g. pattern lock in android and picture passwords in Windows phone). The same can be extended to many more use-cases such as login, two-factor authentication, transaction verification, device authorization etc.</p> <p>Satish Polisetti on Dhawal Mujumdar offered to:</p> <p>Introduce the problems of passwords/pins and conventional two-factor authentication devices (hardware tokens etc) in the post-pc era Briefly discuss and compare security of different touch interfaces Demonstrate a beta stage mobile SDK which will enable app developers to integrate two-factor authentication and user management functions into their applicationsd. Open discussion with developer community - to seek feedback and learn other problems they face with user/device management Here is the rough agenda for the evening:</p> <p>6:00-6:25pm: Arrive and mingle (food and drinks provided)<br/>6:25-6:30pm: Announcements<br/>6:30-7:00pm: <a href=\"http://en.wikipedia.org/wiki/Lightning_talk\">Lightning talks</a><br/>7:00-7:30pm: Satish and Dhawal on touch-based authentication<br/>7:30-8:00pm: Q&amp;A, wrap-up and giveaways</p> <p>About Satish Polisetti &amp; Dhawal Mujumdar<br/>Satish Polisetti &amp; Dhawal Mujumdar are recent graduates from UC Berkeley, School of Information. Their focus and research are in user-experience &amp; security. They founded a company (Picatcha) which builds image-identification CAPTCHAs to address the poor user-experience and low security of traditional text-CAPTCHAs. The product is currently live on 200+ websites with a monthly traffic of ~ 2 Million impressions.  The customer base include some big FMCG brands like M&amp;M/Mars in the US for protecting their sweepstakes &amp; polls from fraud and abuse. </p> <p>Satish &amp; Dhawal may be joined by Daniele Perito who is a Post-Doc from UC Berkeley, Security Group. His research interests include networks and systems security, machine learning, embedded system security etc. He has a PhD in Computer Science from INRIA, France with more than 11 publications in the security domain. He was part of the team which broke audio CAPTCHAs on famous websites like eBay, Yahoo and his work was covered in major tech blogs. He is a regular invited speaker for security events at Symantec. </p> ","visibility":"public"},{"created":1332439426000,"id":"57434952","name":"HTC on compatibility best practices and how to avoid vendor lock-in","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1335315600000,"local_date":"2012-04-24","local_time":"18:00","updated":1335736675000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":199,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/57434952/","description":"<p>For our April meetup, we are happy to welcome Dario Laverde, from the HTCdev team, who offered to tell us about HTC OpenSense SDK - and what it really means for the Android developer.</p> <p><i>HTC is updating it's OpenSense SDK with additional APIs announced at Mobile World Congress. This includes a new lock screen API, new common controls, sound enhancement support and much more. This is in addition to the current offering which includes the Stereoscopic 3D and Scribe Pen APIs.  So why develop with this SDK?  We'll take a look at this SDK or more accurately, this add-on to the Android SDK and show you how it provides differentiation with increased market outreach as opposed to vendor lock in and fragmentation. We'll explore compatibility best practices across platform versions and devices, giving you the ability to fall back gracefully and to manage releases across Android devices from a common code base. HTCdev is a developer program for developers by developers, so we understand the pain points of developing applications that target as many devices, form factors and Android API levels as possible.</i></p> <p>The rough agenda for the evening looks like this:<br/>6:00-6:25pm: Arrive and mingle (food/drinks provided)<br/>6:25-6:30pm: Announcements<br/>6:30-6:45pm: Lightning talks (apply via comments)<br/>6:45-7:45pm: Dario's presentation<br/>7:45-8:00pm: Q&amp;A, wrap-up, and giveaways</p> <p>As always, food, drinks, and giveaways will be provided by our sponsors.</p> <p>Oh, and we'll also <b>give away two HTC phones and two tablets</b> to the lucky winners :-)</p> <p>About Dario Laverde</p> <p>Dario Laverde is a Developer Evangelist at HTC. He has experience in software development for mobile, embedded, web and enterprise. Amongst his various professional roles, he has worked as an Android Instructor, consultant, Java architect, author and entrepreneur. Dario leads the NYCJava JUG and co-organizes both the NYC-GTUG and the New York Android Developers Meetup. He also co-founded the skylight1 open source Android project.</p> <p> </p> ","visibility":"public"},{"created":1332438845000,"id":"57433922","name":"When Mobile (Android) met Cloud","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1338512400000,"local_date":"2012-05-31","local_time":"18:00","updated":1338579980000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":165,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/57433922/","description":"<p>The Enterprise IT world is currently being shaped by two powerful evolutionary shifts – Mobile and Cloud Computing. More and more enterprise apps are becoming mobile and at the same time, IT departments are adopting Cloud Computing en masse. So what lies at the intersection of these two powerful forces and how does an Android developer build an enterprise mobile app that takes advantage of the Cloud? Come find out how you can develop an Android app using a 2-tier architecture that hosts its data in a cloud platform like Force.com, all the UI and app logic on the Android device and uses APIs to communicate between the two tiers. We’ll cover requirements like security, offline access and push notifications that are especially important for Enterprise mobile apps and how the Force.com platform can provide application services like User Management and backend integration and free the Android developer to focus on a killer user experience.</p> <p>The rough agenda for the evening looks like this:</p> <p>6:00-6:25pm: Arrive and mingle (food/drinks provided)<br/>6:25-6:30pm: Announcements<br/>6:30-7:30pm: Sandeep's presentation<br/>7:30-8:00pm: Q&amp;A, wrap-up, and giveaways</p> <p>About Sandeep Bhanot<br/>Sandeep Bhanot is a Android hacker by inclination and a Senior Developer Evangelist at Salesforce.com by trade. In a prior incarnation (he is Indian after all), he was an Enterprise Architect and SOA Consultant. As a Developer Evangelist at Salesforce.com, he helps spread the gospel of the Cloud and has presented at several industry conferences, including CodeMash, Java One and Cloudstock.</p> ","visibility":"public"},{"created":1279395220000,"id":"16241047","name":"The CyanogenMod project","rsvp_limit":400,"date_in_series_pattern":false,"status":"past","time":1340760600000,"local_date":"2012-06-26","local_time":"18:30","rsvp_close_offset":"PT6H30M","updated":1343793160000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":378,"venue":{"id":1533952,"name":"Yelp","lat":37.78614044189453,"lon":-122.40261840820312,"repinned":false,"address_1":"706 Mission Street ","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/16241047/","description":"<p>You asked for it, and we delivered!</p> <p>Steve Kondik (a.k.a. Cyanogen), along with Chris Soyars and other members of the <a href=\"http://en.wikipedia.org/wiki/CyanogenMod\">CyanogenMod</a> team, will be in town for the <a href=\"https://developers.google.com/events/io/\">Google I/O</a>, and they offered to swing by and tell us what they are up to.</p> <p>They promised to give us a brief history of the project, tell us how they got here, about where they are going, and then switch gears and do a Q&amp;A session. I suggest you come prepared with questions! I know that I have more than a few. This should be fun!</p> <p>The venue, food, drinks, and giveaways will be provided by our sponsors!</p> <p>The doors open at 5:30pm to allow enough time for the check-in process, but the main presentation starts at 6:30pm. <b><i>Guestlist will close at 12pm on the day of the event, so please be sure you sign up soon!</i></b></p> <p>My thanks goes out to all of you who requested this meetup as well as Max Walker and Chris Soyars for making it happen!</p> <p> </p> <p> </p> <p> </p> ","visibility":"public"},{"created":1332439784000,"id":"57435742","name":"Updated: Concurrency in Android by Blake Meike","rsvp_limit":275,"date_in_series_pattern":false,"status":"past","time":1343782800000,"local_date":"2012-07-31","local_time":"18:00","updated":1346210934000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":236,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/57435742/","manual_attendance_count":67,"description":"<p>Update: <b>The Mobile Web / Chrome talk by Google is postponed</b> until we get the complete abstract from Google and secure a new date. We'll keep you posted. Sorry for the inconvenience.</p> <p>Instead, we'll have Blake Meike, from Marakana, and a co-author of <i>Programming Android</i>, give a talk focused on the <b>concurrency best-practices in Android</b>.</p> <p><i>Moblie appliances change the nature of the concurrent demands put on applications and the operating systems that support them. Until very recently, concurrency was an optimization trick that allowed an expensive machine to service a queue of tasks effectively. Instead of waiting for something real-world and slow, it could do work on other queued tasks.</i></p> <p><i>With mobile appliances “concurrency” means something more like what used to be called “real time computing”. A mobile device user may be, simultaneously, using a web browser, listening to music, taking direction from a navigation service, and receiving text and phone calls. Furthermore multi-core processors are becoming common on mobile platforms: true concurrency will replace synchronous processor sharing.</i></p> <p><i>The Android OS includes tools at three levels of granularity (in addition to those standard in java.util.concurrent), to address the need for concurrent execution: the managed application lifecycle, the Looper/Handler types, and the AsyncTask template. While these tools are partially successful each introduces its own new problems. In particular, the interactions between the managed application lifecycle and the AsyncTask can be especially problematic.</i></p> <p>The venue, food, drinks, and giveaways will be provided by our sponsors.</p> <p><b>About Blake Meike:</b></p> <p>Blake is an engineer with more than 30 years of experience, much of it with Java.  He has built systems as large as Amazon's massively scalable AutoScaling service and as small as a pre-Android OSS/Linux based Java-like platform for cell-phones. He is co-author of the O'Reilly book, \"Programming Android\". He teaches Android at Marakana.</p> ","visibility":"public"},{"created":1329969122000,"id":"53441512","name":"Learn about the Android Camera Stack in Jelly Bean - inside out","rsvp_limit":259,"date_in_series_pattern":false,"status":"past","time":1346202000000,"local_date":"2012-08-28","local_time":"18:00","updated":1348631555000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":228,"venue":{"id":1533952,"name":"Yelp","lat":37.78614044189453,"lon":-122.40261840820312,"repinned":false,"address_1":"706 Mission Street ","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/53441512/","manual_attendance_count":126,"description":"<p>*Please take note of the important check-in details at Yelp*</p> <p>For our August meetup, we are happy to welcome Balwinder Kaur and Joe Rickson from Aptina Imaging who offered to take us on a tour through the Android's camera stack. This is a great opportunity to get a look at Android's inner-guts: from the developer-exposed APIs, to the services in the media framework, to the user-space hardware abstraction layer, to the kernel and the kernel drivers, all the way to the hardware itself. If you are someone who cares about how stuff works, you don't want to miss this one.</p> <p><i>Android 4.0 was released with support for many advanced camera features like video snapshot, face detection, and video stabilization. This presentation provides a technical deep dive into the Android camera stack internals. The Camera.Parameters pipe-line enables different image sensors to expose its hardware specific functionalities to the application layer. The system level camera service interacts with the media framework, the display subsystem, and the camera hardware via an implementation of the camera hardware abstraction layer (HAL). The low level camera interface discussion will include a general overview of camera hardware, the hardware interfaces used by the camera (control and data), and the driver interface to the camera. The intended audience for this conference session is engineers who want to learn more about the Android camera internals and driver architecture. Cameras in mobile devices have gone mainstream and this talk should facilitate engineers wanting to integrate, improve or innovate using the camera subsystem.</i></p> <p>As before, venue, food, drinks, and giveaways will be provided by our sponsors.</p> <p>About Balwinder Kaur:</p> <p>Balwinder Kaur is a Principal Software Architect at Aptina Imaging, Inc. working on the Aptina Camera Software Stack, Augmented Reality and Mobile Image Sensing. She has been working with Android since 2009. Prior to Aptina, she was at T-Mobile where she worked on Android Applications, and Android Internals. She graduated with a MS in Computer Technology from the Indian Institute of Technology. Outside of work, she spends time with her two rambunctious boys, and doing art and crafts with six year olds.</p> <p>About Joe Rickson:<br/>Joe Rickson is a Principal Software engineer for Aptina Imaging (formally Micron Technology, Inc). His focus is on low level driver development. He has been working with the Android Camera Subsystem since Froyo days. In a previous life, he worked on Windows Display drivers. Joe has a BS and MS is Computer Engineering from San Jose State University. In his spare time, Joe enjoys home improvement tasks.</p> <p>CHECK-IN PROCESS</p> <p>Doors will open at 5:30pm to allow enough time for the check-in process. Please update your meeting handle to reflect your <b>FIRST NAME AND LAST NAME</b>. Security will be checking IDs at the door.<b><i>*Please note: You</i></b> <b><i>WILL NOT</i></b><b><i>be allowed into the event unless we have your first and last name (that matches the name on your ID) prior to the event.</i></b> Guestlist will be closing at <b>11:30AM</b> the day of the event (Tuesday - August 28). If you will be coming with a guest, please provide us with their first and last name as well. Waiting list folks will be allowed into the event <b>AFTER</b> we get through all the confirmed attendees. Yelp is generously providing pizza, drinks, and beer on top of the venue space, so please be respectful of the attached event terms/guidelines: <a href=\"https://marakana.com/static/community/2012%20Yelp%20Property%20Event%20Terms.pdf\">YELP EVENT GUIDELINES</a>.  </p> <p> </p> ","visibility":"public"},{"created":1346215359000,"id":"79858712","name":"Home Automation with Android","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1348621200000,"local_date":"2012-09-25","local_time":"18:00","updated":1351650683000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":178,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/79858712/","manual_attendance_count":95,"description":"<p><a href=\"http://cdn.slashgear.com/wp-content/uploads/2012/02/top.pngEver\" class=\"linkified\">http://cdn.slashgear.com/wp-content/uploads/2012/02/top.pngEver</a> since the <a href=\"http://www.youtube.com/watch?v=zD3Q4kJhD5w&amp;feature=player_embedded\">Android@Home</a> announcement at Google I/O 2011, we've been <a href=\"http://techcrunch.com/2012/06/24/what-happened-to-android-at-home/\">waiting for something tangible</a> to play with. While <a href=\"https://play.google.com/store/devices/details/Nexus_Q?id=nexus_q\">Nexus Q</a> is a great first step, its focus is too narrow to fulfill on the promise of home automation. Thankfully, the folks behind <a href=\"http://www.mysmartyhome.com/\">SmartyHome</a> are not waiting on Google to deliver the goods. Instead, they created <a href=\"http://www.mysmartyhome.com/what-is-smartyhome/\">an Android appliance</a> \"designed from the ground up for shared use, great sound and home automation\", and they offered to share their experience with us!</p> <p><i>We can easily find out what was the weather in Timbuktu three months ago, but have little idea how much we spent on heating or air conditioning, how are dogs are doing while we're away or controlling things in the house. Our homes are stuck in the 20th century while our mobile devices push forwards.</i></p> <p><i>Android is a great OS for home automation since it is open source, has many thousands of apps, great development tools and a large development community. Out of the box though, Android devices, don't have connectivity to standard Home Automation protocols such as X-10, Z-Wave or Zigbee. Additionally, Android based home automation solutions needs to be much more appliance-like requiring minimal configuration.</i></p> <p><a href=\"http://www.mysmartyhome.com/wp-content/uploads/2012/09/smarty-sitting-113.jpg?height=100&amp;width=200'/\" class=\"linkified\">http://www.mysmartyhome.com/wp-content/uploads/2012/09/smarty-sitting-113.jpg?height=100&amp;width=200'/</a> <i>In this presentation we'll explore how to get your home into the 21st century without breaking the bank or spending tons of time configuring and hacking different devices. We'll show an Android based device that we have developed, SmartyHome, that has built in speakers for good sound and integrated home automation, and how it resolves the above issues.</i></p> <p>As always, the venue, food, drinks, and give-aways will be provided by our sponsors.</p> <p> </p> <p>About Dror Matalon<br/>SmartyHome is Dror's 5th startup that Dror founded. Dror spent the last 25 years in the high tech industry in various roles. His first startup, DNAI, was a S.F. Bay Area ISP that he started in 1994 and grew to more than 50 employees by the time it was sold to RCN in 1999. After DNAI, Dror took some time off and in 2002, started Zapatec which he sold in 2009 to Funambol.</p> <p>About Neil Goldberg<br/>Neil has 25 years of experience designing products and user experiences that bring emerging technologies into the consumer electronics market, including early navigation systems (1993), digital cameras (1994), video telephony (1995), tablet computing (1998), portable ultrasound (2004), in home laser hair removal (2005). Neil has also started ventures in office services, internet photography, specialized print fulfillment and solar power.</p> ","visibility":"public"},{"created":1348639277000,"duration":8100000,"id":"84141102","name":"Project stORM: an open source ORM for SQLite on Android","rsvp_limit":275,"date_in_series_pattern":false,"status":"past","time":1351643400000,"local_date":"2012-10-30","local_time":"17:30","updated":1351700924000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":107,"venue":{"id":3231672,"name":"StackMob HQ ","lat":37.772071838378906,"lon":-122.40621185302734,"repinned":false,"address_1":"541 8th St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/84141102/","manual_attendance_count":41,"description":"<p>For our October meetup, we are happy to welcome David Chandler, from Google, who generously offered to introduce us to stORM, an open-source ORM for SQLite on Android.</p> <p><i>Android's bundled SQLite database is powerful, but requires a lot of hand-coded SQL to get started. Using an ORM can simplify database development for many applications, and the Android ecosystem already has several to choose from. stORM is a new offering written by Android Developer Advocate David Chandler that aims for a streamlined developer experience (only two annotations required) and solid performance (preferring code generation over reflection). stORM is extensible, minimally intrusive, and offers built-in CSV backup / restore capabilities to facilitate database version upgrades. Along with stORM, Chandler will present basic-http-client, a lightweight Java HTTP client with a built-in asynchronous interface. Last but not least, Chandler will give an Android ecosystem update.</i></p> <p>Special thanks goes out to Jill M. Rupp from Apex Systems who helped arrange for David to present at our group!</p> <p>As always, the venue, food, drinks, and giveaways will be provided by our sponsors.</p> <p>About David Chandler</p> <p>David Chandler is an Android Developer Advocate in Atlanta. He fell in love with programming at age 14 on his TI-99/4A and has since worked on everything from a spaceborne GPS receiver to Internet banking and mobile apps. An electrical engineer by training, Chandler got hooked on building Web database applications in the days of NCSA Mosaic and has written Web apps in C, perl, ksh, ColdFusion, JSF, GWT + App Engine, and Dart. Most recently, he has focused on mobile apps with a special interest in the mobile Web and cloud data synchronization. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web and mobile development at turbomanage.wordpress.com. His most recent open source project is basic-http-client for Android. Outside work, Chandler is an avid outdoor photographer and enjoys teaching math and computer science in a homeschool co-op.</p> ","visibility":"public"},{"created":1351725317000,"id":"89393052","name":"Lightning talks and mini-presentations","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1354066200000,"local_date":"2012-11-27","local_time":"17:30","updated":1354095267000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":163,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/89393052/","description":"<p><b>*Please take note of the important check-in details at Yelp*</b></p> <p>By popular demand, our November meetup will be another \"social\" event... to give us an opportunity to check out what other Android developers are up to.</p> <p>So, if you are interested in presenting on something near-and-dear to you (that is related to Android), then this is your shot at the podium.</p> <p>In these informal lightning-talk style mini presentations, you could share best practices and tips &amp; tricks; discuss tools, frameworks, or interesting APIs; ask questions; present ideas and solicit feedback; and even demo code. We just ask that you keep your presentation short (ideally up to 5 minutes) and non-commercial. Think developers, not customers.</p> <p>If you know you'd like to do a lighting talk, there is nothing \"special\" that you need to do (it's OK not to use slides), but consider posting a short blurb about what you would like to discuss as a comment below.</p> <p>Finally, we recommend that you check out our <a href=\"http://www.sfandroid.org/pages/Presentation/\">best practices for presenting</a> if you are brave enough to get on the stage.</p> <p>The venue, food, and drinks (<b>beer as well</b>) will be provided by Yelp. The giveaways will be provided by our other sponsors.</p> <p><b>CHECK-IN PROCESS</b></p> <p>Doors will open at 5:30pm to allow enough time for the check-in process. Please update your meeting handle to reflect your <b>FIRST NAME AND LAST NAME</b>. Security will be checking IDs at the door. <b><i>*Please note: You</i></b> <b><i>WILL NOT</i></b> <b><i>be allowed into the event unless we have your first and last name (that matches the name on your ID) prior to the event.</i></b> Beer and wine will be served at this event, so please keep in mind only folks 21 and over are allowed into the event. (Another reason for the ID check) Guestlist will be closing at <b>11:30AM</b> the day of the event (Tuesday - November 27). If you will be coming with a guest, please provide us with their first and last name as well. Waiting list folks will be allowed into the event <b>AFTER</b> we get through all the confirmed attendees. Yelp is generously providing pizza, drinks, and beer on top of the venue space, so please be respectful of the attached event terms/guidelines: <b><a href=\"https://marakana.com/static/community/2012%20Yelp%20Property%20Event%20Terms.pdf\">YELP EVENT GUIDELINES</a></b>.  </p> <p> </p> ","visibility":"public"},{"created":1354347546000,"duration":9900000,"id":"93595462","name":"Android Security - Going Deep","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1359509400000,"local_date":"2013-01-29","local_time":"17:30","updated":1359544946000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":204,"venue":{"id":6679772,"name":"Eventbrite HQ","lat":37.77552032470703,"lon":-122.40007019042969,"repinned":false,"address_1":"651 Brannan St. Ste 110","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94107","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/93595462/","description":"<p>For our January event, we have not one, but two amazing presenters who offered to take us deep into the world of Android security.</p> <p>A Deep Dive into Mobile Malware</p> <p>If you're curious about mobile malware, what it does, and how it does it, we'll tear down a few sample applications and look at their inner workings. Along the way, you'll see how professional malware hunters examine apps and find out how they misbehave.</p> <p>The presenter is Emil Ong, a software engineer at <a href=\"https://www.lookout.com/\">Lookout Mobile Security</a>. He spends his days building tools to find and investigate malware.</p> <p> </p> <p>Side channel attacks: Timing Attacks, Simple Power Analysis, Differential Power Analysis</p> <p>While writing malware does not take rocket science, attacking physical devices by measuring power consumption or electromagnetic radiation (say from 10-20 feet away) may seem to be out of reach to most mortals. Or is it? Luke Teyssier offered to tell us more. Time-permitting, Luke may event expand his talk to discuss topics like: reasoning about cryptographic security, key strength vs # of bits, reasonable looking ways to misuse and compromise the security of otherwise good crypto, and more.</p> <p>About Luke Teyssier</p> <p>Luke has been working with, designing, and programming computers and embedded systems of various sizes and shapes since 1983, when he began digging into the internals of his Z80 based personal computer. He has extensive experience with digital hardware and software including x86, ARM, MIPS, PowerPC, 68000, and others. He has contributed significantly to a number of firsts such as the first VOIP speaker phone, the first wireless web browser tablet, the first Java graphical browser desktop phone, and a $500M signal processing system. He has built a variety of FPGA designs including cryptographic hardware, high-speed protocol analyzers and RF module control systems. Recently, he spent 6 years researching and teaching Differential Power Analysis, a cryptographic side-channel analysis technology.</p> ","visibility":"public"},{"created":1361820306000,"duration":9000000,"id":"106348632","name":"Informal Developer Mixer","rsvp_limit":70,"date_in_series_pattern":false,"status":"past","time":1362101400000,"local_date":"2013-02-28","local_time":"17:30","updated":1362174271000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":42,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/106348632/","description":"<p>This month we'll do something a bit different, thanks to <a href=\"http://www.sfandroid.org/member/8972458/\">Krishna Achanta</a>, who offered to take a lead on this one.</p> <p>The idea is to meetup with fellow Android application developers and exchange knowledge - <a href=\"http://en.wikipedia.org/wiki/Unconference\">unconference</a> style.</p> <p>You may bring in questions, ideas that you want to discuss with your peers or just attend and share your knowledge with others by answering their questions.</p> <p>Bring your laptops if you want to share code* as that will let others quickly understand the issues you might be facing. We can also post questions on <a href=\"http://stackoverflow.com/questions/tagged/android\">Stack Overflow</a> in case we could not find answers during the meetup.</p> <p>This event will be hosted at <a href=\"http://www.medhelp.org/\">MedHelp Intl Inc</a> office located at 929 Market St (@ 5th St), Suite 300. You will have to dial MedHelp's number at the dial box at the entrance. Once you come to the third floor, just ring the bell and someone will open the door for you.</p> <p>The attendance is limited and only the people who are in the attending list will be allowed to come in because of space constraints.</p> <p>Consider leaving a comment along with RSVP letting us know what you are looking for and what your skill level is.</p> <p>The snacks and drinks will be provided by our sponsors.</p> <p>* You take responsibility for sharing your code. Do not share it if it has your or your company's sensitive information.</p> ","visibility":"public"},{"created":1361990644000,"duration":9000000,"id":"106718932","name":"Android Power Profiling","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1363912200000,"local_date":"2013-03-21","local_time":"17:30","updated":1364232008000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":125,"venue":{"id":12262482,"name":"Velti SF Office","lat":37.77492904663086,"lon":-122.41941833496094,"repinned":false,"address_1":"1 Market Street | Steuart Tower | 6th Floor","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/106718932/","description":"<p>We already discussed <a href=\"http://www.sfandroid.org/events/12803170/\">power consumption and battery life in mobile devices</a>, but two years has passed and it's time to revisit the issues and talk about practical approaches to building battery-frugal apps. Thankfully, Frank Maker is back to share his wisdom and lessons learned from his PhD-research on the subject of battery use in mobile.</p> <p><i>Smartphone applications are power hungry and continually outpace slow mobile battery storage improvements. In order to avoid bad user experience from wasting battery life, developers can profile the power consumption of their applications during design. In this talk we will discuss power estimation using software models, external power measurement using benchtop equipment, and measurement using built-in battery measurement units (BMUs).  The pros and cons of each technique will be presented along with some tricks of the trade to make testing easier.</i></p> <p>As usual, food, drinks, and venue will be provided by our sponsors.</p> <p>About Frank Maker</p> <p>Frank Maker is a Ph.D. candidate at the University of California, Davis studying Embedded Software and Systems.  His academic work focuses on real-time smartphone power profiling to adapt software to changing energy conditions.  Previously he interned for both Google and Broadcom's Android systems team and delivers corporate <a href=\"http://marakana.com/training/android/android_internals.html\">Android Internals training</a> for Marakana. Before smartphones his career started in automotive embedded software with Motorola Automotive and BMW. In 2005 he received his B.S in Computer Engineering and B.A. in German from the University of Rhode Island and his M.S. in Electrical and Computer Engineering from the University of California, Davis in 2010. Outside of engineering, he enjoys exercising and spending time with hiswife, two young children, and dog. He blogs at <a href=\"http://handycodeworks.com/\">handycodeworks.com</a>.</p> ","visibility":"public"},{"created":1363995785000,"duration":9000000,"id":"110594982","name":"Using Styles and Themes in Android","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1366765200000,"local_date":"2013-04-23","local_time":"18:00","updated":1368731673000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":171,"venue":{"id":1533952,"name":"Yelp","lat":37.78614044189453,"lon":-122.40261840820312,"repinned":false,"address_1":"706 Mission Street ","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/110594982/","description":"<p><b>*Please take note of the important check-in details at Yelp</b>*</p> <p>For our April meetup, we are happy that Blake Meike, co-author of <i>Programming Android</i>, offered to come <a href=\"http://www.sfandroid.org/events/57435742/\">back</a> to our group and show us how to use styles and themes in Android.</p> <p><a href=\"http://developer.android.com/guide/topics/ui/themes.html\">Styles and Themes</a> are essential tools for your Android development. It's probably obvious that, as the <a href=\"https://en.wikipedia.org/wiki/Cascading_Style_Sheets\">CSS</a> of the Android world, they are a great way to standardize the appearance of your application. They go way beyond that, though. You can use styles to:</p> <p>Separate application design from application development: coders don't need to fiddle with the screen; designers don't have to settle for UIs designed by coders Adjust your application to look its best regardless of the size and shape of the device, or the version of Android it happens to be running Back-fit the appearance of standard Android objects -- backgrounds and buttons, dialogs and toasts so that they fit with your app. This presentation will show you how to code custom widgets with appearance and behavior defined by their own XML layout attributes, and then how to manage those attributes using themes to create a coherent and pleasing UI on a wide variety of devices.</p> <p>As always, the venue, food, drinks, and giveaways will be provided by our sponsors.</p> <p>About Blake Meike:<br/>Blake is an engineer with more than 30 years of experience, much of it with Java.  He has built systems as large as Amazon's massively scalable AutoScaling service and as small as a pre-Android OSS/Linux based Java-like platform for cell-phones. He is co-author of the O'Reilly book, \"<a href=\"http://www.amazon.com/Programming-Android-Generation-Mobile-Devices/dp/1449316646\">Programming Android</a>\". He <a href=\"http://marakana.com/training/android/\">teaches Android at Marakana</a>.</p> <p><b>CHECK-IN PROCESS</b></p> <p>Doors will open at 6:00pm to allow enough time for the check-in process. Please update your meeting handle to reflect your <b>FIRST NAME AND LAST NAME</b>. Security will be checking IDs at the door. <b><i>*Please note: You</i></b> <b><i>WILL NOT</i></b> <b><i>be allowed into the event unless we have your first and last name (that matches the name on your ID) prior to the event.</i></b> Beer and wine will be served at this event, so please keep in mind only folks 21 and over are allowed into the event. (Another reason for the ID check) Guestlist will be closing at <b>11:45AM</b> the day of the event (Tuesday - April 23). If you will be coming with a guest, please provide us with their first and last name as well. Waiting list folks will be allowed into the event <b>AFTER</b> we get through all the confirmed attendees. Yelp is generously providing pizza, drinks, and beer on top of the venue space, so please be respectful of the attached event terms/guidelines: <b><a href=\"https://marakana.com/static/community/2012%20Yelp%20Property%20Event%20Terms.pdf\">YELP EVENT GUIDELINES</a></b>.  </p> ","visibility":"public"},{"created":1366698581000,"duration":7200000,"id":"115727492","name":"HTC on Bluetooth Low Energy (BLE) and OpenGL ES 3.0","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1368754200000,"local_date":"2013-05-16","local_time":"18:30","updated":1368801723000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":204,"venue":{"id":12262482,"name":"Velti SF Office","lat":37.77492904663086,"lon":-122.41941833496094,"repinned":false,"address_1":"1 Market Street | Steuart Tower | 6th Floor","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/115727492/","description":"<p>For our May meetup, we are stoked that a trio of dev gurus from <a href=\"http://www.htc.com/us/\">HTC</a> made time in their busy (<a href=\"https://developers.google.com/events/io/\">Google I/O</a>) schedule to come and present at our group.</p> <p><a href=\"http://en.wikipedia.org/wiki/Bluetooth_low_energy\">Bluetooth Low Energy (BLE)</a> on Android has arrived. Dario Laverde will provide an overview of the BLE specification and take us through HTC's APIs and hands-on demos with various devices, heart rate monitors, key finders, and multi-sensor kits (temperature, pressure, humidity, accelerometer). You'll walk away ready with the code to kick start your BLE ideas.</p> <p>Next, Lance Nanek will tell us about <a href=\"http://en.wikipedia.org/wiki/OpenGL_ES#OpenGL.C2.A0ES.C2.A03.0\">Open GL ES 3.0</a>, the new pipeline, updated shading language, enhanced texturing.... but more importantly, blow us away with some amazing demos!</p> <p>Finally, Dario and Lance will be joined by David Wu and the three of them will answer your questions.</p> <p>We'll wrap up with giveaways!</p> <p>As always, the venue, food, and drinks will be provided by our sponsors.</p> <p> </p> <p>About Dario Laverde<br/>Dario is a Developer Evangelist at HTC. He has experience in software development for mobile, embedded, Web and enterprise. Among his various professional roles, he has worked as an Android Instructor, consultant, Java architect, author and entrepreneur. Dario leads the NYCJava JUG, and co-organizes both the NYC-GTUG and the New York Android Developers Meetup. He also cofounded the skylight1 open-source Android project.</p> <p>About Lance Nanek<br/>Lance Nanek is a Developer Evangelist at HTC. He has ten years of experience in information technology: implementing web metrics for ibm.com at IBM, writing Java web applications at State University of New York System Administration, and working on Android apps for many companies, including CardioTrainer by WorkSmart Labs with over three million downloads. He has a master's degree in Computer Science from State University of New York University at Albany.</p> <p>About David Wu<br/>David is a principal software engineer at HTC. He works on the social network team for HTC Sense, responsible for adding “social touches” to the overall user experience. He is one of the core developers behind HTC Friend Stream. In his free time he is also an active participant in the free software community in Taiwan. He is a regular at both the Taipei Open Source Software User Group and Hacking Thursday.</p> ","visibility":"public"},{"created":1370847340000,"id":"123849172","name":"Developing for Google Glass","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1372206600000,"local_date":"2013-06-25","local_time":"17:30","updated":1372273741000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":178,"venue":{"id":1533952,"name":"Yelp","lat":37.78614044189453,"lon":-122.40261840820312,"repinned":false,"address_1":"706 Mission Street ","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/123849172/","description":"<p><b>*Please take note of the important check-in details at Yelp outlined below</b>*</p> <p>For our June 25th event we are doing something a bit different. We'll talk about <a href=\"http://en.wikipedia.org/wiki/Google_Glass\">Google Glass</a>!</p> <p>While Glass is powered by Android/ICS, this is not a \"pure Android\" event, because there is a fair amount of material that is not directly related to Android. However, Google Glass is a new (and perhaps even controversial) technology with myriad possibilities, which makes this an interesting topic for a meetup session. Note that this event is a repeat of a <a href=\"http://www.meetup.com/SFRails/events/108943092/\">similar talk scheduled for June 20th at SF Rails UG</a>, but with our will have more focus on Glass than Rails. Special thanks goes out to Oswald Campesato who coordinated all of the speakers!</p> <p> </p> <p><b>Main Talk: Developing for Google Glass in Rails</b></p> <p>Han Kang and Kunal Modi from <a href=\"http://www.thirst.co/\">ThirstLabs</a> will provide an in-depth look at developing for Google Glass. (And by in-depth, we mean in-depth.) Just a few of the things they'll talk about include:</p> <p>1. Glass architecture and capabilities</p> <p>• Timelines <br/>• Subscriptions <br/>• Attachments <br/>• Location <br/>• Contacts</p> <p>2. Rails meets Glass</p> <p>• googleapiclient (official gem) <br/>• glass-rails (our gem!!) <br/>• pre-defined templates (ours)</p> <p>3. Mistakes/Gotchas</p> <p>• Testing: only using the playground <br/>• Actions and some basic UI complexities/challenges <br/>• Super complicated templates <br/>• Frequency in scheduling pushes <br/>• CSS limitations</p> <p>4. The Future of Glass</p> <p>• Our view: “twitter on steroids” <br/>• A Legitimate rails platform: our work and others <br/>• Network effects: what more apps will imply/enable</p> <p><i>About the Speakers</i></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/1/4/1/6/event_241685142.jpeg\" /><a href=\"https://twitter.com/logicalhan\">Han Kang</a> is a software developer/rubyist at ThirstLabs with a penchant for cutting-edge technologies. (Obviously with his work with Glass.)</p> <p> </p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/1/4/4/8/event_241685192.jpeg\" /><a href=\"https://twitter.com/kunal_modi\">Kunal Modi</a> is Co-Founder and CTO of @ThirstLabs. Has an EECS major from @Cal and knows his way around Ruby, Python, JavaScript, and PostgreSQL.</p> <p> </p> <p><b>Talk 2: 3D Visual Effects with CSS3/jQuery</b></p> <p>Oswald Campesato will provide hands-on instruction on 3D visual effects using CSS3 and jQuery. He'll start with a demo of pure CSS3 3D animation effects on a tablet and then cover some of the key concepts of CSS3 for graphics / animation.</p> <p>He'll also show some CSS3/jQuery code samples that create unusual animation effects and then end by using Google Glass to highlight a CSS3 animation demo.</p> <p><i>About the Speaker<br/></i> <a href=\"http://photos1.meetupstatic.com/photos/event/d/5/7/c/event_241974652.jpegOswald\" class=\"linkified\">http://photos1.meetupstatic.com/photos/event/d/5/7/c/event_241974652.jpegOswald</a> Campesato is a skilled 2D/3D developer and the author of <i><a href=\"http://www.amazon.com/HTML5-Canvas-CSS3-Graphics-Primer/dp/1936420341\">HTML5 Canvas and CSS3 Graphics Primer</a></i> (which he'll be raffling off a copy at the event). He works at<a href=\"http://www.swiftbot.com/\">SwiftBot</a> and has worked from C/C++/Java developer to CTO. He's comfortable in 4 languages and trying to learn Japanese, and is working on his 13th book, which is also an HTML-related book.</p> <p> </p> <p><b>CHECK-IN PROCESS</b></p> <p>Doors will open at 5:30pm to allow enough time for the check-in process. Please update your meeting handle to reflect your <b>FIRST NAME AND LAST NAME</b>. Security will be checking IDs at the door. <i>*Please note: You</i> <i>WILL NOT</i> <i>be allowed into the event unless we have your first and last name (that matches the name on your ID) prior to the event.</i> Beer and wine will be served at this event, so please keep in mind only folks 21 and over are allowed into the event. (Another reason for the ID check) Guestlist will be closing at <b>11:45AM</b> the day of the event (Tuesday - June 25). If you will be coming with a guest, please provide us with their first and last name as well. Waiting list folks will be allowed into the event <b>AFTER</b> we get through all the confirmed attendees. Yelp is generously providing pizza, drinks, and beer on top of the venue space, so please be respectful of the attached event terms/guidelines: <a href=\"https://marakana.com/static/community/2012%20Yelp%20Property%20Event%20Terms.pdf\"><b>YELP EVENT GUIDELINES</b></a>.</p> ","visibility":"public"},{"created":1372637250000,"duration":9000000,"id":"127299302","name":"IPv6 - An Introduction for Developers","rsvp_limit":75,"date_in_series_pattern":false,"status":"past","time":1373416200000,"local_date":"2013-07-09","local_time":"17:30","updated":1399150041000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":75,"venue":{"id":1533952,"name":"Yelp","lat":37.78614044189453,"lon":-122.40261840820312,"repinned":false,"address_1":"706 Mission Street ","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/127299302/","description":"<p><b>*Please take note of the important check-in details at Yelp (outlined below)</b>*</p> <p>We've been hearing about <a href=\"http://en.wikipedia.org/wiki/IPv6\">IPv6</a> for a while (it was originally <a href=\"http://www.ipv6.com/articles/general/timeline-of-ipv6.htm\">conceived in 1994</a>), and while IPv4 has served us well for over 30 years, it appears <a href=\"http://en.wikipedia.org/wiki/IPv4_address_exhaustion\">the inevitable</a> is finally catching up to us. Fortunately, Owen DeLong, an IPv6 Evangelist at <a href=\"http://ipv6.he.net/\">Hurricane Electric</a>, offered to tell us about what the future has in store for us. Note that this event is not really Android/Java-specific, but rather of consequence to all developers that touch the network stack. This <a href=\"http://www.meetup.com/sfjava/events/121681952/\">event is co-organized with the SF Java User Group</a> (please RSVP only once).</p> <p><i>This session will begin with a discussion of the importance of adding IPv6 support to applications which use the network followed by an introduction to the fundamentals of IPv6. Finally, we'll analyze the same sample application (client and server) implemented in IPv4 and then ported to IPv6 in C, PERL, and Python.</i></p> <p><a href=\"http://www.google.com/intl/en/ipv6/\"><img src=\"http://www.google.com/intl/en/ipv6/images/graph.png\" /></a></p> <p>As always, food, drinks, and the venue will be provided by our sponsors.</p> <p> </p> <p>About Owen DeLong<br/>Owen DeLong is an IPv6 Evangelist at Hurricane Electric and a member of the ARIN Advisory Council. Owen brings more than 25 years of industry experience and is an active member of the systems administration, operations, and IP Policy communities.</p> <p>In the past, Owen has worked at Tellme Networks (Senior Network Engineer), Exodus Communications (Senior Backbone Engineer) where he was part of the team that took Exodus from a pre-IPO start up with 2 data centers to a major global provider of hosting services, Netcom Online (Network Engineer) where he worked on a team that moved the internet from an expensive R&amp;E tool to a widely available public access system accessible to anyone with a computer, Sun Microsystems (Senior Systems Administrator), and more. He can be reached as owend at he dot net.</p> <p> </p> <p><b>CHECK-IN PROCESS</b></p> <p>Doors will open at 5:30pm to allow enough time for the check-in process. Please update your meeting handle to reflect your <b>FIRST NAME AND LAST NAME</b>. Security will be checking IDs at the door. <b><i>*Please note: You</i></b> <b><i>WILL NOT</i></b> <b><i>be allowed into the event unless we have your first and last name (that matches the name on your ID) prior to the event.</i></b> If you are not comfortable updating your Meetup handle to reflect your legal names, please send me a direct message with first and last name. Beer and wine will be served at this event, so please keep in mind only folks 21 and over are allowed into the event. (Another reason for the ID check) Guestlist will be closing at <b>11:45AM</b> the day of the event (Tuesday - July 9). If you will be coming with a guest, please provide us with their first and last name as well. Waiting list folks will be allowed into the event <b>AFTER</b> we get through all the confirmed attendees. Yelp is generously providing an awesome venue space, so please be respectful of the attached event terms/guidelines: <a href=\"https://marakana.com/static/community/2012%20Yelp%20Property%20Event%20Terms.pdf\"><b>YELP EVENT GUIDELINES</b></a>. If you have RSVP'd but find you can no longer attend, please update your status to allow room for those on the waiting list.</p> ","visibility":"public"},{"created":1375728464000,"id":"133211882","name":"On Android Conf: Oct 2013: Call for Speakers & Instructors","date_in_series_pattern":false,"status":"past","time":1377585900000,"local_date":"2013-08-26","local_time":"23:45","updated":1377597299000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":69,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/133211882/","description":"<p><img src=\"http://photos2.meetupstatic.com/photos/event/3/4/6/4/600_268213412.jpeg\" /></p> <p><a href=\"http://onandroidconf.com/index.html\">OnAndroidConf</a> is a ground-breaking developer oriented conference coming to the Moscone Center in San Francisco the week of October 21! The conference will highlight specific technologies, projects, and companies that have contributed to the advancement of Android and provide some of the best training on the latest technologies and trends that can help maximize the power of the Android platform. <b><i>*On Android is brought to you courtesy of the HTML5DevConf organizers.</i></b></p> <p>The Call for Speakers for OnAndroidConf is now open at: <a href=\"http://www.onandroidconf.com/speakers.html\" class=\"linkified\">http://www.onandroidconf.com/speakers.html</a></p> <p>Please submit your proposal if you would like to be a 50 min <a href=\"http://www.onandroidconf.com/speakers.html\">SPEAKER</a>or if you are interested in <a href=\"http://www.onandroidconf.com/training.html\">TEACHING</a> a day long training course. Sessions on best practices to all approaches of Android development whether Java or HTML5, or C/C++ based are encouraged. Talks on design or cloud best practices and other practical tips for Android developers are also welcome.</p> <p>Looking to be a sponsor? If you work for a company that might be a good fit to sponsor this highly technical trend setting conference, please let the organizers know!</p> <p>Questions? Contact the organizers at &lt;a&gt;[masked]&lt;/a&gt;</p> ","visibility":"public"},{"created":1376891183000,"id":"135479032","name":"Building Vine for Android","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1377653400000,"local_date":"2013-08-27","local_time":"18:30","updated":1377810161000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":232,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/135479032/","description":"<p>For our August meetup, we are pleased to have Sara Haider, Android Engineer at Twitter, speak about the inspiration behind Vine and the development of Vine for Android. After Vine's success on iOS, Sara's team has tackled video editing on Android's highly fragmented platform. Sara will discuss various decisions and trade-offs that were made in building Vine's looping playback, stop-motion recorder, and overall app performance on Android. She will also provide insight into the build stack, tools, and processes used in the project.</p> <p>*We're pleased to have this meet up to be held at Twitter HQ. Please note space is limited and the event is <b>CLOSED TO PRESS</b>. You can find additional logistical details below. </p> <p><b>About Sara Haider:</b></p> <p>Sara has spent 4 years on Twitter's engineering team and is currently the technical lead on Vine for Android. Prior to Vine, Sara spent 2 years working on Twitter for Android. She manages Twitter's Women in Engineering group and is an advisor to Girls Who Code, a non-profit organization focused on inspiring young girls to pursue and stay in engineering fields. She also advises startups in Silicon Valley, New York City, and Toronto. Previous to Twitter, Sara interned at Google as a Software Engineer. Sara holds a degree in Software Engineering and Cognitive Science from the University of Waterloo.</p> <p><b>Note for attendees: </b></p> <p>If your meetup profile does not include your full name, please add it by Monday 8/26 at 9:00am PDT. We will use this to create a list of attendees for security purposes. Also please bring a photo id that matches the name provided on the meetup. </p> <p><b>Directions/Parking:</b></p> <p>Twitter HQ is located at 1355 Market St. Please enter the main lobby, and checkin at a special table setup for event sign-ins. Attendees will then escorted to the 9th floor where the event will be held.</p> <p>If you're taking BART or Muni, exit at Civic Center and walk up Market St. There are several bus lines (the 6, 71, 21, etc.) that stop right outside of our building. If you're taking Caltrain, get off at the 4th and King station and you can take the Muni 83X shuttle which goes directly to our office. Coming by car? There is plenty of street parking nearby.</p> ","visibility":"public"},{"created":1375204436000,"duration":9000000,"id":"132173342","name":"Gradle for Android","rsvp_limit":300,"date_in_series_pattern":false,"status":"past","time":1380070800000,"local_date":"2013-09-24","local_time":"18:00","updated":1380302262000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":268,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/132173342/","manual_attendance_count":250,"description":"<p><b><i>*Please take a moment to review the check-in process at Twitter to ensure a smooth entry into the event:</i> <a href=\"http://www.meetup.com/sfandroid/pages/Twitter_HQ_-_Meetup_Check-In_Process\">Check-In Process</a></b></p> <p>For our September meetup, we are happy to have <a href=\"https://twitter.com/hans_d\">Hans Dockter</a>, the founder of Gradle, come and tells us about why this new build system matters to Android developers. We'll also have <a href=\"https://twitter.com/jle\">Jonathan Le</a>, Lead Developer of Twitter for Android, give us a glimpse at some of the hurdles of adopting Gradle at Twitter, how they were overcome, and talk a bit about publishing AAR files. Finally, Jake Ouellette offered to share his experience of integrating Gradle (plugin) into Crashlytics.</p> <p><i>We will talk about the new <a href=\"http://www.gradle.org/\">Gradle</a> based <a href=\"http://www.gradleware.com/resources/tech/android\">Build System for the Android SDK</a>. This new build system has been developed as a Gradle plugin by the Google Android team. It is full of innovation, many of them demonstrating the unique underlying capabilities of Gradle. We will also introduce Gradle as such with a special focus on the new features that have been developed as part of the Android effort. For example more generic, platform independent dependency management and the concept of library variants for different runtimes. We will show how these new features are extremely useful for other platforms like Javascript, Scala, Java and C++.</i></p> <p><i>This talk is interesting for both, people interested in Android and people interested in Gradle who don't have a background in Android.</i></p> <p>If you cannot wait until 9/24, you can check out <a href=\"https://thenewcircle.com/s/post/1288/gradle_open_source_hans_dockter_video\">Hans talk about Gradle at SFJUG</a> and at <a href=\"https://thenewcircle.com/s/post/1284/breaking_open_gradle_enterprise_automation_hans_dockter\">Breaking Open</a>.</p> <p>Special thanks goes out to <a href=\"https://twitter.com/DjRooz\">Rooz</a> from <a href=\"http://www.gradleware.com/\">Gradleware</a> for making it possible for Hans to speak at our group.</p> <p><b>About Hans Dockter</b></p> <p><a href=\"http://photos4.meetupstatic.com/photos/event/2/0/a/0/event_245648352.jpeg\">Hans</a> is the founder of Gradle and the CEO of Gradleware. Hans has 15 years of experience as a software developer, team leader, architect, trainer, and technical mentor in vast array of industry sectors such as automotive, finance, public transport and business intelligence. Hans is a thought leader in the field of project automation and has successfully been in charge of numerous large-scale continuous delivery implementations. He is also an advocate of Domain Driven Design, having taught classes and delivered presentations on this topic together with Eric Evans. In the earlier days, Hans was also a committer for the JBoss project and founded the JBoss-IDE.</p> <p><b>About Jonathan Le</b> </p> <p>&lt;a href=\"http://photos4.meetupstatic.com/photos/event/2/0/a/0/event_245648352.jpeg\"&gt;&lt;/a&gt;Jonathan is lead developer of Twitter for Android since it initially launched in 2010. He's a Tech Lead on the Android team and was formerly with Motorola. Jonathan also has 10 years as a Mobile developer under his belt.</p> <p><b>About Jake Ouellette</b></p> <p>Jake Ouellette is a Software Engineer at Twitter who is working on the Crashlytics mobile crash reporting tool. Jake's primary responsibilities include developing build-tool and IDE plugins which integrate the Crashlytics mobile SDK into applications. Prior to joining Twitter, Jake was a scientist at Charles River Analytics, where he was technical lead on several research software projects.</p> ","visibility":"public"},{"created":1378336506000,"duration":122400000,"id":"138428332","name":"OnAndroidConf October 2013 - Sessions Oct 22-23, Training Oct 21,24,25","date_in_series_pattern":false,"status":"past","time":1382454000000,"local_date":"2013-10-22","local_time":"08:00","updated":1382648802000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":80,"venue":{"id":13866952,"name":"Moscone Center North","lat":37.78398513793945,"lon":-122.40131378173828,"repinned":false,"address_1":"747 Howard St., San Francisco, CA, 94103","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/138428332/","description":"<p><img src=\"http://photos4.meetupstatic.com/photos/event/6/b/3/2/600_279687442.jpeg\" /> <b><a href=\"http://www.onandroidconf.com/\">OnAndroidConf</a> </b>offer some of the most expert talks and workshops given by the industries premier technologists from the world over. Our sessions and courses will help you on every part of your journey weather you are starting out and looking for solid foundations, or live on the bleeding edge, seeking to master the latest and greatest technologies.</p> <p>OnAndroidConf is following in HTML5DevConf's great tradition of some of the <b>highest quality training and sessions in the world at a price that won't break your budget.</b></p> <p><i>• Register for <b><a href=\"http://onandroidconf.eventbrite.com/\">OnAndroidConf</a></b></i></p> <p>OnAndroidConf also offers <a href=\"http://www.onandroidconf.com/training.html\">separate in-depth one-day technical training</a> on topics including Java and Android Development.</p> <p>---------------------------------------------------------------------------------</p> <p><i><b>~When will this be taking place?</b></i></p> <p>Sessions: October 22 &amp; 23</p> <p>Training: October 21, 24, &amp; 25</p> <p><i><b>~Where will these conferences be held?</b></i></p> <p>Moscone Center North</p> <p>747 Howard St.</p> <p>San Francisco, CA</p> <p><i><b>~How do I register?</b></i></p> <p>Follow the link:</p> <p>• Register for <b><a href=\"http://onandroidconf.eventbrite.com/\">OnAndroidConf</a></b></p> <p><i><b>~Isn't OnAndroidConf at the same time as HTML5DevConf?</b></i></p> <p>Yes. OnAndroidConf is held at the same time and place as HTML5DevConf, and a ticket to one will grant you access to the other.</p> <p><i><b>~What if I have questions?</b></i></p> <p>You can contact us at <a href=\"mailto:[masked]\">[masked]</a> or <a href=\"mailto:[masked]\">[masked]</a></p> ","visibility":"public"},{"created":1378944351000,"duration":7200000,"id":"139745032","name":"Testing for Android: When, Where, and How to Successfully Use Test Automation","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1383094800000,"local_date":"2013-10-29","local_time":"18:00","updated":1383993812000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":229,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/139745032/","description":"<p><b>*PLEASE NOTE:</b> In order to address quite a bit of hesitation from members wanting to provide first and last name on this site, we are requesting that folks please sign up via Eventbrite. To confirm your seat to this meetup, please <b><a href=\"https://testing-for-android.eventbrite.com/\">RSVP HERE</a></b></p> <p><i>*Please take a moment to review the <a href=\"http://www.meetup.com/sfandroid/pages/Twitter_HQ_-_Meetup_Check-In_Process\">Check-In Process</a> at Twitter to ensure a smooth entry into the event.</i> </p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/3/6/d/0/600_289814032.jpeg\" /></p> <p>Finally: an event dedicated to the (often painful) subject of Android testing! We are extremely happy that Trent Peterson, co-president at AppThwack, offered to share his experience and thoughts on this topic. </p> <p>In addition to Trent, we are fortunate to have Vandana Samala from Twitter's Mobile QA team, who promised to tell us a bit about how Twitter approaches Android Testing at scale.</p> <p><i>Reliable, well-engineered test automation is often a mythical goal that developers agree is a good idea, but in reality don't have the time and resources to execute properly. Considering the number of apps on the market and the fickleness of customers (<a href=\"http://techcrunch.com/2013/03/12/users-have-low-tolerance-for-buggy-apps-only-16-will-try-a-failing-app-more-than-twice/\">after 2 crashes 84% will go elsewhere</a>) testing is imperative just to stay relevant today.</i></p> <p><i>Fortunately best practices, strategies, and tools are emerging to cope with this difficult topic, and our talk will break them down across the following topics:</i></p> <p>1) <i>Developing an Automation Strategy - When, what, and where to automate:</i></p> <p>• <i>We will dispel the myth that automation solves all QA issues and eliminates the need for manual testing and QA teams. Machines are great at testing mind-numbing repetitive tasks and humans are great at testing user experience, and when manual and automated tests are used in conjunction the outcome is a better app. We’ll cover how to identify what should be automated and what shouldn’t.</i></p> <p><i>2) Automation Tools - An overview of different tools and types of automated tests available:</i></p> <p>• <i>Tool types include: Recorders, script based frameworks, and image based frameworks</i></p> <p><i>• Types of tests include: UI (Performance), Device and Hardware Compatibility, Functional</i></p> <p>• <i>Pros and Cons of the testing frameworks available for Android</i></p> <p><i>This talk is for Android developers and QA teams who are interested in learning more about automated testing on Android.</i></p> <p>This event will be sponsored and hosted by Twitter.</p> <p><b>About Trent Peterson</b></p> <p>Trent spent seven years at Intel designing system-automation solutions trusted to test products used by millions of customers with an emphasis on simplicity and user experience. He is a co-founder of AppThwack, a mobile app-testing platform that has helped thousands of developers automatically test their apps on 100s of real devices in minutes, catching issues well before they’re released into the wild.</p> <p><b>About Vandana Samala</b></p> <p>Vandana is a Software Engineer in the Twitter Mobile Engineering team. Prior to joining Twitter, Vandana worked for 4 1/2 years at Microsoft on Windows Mobile both on Client and Services team. Before that she worked at Garmin for an year on their Personal Navigation Products.</p> ","visibility":"public"},{"created":1391154278000,"duration":9000000,"id":"163644962","name":"Learn about Bluetooth RFCOMM, BLE, USB Open Accessory","rsvp_limit":140,"date_in_series_pattern":false,"status":"past","time":1393466400000,"local_date":"2014-02-26","local_time":"18:00","updated":1393744427000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":138,"venue":{"id":16596512,"name":"Geekdom SF","lat":37.78527069091797,"lon":-122.3975830078125,"repinned":false,"address_1":"620 Folsom Street","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94107","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/163644962/","description":"<p>We are extremely fortunate that Dave Smith will be in town, and that he accepted our invitation to tell us about how we can expand the reach of our Android devices via Bluetooth and USB.</p> <p><i>The Android framework provides many interesting ways to connect external accessory devices to applications. Through Bluetooth and USB connectivity, accessories can enhance experience and provide great value to the Android platform. We will explore Bluetooth RFCOMM, Bluetooth Low Energy, USB Open Accessory, and USB Host Mode APIs to learn how they work and the different types of accessories they can bring to life. From sensors to controller, join us to learn how we can use these APIs to expand the reach of Android beyond the confines of the mobile device.</i></p> <p>Special thanks goes out to Max Walker at <a href=\"https://thenewcircle.com/\">NewCircle</a> (an awesome <a href=\"https://thenewcircle.com/training/android/\">Android training</a> outfit) for making it possible for Dave to be here!</p> <p><b>About Dave Smith</b></p> <p>Dave Smith is a <a href=\"http://www.apress.com/9781430246145\">published author</a>, <a href=\"http://blog.wiresareobsolete.com\">blogger</a>, <a href=\"https://thenewcircle.com/expert/dave_smith,20690.html\">instructor</a>, <a href=\"http://tsn2.bzmedia.com/tradeshows/speakerinfo.aspx?id=180&amp;showid=29\">speaker</a>, and a professional engineer developing hardware and software for mobile and embedded platforms. Dave's engineering efforts are currently focused full-time on Android and iOS development. Since 2009, Dave has worked on developing at all levels of the Android platform, from writing user applications, to building and customizing the Android source code. Dave regularly communicates via his <a href=\"http://blog.wiresareobsolete.com/\">blog</a>, <a href=\"http://stackoverflow.com/users/246461/devunwired\">stackoverflow</a>, and Twitter stream at <a href=\"https://twitter.com/devunwired\">@devunwired</a>.</p> ","visibility":"public"},{"created":1395167225000,"duration":28800000,"id":"171978302","name":"Bay Area Android Fest","rsvp_limit":1,"date_in_series_pattern":false,"status":"past","time":1397318400000,"local_date":"2014-04-12","local_time":"09:00","updated":1397574326000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":3,"venue":{"id":19025952,"name":"Intel Auditorium (Building SC12)","lat":37.3848991394043,"lon":-121.96747589111328,"repinned":false,"address_1":"3600 Juliette Ln","city":"Santa Clara","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/171978302/","description":"<p>UPDATE: SIGN UP FOR THE SHUTTLE BUS FROM SAN FRANCISCO TO SANTA CLARA LEAVING 8:30AM, APRIL 12 FROM SF CALTRAIN STATION (4TH AND KING) </p> <p><a href=\"https://docs.google.com/a/bemyapp.com/spreadsheets/d/1hG3cnp2YjXa8LZYn_z4VpmsvaEB9PIyVBKfTf5pNHyE/edit\"><a href=\"https://docs.google.com/a/bemyapp.com/spreadsheets/d/1hG3cnp2YjXa8LZYn_z4VpmsvaEB9PIyVBKfTf5pNHyE/edit\" class=\"linkified\">https://docs.google.com/a/bemyapp.com/spreadsheets/d/1hG3cnp2YjXa8LZYn_z4VpmsvaEB9PIyVBKfTf5pNHyE/edit</a></a></p> <p>We’re excited to bring you the <a href=\"http://androidfest.bemyapp.com/\">Bay Area Android Fest</a>! This event is being powered by local Android meetup groups (including our own), and is taking place on Saturday April 12 at the Intel Auditorium in Santa Clara. </p> <p>With sessions on development, design, testing, scalability, monetization, and app discovery, this event will cover all the major elements involved in creating and launching an app on the Google Play Store! </p> <p>Come and join the local Android community for a day of informative sessions and great networking.</p> <p>Tickets are $20, and will get you – admission, swag bag, entry into a raffle (giving away great prizes like tablets and remote controlled cars), and breakfast/lunch. The ticket price is set to make sure people who sign-up follow through and attend the event – the $20 will be given back to attendees in the value of the swag bags and raffled prizes!</p> <p><b>UPDATED PROGRAM, PLEASE MAKE SURE YOU GO ON <a href=\"http://androidfest.bemyapp.com/\">androidfest.bemyapp.com</a> and get your ticket there.</b></p> <p>9am-10am Registration and Breakfast </p> <p>10am-10:10am Welcome with Amar Kona, Intel 10:10am-10:25am Kick-off keynote</p> <p>10:25am-10:45am Android Developer Ecosystem with Hemant Garg</p> <p>10:45am-11:30am UXD: Build.Better.Apps with Izabel Grey<br/>This session is for developers who are interested in UX design and in becoming part of the design narrative for whatever product that they're working on. It's tailored for the needs of developers, who might be new to UX design, and want to contribute to the design process, but don't know where to start. This is where you can start.</p> <p>11:30am-11:45am 15 minute break</p> <p>11:45am-12:30pm Design Review Session and Q&amp;A with the Google Android design team<br/>Q&amp;A with design advocates from Google  and informal app design review session tailored to provide specific feedback to each app submitted. Interactive format, which will help Android developers and publishers get a better insight on how to create well-designed, user-friendly applications.</p> <p>12:30pm-1:15pm Lunch</p> <p>1:15pm-2:30pm Test Driven Development with Christopher Perry, and Android Testing with Marcelo Hernandez</p> <p>Test Driven Development session includes:</p> <p>•  Dependency Injection and it's function in TDD</p> <p>•  How to do Dependency Injection in Android with Dagger</p> <p>•  Doing TDD in Android on the JVM using Robolectric</p> <p>•  Making assertions about code using fest and fest-android</p> <p>•  The role of mock objects in TDD and using Mockito in Android</p> <p> Android Testing session includes:</p> <p>•  Why testing is important and how it enables us to iterate faster</p> <p>•  How to design and write more testable code on Android</p> <p>•  How to approach unit, component, and UI testing</p> <p>•  How to write concise, beautiful, and reliable tests using tools like Espresso</p> <p>•  What the future holds for testing on AndroidThis is not just another tech talk. </p> <p> Come ready to pose your questions, express concerns, suggest alternatives, and join the discussion.</p> <p>2:30pm-3:15pm Scaling Android Development with Jan Chong</p> <p>In January 2012, nearly all Twitter for Android code was written by three engineers. As of January 2014, Twitter for Android has over seventy unique contributors from over tens different teams. In this talk, we'll discuss how Twitter moved to develop at scale from a single team-based development model to a project based development model that welcomes contributions from across the company and highlight some of the challenges that we ran into on the way.</p> <p>3:15pm-3:30pm 15min Break</p> <p>3:30pm-4pm Intel Tools</p> <p>4pm-4:45pm Panel on Balancing Organic and Inorganic Growth on App Stores with Ankit Jain, Ryan Lysne, Shoji Ueki</p> <p>You spend a lot of time developing your app. Then your marketing team tells you that you need to spend some money to buy an initial set of users so that you can move up in the top lists and search rankings.  This, they say, will kick in the organic k-factor and really propel you to succeed.  Ankit will discuss the basics of how App Stores are designed to help you have this marketing conversation in the right perspective. Through the discussion, you will hopefully know the right questions to ask, the right KPIs to focus on and hopefully control the explosive growth of your company!  For some basic background, watch Ankit's 2013 Google IO Talk at <a href=\"http://www.youtube.com/watch?v=5Od2SuL2igA\"><a href=\"http://www.youtube.com/watch?v=5Od2SuL2igA\" class=\"embedded\">http://www.youtube.com/watch?v=5Od2SuL2igA</a></a> </p> <p>4:45pm-5:30pm Launching on Google Play with Anya Shapina and Phil Shpilberg Deciding which strategy to use to monetize an App launching on Google Play Store is a crucial factor in the equation that determines the financial success of any App. Join Phil Shpilberg and Anya Shapina as they discuss the strategies available to maximize revenues your App can generate.</p> <p>5:30pm-7pm Beer and Pizza  </p> ","visibility":"public"},{"created":1395159633000,"duration":7200000,"id":"171955222","name":"Learn about Dagger: A fast dependency injector for Android and Java","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1398214800000,"local_date":"2014-04-22","local_time":"18:00","rsvp_open_offset":"PT696H","updated":1398291607000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":215,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/171955222/","description":"<p>*PLEASE NOTE: To confirm your seat to this meetup event, please <a href=\"http://www.eventbrite.com/e/learn-about-dagger-a-fast-dependency-injector-for-android-and-java-tickets-11312906207\">RSVP VIA EVENTBRITE</a> </p> <p>For those of us who come from the good old world of Java, we've come to appreciate how <a href=\"http://en.wikipedia.org/wiki/Inversion_of_control\">Inversion of Control</a> with <a href=\"http://en.wikipedia.org/wiki/Dependency_injection\">Dependency Injection</a> has enabled us to write more modular and testable code. But attempts to take the same design approaches to our Android app development have traditionally been shut down in the name of performance and memory footprint. </p> <p>Fortunately for us, Jake Wharton from <a href=\"https://squareup.com/\">Square</a> has offered to tell us about <a href=\"http://square.github.io/dagger/\">Dagger</a>, an open-source IoC/DI framework specifically built for the kinds of constraints we face on Android. You don't want to miss this one!</p> <p><i>Dagger is a new, fast dependency injector for Java and Android. Using dependency injection in your app helps promote clean, modular code that also lends itself very well to testing in both automated and manual fashions. </p> <p>This talk will start with a basic overview of dependency injection including why you would use it and how Dagger differs from other injectors. Following that we will look at what is necessary to use Dagger in the scope of an Android app. We’ll wrap up with some advanced concepts as well as general tips and tricks for achieving maximum utility.</i></p> <p><b>About Jake Wharton:<br/></b> <a href=\"http://jakewharton.com/\">Jake Wharton</a> is an Android engineer at Square, Inc. He is an opinionated developer working on the design and implementation of both libraries and apps. Follow Jake at <a href=\"https://twitter.com/JakeWharton\">@JakeWharton</a>.</p> ","visibility":"public"},{"created":1397595671000,"duration":7200000,"id":"177351802","name":"Learn about Android Accessibility","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1401238800000,"local_date":"2014-05-27","local_time":"18:00","updated":1401295704000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":144,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/177351802/","description":"<p>*PLEASE NOTE: To confirm your seat to this meetup event, please <a href=\"http://www.eventbrite.com/e/learn-about-android-accessibility-tickets-11361090327\">RSVP VIA EVENTBRITE</a>  </p> <p>For our May event, we are extremely fortunate to have Sommer Panage, the <a href=\"https://twitter.com/search?q=%23A11y&amp;src=typd\">#a11y</a> tzar at Twitter, share her passion for making mobile apps <a href=\"http://en.wikipedia.org/wiki/Accessibility\">accessible</a>!</p> <p>In this session, Sommer will first cover what accessibility is and how it's used. We'll then look at what accessibility features and options are being being used on Android devices today. We'll also discuss what it means to make something accessible from a design/development standpoint. After all that, she'll have us dive into the Android APIs themselves, using live examples and going from the basic contentDescription up to accessibility for custom views via ExploreByTouchHelper. Finally, Sommer will discuss some of the issues her team has hit at Twitter and how they're managing them.</p> <p>Here's a more detailed outline:</p> <p><i>What is Accessibility and why is it important?<br/>- Accessibility philosophy<br/>- Creating and \"equal experience\"<br/>- Highlighting key content<br/>- Knowing your audience</i></p> <p><i>Testing for accessibility<br/>- TalkBack<br/>- Touch Exploration<br/>- D-pad Testing (Focus testing)</i></p> <p><i>Basic Accessibility in Android<br/>- contentDescription<br/>- focusable and nextFocus</i></p> <p><i>Fine tuning Accessibility for Android<br/>- importantForAccessibility<br/>- accessibilityLiveRegion<br/>- labelFor</i></p> <p><i>Accessibility for Custom Views<br/>- AccessibilityDelegate<br/>- ExploreByTouchHelper<br/>- Dealing w/ Touch Events</i></p> <p><i>Accessibility at Twitter</i></p> <p><b>About Sommer Panage</b></p> <p>Sommer Panage is currently the lead for Mobile Accessibility on iOS and Android at Twitter. Before moving into this role, she worked on various iOS projects such as DMs and Anti-spam. Prior to coming to Twitter, Sommer worked on the iOS team at Apple. She earned her BA in Psychology and MS in Computer Science at Stanford University. In her free time, Sommer enjoys performing as an aerialist, playing her flute, and traveling. You can follow her at <a href=\"https://twitter.com/sommer\">@sommer</a>.</p> ","visibility":"public"},{"created":1403309383000,"id":"190326022","name":"Google I/O Breakfast Viewing @Twitter","date_in_series_pattern":false,"status":"past","time":1403708400000,"local_date":"2014-06-25","local_time":"08:00","updated":1406141223000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":131,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/190326022/","description":"<p><b>TO CONFIRM YOUR SPOT, <a href=\"http://www.eventbrite.com/e/google-io-breakfast-twitter-tickets-11999814769\">PLEASE RSVP HERE</a></b></p> <p>Didn’t win an invite to Google I/O? Want to check out the keynote? Why watch it alone, when you can be in good company?</p> <p>Come mingle with other Android devs and fans, and watch the Google I/O Keynote on the big screen at Twitter. </p> <p>Doors will open from 8:00am-9:15am</p> <p><b>Agenda:</b></p> <p>• Breakfast &amp; Networking | 8:00am - 9:00am</p> <p>• Twitter Welcome | 8:45am</p> <p>• Keynote | 9:00am - 11:00am</p> <p>• Event Close | 11:30am</p> <p><i>*Note: Press is not admitted into these events; please e-mail [masked] if you have any questions. Twitter reserves the right to refuse entry to this event. Twitter also reserves the right to remove individuals from Twitter's premises for disruptive or disorderly behavior, or for any other reason in Twitter's sole discretion.</i></p> ","visibility":"public"},{"created":1403210962000,"duration":8100000,"id":"190081972","name":"Android SyncAdapter - Explained","date_in_series_pattern":false,"status":"past","time":1406077200000,"local_date":"2014-07-22","local_time":"18:00","updated":1408125837000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":164,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/190081972/","description":"<p>*PLEASE NOTE: To confirm your seat to this meetup event, please <a href=\"http://www.eventbrite.com/e/android-syncadapter-explained-tickets-12282821249\">RSVP VIA EVENTBRITE </a></p> <p><a href=\"http://developer.android.com/training/sync-adapters/creating-sync-adapter.html\">Sync Adapters</a> are the Android framework's super-powered mechanism for asynchronously synchronizing data between mobile devices and remote data stores. Sync Adapters optimize radio use globally, across applications, while safely managing the credentials necessary for validation with the remote service. They are a smart, safe and elegant way for an application to  merge data into the cloud.</p> <p>In this session, Blake Meike, a co-author of several Android books and a frequent speaker on Android, will cover the Sync Adapter, its cousin the  Account Manager and their relationship to ContentProviders. He'll take  a deep dive into the framework architecture and demonstrate its use in practical code.</p> <p>Although the talk will be accessible to developers with even a basic understanding of Android an understanding of ContentProviders and BoundServices will help you grasp the finer details.</p> <p>Here's what you can expect to see:</p> <p>* Review of Android Bound Service Architecture<br/>* Review of the Content Providers and Resolvers<br/>* Introduction the Android Accounts<br/>* Introduction to the Account Manager<br/>* Account Manager Architecture <br/>* Details and implementation of an Account Manager <br/>* Introduction to the Sync Manager <br/>* Sync Manager Architecture <br/>* Details and implementation of an Sync Manager<br/>* Content Provider integration</p> <p><b>About Blake Meike</b></p> <p>Blake Meike is a passionate engineer, code poet and, a founding member of Twitter University. Before coming to Twitter, Blake taught nearly a thousand people the art of writing Android apps that aren't toys, as an Instructor at Marakana. He has more than 20 years of coding experience, most of it with Java, building systems as large as Amazon's massively scalable AutoScaling service and as small as a pre-Android OSS/Linux and Java based platform for cell-phones. He is co-author of O'Reilly's bestselling \"Programming Android\" and Wiley's new \"Enterprise Android\". He holds a degree in Mathematics and Computer Science from Dartmouth College and lives in San Francisco Bay Area.</p> ","visibility":"public"},{"created":1410986730000,"id":"207874992","name":"Android UI Design Patterns and Anti-Patterns","rsvp_limit":150,"date_in_series_pattern":false,"status":"past","time":1411520400000,"local_date":"2014-09-23","local_time":"18:00","updated":1411536516000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":17845992,"name":"Pubnub","lat":37.78340530395508,"lon":-122.39935302734375,"repinned":false,"address_1":"725 Folsom St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/207874992/","description":"<p>Join us for a discussion on Android UI patterns and anti-patterns at SF Android with John Hammink. John will start with an overview of the fundamentals, briefly covering the Android design philosophy, as well as Google's design philosophy. He'll also take a quick look at a few key resources for building beautiful, user friendly apps. The rest of the presentation will be interactive, as John will ask guests for some of their favorite and least-favorite Android apps before going through them with the group to see if guests can spot the various patterns and anti-patterns in each one. This talk is focused on UI design, and is aimed at designers, as well as engineers who would like to pick up some best practices for creating user friendly Android apps.</p> <p><b>About John Hammink</b></p> <p>John Hammink is a design-driven engineer and teacher with 17 years of experience working across the board in the technology space. He has contributed design, development, and QA at ground-zero for many successful products at companies like Mozilla, Skype, and Nokia.</p> <p>Prior to working with NewCircle as an instructor and course author, John worked at Mozilla where he led Mobile QA and contributed early development and UX input to Mozilla's Firefox OS.</p> <p>He’s also a digital artist and musician. </p> ","visibility":"public"},{"created":1415924449000,"duration":13500000,"id":"218670824","name":"Scaling Android Development - live from AnDevCon","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1416534300000,"local_date":"2014-11-20","local_time":"17:45","updated":1416591880000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":76,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/218670824/","description":"<p>Don't miss your chance to hear insights from Cyanogen Inc, Twitter, Square, Amazon, Eventbrite and NewCircle on scaling Android development!</p> <p>Join us at <a href=\"http://www.andevcon.com/\">AnDevCon</a> this Thursday to enjoy a bit of networking, drinks and appetizers before we kick off an awesome interactive panel discussion diving deep into  Android development at scale.  No pass? No worries. The Networking Reception is free and open to all SFAUG members who register for an Exhibition Hall pass on the AnDevCon website. Registration details below. </p> <p><b>The Panel Discussion:</b></p> <p>Developing products for millions of users brings unique technical and management challenges. Hear from developers in the trenches on the unique considerations and lessons learned developing, designing and supporting Android applications with millions of users. </p> <p>We'll kick off the event with a few choice topics from the moderators to get things warmed up, before opening it up to the audience for all your burning questions. We'll be live-streaming this event, and using Google Moderator to allow members in the audience, as well as online viewers to <b><a href=\"https://www.google.com/moderator/#16/e=211a12\">submit and vote on questions for the panel</a></b>. </p> <p><b><br/></b></p> <p><b>Submit Questions for the Panel:</b> <a href=\"http://bit.ly/panelQA\"><a href=\"http://bit.ly/panelQA\" class=\"linkified\">http://bit.ly/panelQA</a></a></p> <p><b>Live-Stream:</b> <a href=\"http://bit.ly/scalingandroid\"><a href=\"http://bit.ly/scalingandroid\" class=\"linkified\">http://bit.ly/scalingandroid</a></a></p> <p><b>Your Speakers:</b></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/5/8/f/0/600_431662768.jpeg\" /></p> <p><a href=\"https://www.linkedin.com/pub/howard-harte/28/191/89b\">Howard Harte</a> is the Director of Engineering for <a href=\"https://cyngn.com/\">Cyanogen Inc</a>, the company behind Cyanogenmod -  the best-known aftermarket OS for Android devices. </p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/5/3/9/9/600_431541401.jpeg\" /></p> <p><a href=\"http://jakewharton.com/\">Jake Wharton</a> is an Android engineer at <a href=\"https://squareup.com/\">Square, Inc</a>. He is an opinionated developer working on the design and implementation of both libraries and apps. Follow Jake at <a href=\"https://twitter.com/JakeWharton\">@JakeWharton</a>. </p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/7/6/1/8/600_431670232.jpeg\" /></p> <p><a href=\"https://twitter.com/tsmith\">Ty Smith</a> is a Sr. Android Engineer on the mobile platform team at <a href=\"https://twitter.com/\">Twitter</a> developing feature filled SDKs, including Crashlytics. Having contributed to numerous large-scale apps, Ty now works on <a href=\"https://dev.twitter.com/products/fabric\">Twitter Fabric</a>, a new-breed of SDK giving developers the easiest way to build the best apps at scale.</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/5/3/8/a/600_431541386.jpeg\" /></p> <p><a href=\"https://twitter.com/_juandg\">Juan Gomez</a>  is a Sr. Android Engineer at <a href=\"https://www.eventbrite.com/\">Eventbrite</a>, where he enjoys creating apps and services that help connect millions of people around the world with the events and live experiences they care about the most. Juan has spoken on Mobile Development topics at AnDevCon, and PyCon 2014, Mobile+Web DevCon, KCDC, Iowa Code Camp, among others. </p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/b/5/a/0/600_431686496.jpeg\" /></p> <p><a href=\"https://twitter.com/mikefhines\">Mike Hines</a> is a Developer Evangelist at the Amazon where he has written mobile app test criteria, attended and judged at hackathons, is a prolific blogger for Amazon Appstore, and has represented Amazon at AnDevCon, SXSW and other major events. Moving forward, Mike hopes to connect with mobile app developers and to help them be successful with their apps and bring their feedback back to Amazon to continuously improve their developer experience.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/d/5/b/5/600_431514709.jpeg\" /></p> <p><a href=\"https://thenewcircle.com/expert/dave_smith,20690.html\">Dave Smith</a> is the lead engineer for mobile and embedded development at <a href=\"http://www.doubleencore.com/\">Double Encore</a> where he's worked on many large-scale apps for sports and broadcasting. He's also the author of <a href=\"http://www.apress.com/mobile/android/9781430263227\">Android Recipes</a>. As an instructor for <a href=\"https://thenewcircle.com/\">NewCircle</a>, Dave has trained development teams in Android at Fortune 500 companies around the nation. </p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/a/a/7/d/600_431683645.jpeg\" /></p> <p><a href=\"https://thenewcircle.com/expert/larry_schiefer,25019.html\">Larry Schiefer</a> is CTO at <a href=\"http://hiqes.com/\">HiQES LLC</a>, a company focused on embedded, mobile, and connected software development. He's also a recognized <a href=\"https://developers.google.com/experts/\">Google Developers Expert</a> in Android, has delivered multiple talks at AnDevCon, and as has taught embedded Android courses to development teams around the world as an instructor for <a href=\"https://thenewcircle.com/\">NewCircle</a>. </p> <p><b>Event Schedule:</b></p> <p>• 5:45pm - AnDevCon Networking Reception begins. See registration details below.</p> <p>• 7:30pm - Doors open for panel discussion</p> <p>• 7:45pm - Panel discussion begins</p> <p><b>Important Details:</b></p> <p>• You must <b>register with AnDevCon</b> to get your free pass to attend the networking event. Select \"Exhibition Hall Admission\". Use code \"SFUSERGROUP\" to waive the fee: <a href=\"http://bit.ly/1xoVU7d\"><a href=\"http://bit.ly/1xoVU7d\" class=\"linkified\">http://bit.ly/1xoVU7d</a></a></p> <p>• Parking in the Hyatt parking garage is available for $10.00 (with validation)</p> <p>• Be sure to submit your questions for the panel to Google Moderator! <a href=\"http://bit.ly/panelQA\"><a href=\"http://bit.ly/panelQA\" class=\"linkified\">http://bit.ly/panelQA</a></a></p> <p>• Please be aware that we'll be recording video and audio of this event, and that your image might get captured as part of the video.</p> <p>--</p> <p>Organized by <a href=\"https://thenewcircle.com/\">NewCircle</a>, The SF Android User Group, and <a href=\"http://www.andevcon.com/\">AnDevCon</a>. </p> ","visibility":"public"},{"created":1418673230000,"duration":8100000,"id":"219261570","name":"Building Android SDKs","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1422410400000,"local_date":"2015-01-27","local_time":"18:00","updated":1424456594000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":166,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/219261570/","description":"<p><b>*PLEASE NOTE: To confirm your seat to this meetup event, please <a href=\"https://www.eventbrite.com/e/twitterdev-hosts-sfandroid-building-android-sdks-registration-14333115735\">RSVP VIA EVENTBRITE</a>  <br/></b></p> <p>&lt;b style=\"font-size : 16px\"&gt;Introducing Fabric for Android Apps</b> - Bear Douglas (20 min)</p> <p>Fabric is a new set of free tools and services for mobile developers designed to help you make your apps more stable, social, and profitable. In this short presentation, we'll give you an overview of Fabric's SDKs for Android, including Crashlytics, Twitter, and MoPub- and cover how Fabric can help you tackle big issues like device fragmentation and growth outside just the US.</p> <p><b>Building Fabric SDK for Android</b> - Israel Camacho and Ty Smith (60 min)</p> <p>The Android app ecosystem is an international phenomenon. Developers need better tools now, more than ever, and the number of third-party SDKs is also growing to meet the developer's needs. Unfortunately, many of these SDKs are poorly developed and extremely difficult to use. In fact, at Twitter on the Fabric team, we've detected a significant percentage of issues caused by third-party SDKs.</p> <p>Fabric and Crashlytics  is well-known for its focus on SDK quality, and has been deployed on billions of devices. In this session, attendees will learn the skills to develop and distribute SDKs for Android. We’ll cover an overview of Fabric, deep dive into technical decisions we made, and present the learnings on developing an SDK for stability, testability, performance, overall footprint size, and, most importantly, exceptional ease of implementation. Over the course of the session, we'll develop a simple but well-architected SDK and uncover and explain many of the challenges we encountered when building SDKs at Twitter. Topics include device feature detection, supporting multiple application types (from Widgets to Services to Foreground GUI applications), API design, deploying artifacts, and coding patterns to support developer customization. We'll conclude with advanced topics, from less-known but very useful tricks to minimizing impact on application start-up time to reducing memory footprint and persistent CPU use.</p> <p><i>*Note: No press will be admitted to this event; please e-mail <a href=\"mailto:[masked]\">[masked]</a> if you have any questions. Twitter reserves the right to refuse entry to this event. Twitter also reserves the right to remove individuals from Twitter's premises for disruptive or disorderly behavior, or for any other reason in Twitter's sole discretion.</i></p> <p><b>About Ty Smith</b></p> <p>Ty Smith is a Sr. Software Engineer building the Android Fabric SDKs at Twitter. Ty is a regular community contributor, organizing events like Meatup and speaking regularly at AnDevCon, Droidcon, and many other conferences around the world.<br/>Prior to Twitter, Ty worked on the Evernote App and SDK, cofounded Recapp, a social sports news startup, lead the engineering effort on Powow Text Messaging on Android which was acquired by Sprint, and built Zagat for Android which was acquired by Google. Ty holds a B.S. in Software Engineering from the University of Texas. He lives in San Francisco. Follow him at <a href=\"https://twitter.com/tsmith\">@tsmith</a>.</p> <p><b>About Israel Camacho</b></p> <p>Israel is an Android engineer working at Twitter. Passionate about Android, object oriented design principles, testing and agile methodologies. Ex @lookout and @feverup. Android developer since 2009. Israel is the cofounder of Barcelona GDG and is also cofounder of @bubiloop and @androides. Follow him at <a href=\"https://twitter.com/rallat\">@rallat</a>.</p> ","visibility":"public"},{"created":1417652233000,"duration":8100000,"id":"219052691","name":"The Lollipop Task Manager","date_in_series_pattern":false,"status":"past","time":1424829600000,"local_date":"2015-02-24","local_time":"18:00","updated":1424847383000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":195,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/219052691/","description":"<p><b>*PLEASE NOTE: To confirm your seat to this meetup event, please <a href=\"https://www.eventbrite.com/e/sf-android-the-lollipop-task-manager-tickets-15650675592\">RSVP VIA EVENTBRITE</a> </b></p> <p>The Lollipop release of Android includes a tremendously powerful tool for scheduling asynchronous tasks, the <a href=\"https://developer.android.com/reference/android/app/job/JobScheduler.html\">Job Scheduler</a>. This class will explore the JobScheduler in detail and demonstrate its use, with several specific examples. Among the topics addressed will be:</p> <p>* Job Scheduler Architectural overview<br/>* Creating and scheduling tasks<br/>* Power management<br/>* Inter-component communications strategies</p> <p><b>About G. Blake Meike</b></p> <p>Blake is a passionate engineer, code poet and, as of very recently, a founding member of Twitter University. Before coming to Twitter, as an Android Evangelist for Open Source Trainers, Marakana, Blake taught nearly a thousand people the art of writing Android apps that aren't toys. He has more than 20 years of coding experience, most of it with Java, building systems as large as Amazon's massively scalable AutoScaling service and as small as a pre-Android OSS/Linux and Java-based platform for cellphones. He is co-author of O'Reilly's bestselling \"Programming Android\" and Wiley's new \"Enterprise Android.\" He holds a degree in Mathematics and Computer Science from Dartmouth College and lives in San Francisco Bay Area. You can follow him at <a href=\"https://twitter.com/callmeike\">@callmeike</a></p> <p><i>*Note: No press will be admitted to this event; please e-mail <a href=\"mailto:[masked]\">[masked]</a> if you have any questions. Twitter reserves the right to refuse entry to this event. Twitter also reserves the right to remove individuals from Twitter's premises for disruptive or disorderly behavior, or for any other reason in Twitter's sole discretion. Please arrive before 6:30 to ensure admission to the building.</i></p> ","visibility":"public"},{"created":1355186671000,"id":"94880832","name":"Automating Android Build, Test & Continuous Delivery with Jenkins","date_in_series_pattern":false,"status":"past","time":1427850000000,"local_date":"2015-03-31","local_time":"18:00","updated":1428391115000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":266,"venue":{"id":23619946,"name":"Wikimedia Foundation","lat":37.78682327270508,"lon":-122.39966583251953,"repinned":false,"address_1":"149 New Montgomery St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/94880832/","description":"<p><b>There is room at The Wikimedia Foundation for 100 attendees so this event will be first come first serve.</b></p> <p>Android developers strive to ensure that their apps work well across a multitude of OS versions, user languages and hardware configurations.</p> <p>In this talk we will take a look at how Jenkins, the popular continuous integration server, can assist throughout the process of developing a quality Android app that works well on the diversity of devices available.</p> <p>Topics will include automatically setting up the Android SDK and app dependencies on Jenkins, building your app in a consistent environment, finding and reporting on potential code problems, running automated tests across multiple OS versions, locales and device specs, plus app stress testing, followed by deploying your app to your beta testers or end users — all with minimal effort.</p> <p>Whether you're interested in continuously delivering updates for your apps, or just preventing claims of \"it builds on my machine\", we'll show some live demonstrations of how this can be done.</p> <p><b>About Christopher Orr</b></p> <p>Christopher began working as a mobile developer ten years ago in Glasgow, Scotland where he suffered through Windows Mobile and BlackBerry development. After moving to Germany in 2009, he built Android apps at Deutsche Telekom, primarily for pre-install on new T-Mobile phones. Currently he works at iosphere GmbH in Cologne where he helps create award-winning mobile apps for Android and iOS. In his six years as an Android developer, and even longer as a Jenkins user, Christopher has created several Android-related plugins for Jenkins, and contributes to various mobile, testing and SCM plugins.<b><br/></b></p> ","visibility":"public"},{"created":1429226480000,"id":"221899235","name":"Learning RxJava (for Android) by example","date_in_series_pattern":false,"status":"past","time":1433466000000,"local_date":"2015-06-04","local_time":"18:00","updated":1437700796000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":306,"venue":{"id":18302662,"name":"Yelp! HQ","lat":37.7868537902832,"lon":-122.39985656738281,"repinned":false,"address_1":"140 New Montgomery Street, Floor 9","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/221899235/","description":"<p>This talk is aimed at beginners who have heard about RxJava and dabbled with it just a little, but don't yet see what all the fuss is about.</p> <p>The presenter believes strongly that the best way to learn something is to just start doing it. Keeping with that spirit, after an extremely short primer on RxJava and RxAndroid, we will look at implementing real-world use cases in Android, with RxJava.</p> <p><b>About Kaushik Gopal</b></p> <p>Kaushik is the resident Android nerd at Wedding Party, a startup that builds the app you need for your wedding. He is in charge of the Android app right from the stages of translating designs to feature implementation.</p> <p>He also co-hosts the Android developer podcast \"Fragmented\" along with Donn Felker. He loves talking about RxJava on the podcast, even when his listeners complain that he's beaten the topic to death. He relents fearlessly with his fervent adulation of RxJava...</p> ","visibility":"public"},{"created":1433955309000,"duration":8100000,"id":"223154667","name":"Better compression = Faster Networking","date_in_series_pattern":false,"status":"past","time":1438131600000,"local_date":"2015-07-28","local_time":"18:00","updated":1438177289000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":213,"venue":{"id":15231762,"name":"Twitter, Inc.","lat":37.77680206298828,"lon":-122.41691589355469,"repinned":false,"address_1":"1355 Market Street #900","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94103","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/223154667/","description":"<p><b>*PLEASE NOTE: To confirm your seat to this meetup event, please also <a href=\"https://www.eventbrite.com/e/sf-android-better-compression-faster-networking-tickets-17855308709\">RSVP VIA EVENTBRITE</a></b> </p> <p>For our July meetup, we are extremely fortunate to have Colt McAnlis, from Google, come and share his wisdom on Android app network optimizations through effective data compression.</p> <p><i>The two immutable laws of networking performance are simple: <br/></i></p> <p><i>1) Spend less time doing network requests<br/>2) Reduce the size of the requests that you do make.</i></p> <p><i>While the first one is often the topic for most water-cooler and code-checkin debates, the second one can often be the most valuable to focus on. In this talk, Colt McAnlis will introduce some key topics and algorithms for data compression, and tackle specific data items, compressors, and techniques to help your android apps send, and store smaller amounts of data. Your users will thank you!</i></p> <p><b>About Colt McAnlis</b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/2/f/c/600_438540764.jpeg\" /></p> <p>Colt McAnlis is a Developer Advocate at Google focusing on Games and Performance; Before that, he was a graphics programmer in the games industry working at <a href=\"http://us.battle.net/hearthstone/en/\">Blizzard</a>, <a href=\"http://www.halowars.com/\">Microsoft (Ensemble)</a>, and <a href=\"http://www.lucasarts.com/games/swempireatwar/indexFlash.html\">Petroglyph</a>. He’s been an Adjunct Professor at <a href=\"http://www.smu.edu/guildhall\">SMU Guildhall</a>, a <a href=\"https://www.udacity.com/course/cs255\">UDACITY</a> instructor (<a href=\"https://www.udacity.com/course/ud825\">twice</a>), and a <a href=\"http://goo.gl/di4Osg\">Book Author</a>. Recently, he’s been teaching Android Devs the <a href=\"http://goo.gl/4ZJkY1\">Zen of Performance</a>. When he's not working with developers, Colt spends his time preparing for an invasion of giant ants from outer space.</p> <p>You can follow him on<a href=\"https://plus.google.com/+ColtMcAnlis/\"> G+</a>,<a href=\"https://twitter.com/duhroach\"> Twitter</a>,<a href=\"https://github.com/mainroach/\"> Github</a>,<a href=\"https://www.linkedin.com/in/duhroach\"> Linkedin</a>, or his<a href=\"http://mainroach.blogspot.com/\"> Blog</a></p> ","visibility":"public"},{"created":1435206023000,"duration":8100000,"id":"223484985","name":"Live AMA with Dan Bornstein, the creator of Dalvik","date_in_series_pattern":false,"status":"past","time":1440465300000,"local_date":"2015-08-24","local_time":"18:15","updated":1441216602000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":205,"venue":{"id":18302662,"name":"Yelp! HQ","lat":37.7868537902832,"lon":-122.39985656738281,"repinned":false,"address_1":"140 New Montgomery Street, Floor 9","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/223484985/","description":"<p>Whether you want a trip down <a href=\"https://www.android.com/intl/en_us/history/\">the memory lane</a>, or you are curious about the VM that powered Android for so many years, or you simply want to meet one of the great minds that brought Android to life, then you don't want to miss this event!</p> <p>Dan Bornstein, the creator of <a href=\"https://en.wikipedia.org/wiki/Dalvik_(software)\">Dalvik</a>, generously offered to hang out with us and answer any questions we may have! Our first AMA!</p> ","visibility":"public"},{"created":1440785554000,"id":"224952292","name":"Android Development Like a Pro","date_in_series_pattern":false,"status":"past","time":1443574800000,"local_date":"2015-09-29","local_time":"18:00","updated":1443677439000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":256,"venue":{"id":24084530,"name":"Twitter","lat":37.77629089355469,"lon":-122.41624450683594,"repinned":false,"address_1":"875 Stevenson Street","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/224952292/","description":"<p><b>*PLEASE NOTE: To confirm your seat to this meetup event, please also <a href=\"http://androidlikeapro.eventbrite.com\">RSVP VIA EVENTBRITE</a> </b></p> <p>The Android SDK has changed much since its first version. Every new version comes with many new APIs. However, there is no perfect API, some do too much under the hood, others couple your classes to the context, others have more lifecycle events than you have years in your life.</p> <p>The talk will show how to make your app scalable, your code clean, your performance optimized and your UI neat. The talk will show in a pragmatic way the pros and cons of using certain Android APIs, strategies and libraries. It will touch on Fragments, Loaders, AsyncTasks, OOP patterns (mvp vs mvvm vs viper) and styling.</p> <p>This talk is a compendium of my experience in large code bases since I started to work in Android in 2009.</p> <p><b>About Israel Ferrer Camacho</b></p> <p><img src=\"http://static.sched.org/a6/2148009/avatar.jpg.320x320px.jpg\" /></p> <p><b><br/></b>Israel Ferrer Camacho is an Android engineer working at Twitter. Passionate about Android, object oriented design principles, testing and agile methodologies. Ex @lookout and @feverup. Android developer since 2009. Israel is the co-founder of Barcelona GDG and is also co-founder of @bubiloop and @androides. </p> <p>Twitter : @rallat</p> ","how_to_find_us":"Twitter has two buildings, this event will be hosted in the building across Stevenson.","visibility":"public"},{"created":1445388755000,"id":"226198822","name":"Persistent Queues with Tape","rsvp_limit":123,"date_in_series_pattern":false,"status":"past","time":1445995800000,"local_date":"2015-10-27","local_time":"18:30","updated":1446021689000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":100,"venue":{"id":23960017,"name":"Leanplum Penthouse Floor","lat":37.76756286621094,"lon":-122.41114044189453,"repinned":false,"address_1":"1550 Bryant Street","city":"94103","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/226198822/","description":"<p>Processing background tasks in Android apps can be tricky. You need to think about cases such as low memory situations, running out of battery and flaky networks.</p> <p>​Persisting tasks to disk helps you reliably handle such edge cases. Enter Tape, a collection of queue related classes. This talk will be primarily about it's core component, QueueFile — a lightning fast, transactional, persistent file-based FIFO.</p> <p>​For new users, we'll compare it to alternatives and dig into it's API with real world examples.</p> <p>For veterans, we'll take a deep dive into it's technical implementation and see how it guarantees both reliability and efficiency.</p> <p><b>About Prateek Srivastava</b></p> <p>I work on the Platform team at Segment, mostly on our client libraries.​</p> <p>I enjoy working with Android and open source! I've created libraries such as rx-preferences and Dart, and frequently contribute to others such as Tape and AssertJ-Android.​</p> <p>Outside of Android, I've been hacking tons on Go and iOS (and more reluctantly, JavaScript).</p> <p>Occasionally, I write on my <a href=\"http://f2prateek.com\">blog</a> and <a href=\"https://twitter.com/f2prateek\">Twitter</a>.</p> ","visibility":"public"},{"created":1446263567000,"duration":8100000,"id":"226436337","name":"Developing Robotic Toys with Android","date_in_series_pattern":false,"status":"past","time":1447984800000,"local_date":"2015-11-19","local_time":"18:00","updated":1447993877000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":143,"venue":{"id":24167024,"name":"HotelTonight","lat":37.78351974487305,"lon":-122.40811157226562,"repinned":false,"address_1":" 901 Market Street, ste. 310","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/226436337/","description":"<p><img src=\"http://photos3.meetupstatic.com/photos/event/1/c/1/7/600_443887191.jpeg\" /></p> <p>As we are gearing up for the holidays, we thought it'd be fun to invite the folks behind <a href=\"https://anki.com/en-us/overdrive/starter-kit\">Anki OverDrive</a>, to tell us how they got their crazy-fast toy-race-cars to work with Android. Thanks to Damjan Stulic, Brian and Tony from Anki answered our call.</p> <p><i>If you are a company selling hardware, ignoring Android is not an option. In 2014, <a href=\"https://anki.com/en-us\">Anki</a> started the process of developing Anki Drive on Android. Rather than \"port\" Anki Drive directly from iOS to an Android Java app, we built a cross-platform app with Android as our development platform. To run on Android, we combined platform-specific technologies such as Bluetooth Low-Energy (BLE) and Wifi, together with our existing C++ game engine and a Unity/C# interface. We will present a brief history of our development process, focusing on problems that were unique to Android and how the solutions influenced our the design of Anki Overdrive, the cross-platform successor to Anki Drive.</i></p> <p>This event will be hosted by friendly folks from <a href=\"https://www.hoteltonight.com/\">Hotel Tonight</a> who generously offered to also sponsor the food and drinks. Thanks Maria!</p> <p><b>About Brian Chapados</b></p> <p>Brian was a biophysics scientist, before waking up one day and realizing that 90% of everything we know is wrong. He then moved to San Francisco and joined the startup circus.</p> <p><b>About Tony Xu</b><br/>Tony was working in mobile social games specializing in Android. He decided that consumer robotics was a new exciting field and moved to San Francisco and also joined the startup circus.</p> <p><b>About Damjan Stulic</b><br/>Damjan worked boring IT job for 6 years, before waking up one day and deciding that making games is way more fun than playing them. He then moved to San Francisco and, wait for it..., also joined the startup circus.</p> <p><b>About Hotel Tonight</b></p> <p>HotelTonight makes it remarkably easy to book great hotels at amazing last-minute rates on your mobile device, for tonight, tomorrow and next week.  Mobile is about being on the go and in the moment, which is why we focus on the last-minute space – and we do it better than anyone else in the world.  Hand-picked hotels, 10-second 3-tap bookings, and incredible deals on rooms that would otherwise go empty.</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/1/b/e/0/600_443887136.jpeg\" /></p> ","visibility":"public"},{"created":1446138175000,"duration":10800000,"id":"226399275","name":"Gradle and Android Holiday Meetup @ Google SF","date_in_series_pattern":false,"status":"past","time":1450404000000,"local_date":"2015-12-17","local_time":"18:00","updated":1450421314000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":228,"venue":{"id":953249,"name":"Google San Francisco","lat":37.78980255126953,"lon":-122.38975524902344,"repinned":false,"address_1":"345 Spear Street","address_2":"Duboce Triangle on 4th Floor","city":"San Francisco","country":"us","localized_country_name":"USA","phone":"415-736-0000","zip":"94105","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/226399275/","description":"<p><b>*PLEASE NOTE: To confirm your seat to this meetup event, please also <a href=\"http://www.eventbrite.com/e/gradle-and-android-holiday-meetup-at-google-sf-tickets-19432624503\">RSVP via EventBrite</a>.</b></p> <p>We are teaming up with Gradle, Google, Twitter, Udacity, and the <a href=\"http://www.meetup.com/Bay-Area-Gradle-Users-Meetup/\">Bay Area Gradle User Group</a> to host our Holiday Meetup Party. </p> <p>This special evening is dedicated to our meetup members, users, and subscribers. Join us for our last meetup of 2015 and celebrate the holidays. What to expect from the event? There will be talks on Gradle and Android with industry leading speakers, with plenty of food, drinks and time dedicated to Gradle Q&amp;A, networking, and socializing.</p> <p>Talks by:<br/>* Hans Dockter (Gradle co-founder and Gradle Inc CEO)<br/>* Ty Smith and Yohan Hartanto (Android Engineers on Twitter Fabric team)<br/>* Bruno Bowden (Data Collective Equity Partner)</p> <p>Announcements by:<br/>* Peter Lubbers (Google Developer Advocate)<br/>* Saša Gargenta (Twitter University)<br/>* Rooz Mohazzabi (Gradle Inc Development Support)</p> <p><b>Talk: What's New with Gradle and the Android Build System</b><br/>By: Hans Dockter, The founder of Gradle and CEO of Gradle Inc</p> <p><b>Talk: Better Android Development with Kotlin and Gradle</b><br/>By: Ty Smith and Yohan Hartanto, Android Engineers at Twitter, working on the Fabric developer tools.</p> <p>In this talk, Yohan and Ty will walk you through setting up and using Kotlin with Gradle to streamline your workflow for Android development, both within the build tool phase and within the application itself. After a brief overview of Kotlin, we'll dive into how it can be used with Gradle to accelerate Android Development with a consistent language.</p> <p><b>Talk: Sharing Java code across Android &amp; iOS with Gradle</b><br/>By: Bruno Bowden, Data Collective</p> <p>As mobile apps become more complex, it becomes increasingly valuable to share code across Android and iOS. This talk will discuss how to run Java code on iOS, using the J2ObjC Gradle Plugin. This is based on Google's J2ObjC tool (Java to Objective-C transpiler). The technology was used to share 70% of the code across iOS and Android for Google's Inbox app.</p> <p><b>Sponsors</b></p> <p>Our generous friends at Google are hosting and sponsoring the event with food and drinks. The event is also sponsored by Udacity, the Android and Gradle self-paced training provider.</p> ","visibility":"public"},{"created":1456994893000,"duration":9000000,"id":"229310116","name":"Two-for-one: Romain Guy on Physically-Based Rendering & Stephan Branczyk on AR","date_in_series_pattern":false,"status":"past","time":1458694800000,"local_date":"2016-03-22","local_time":"18:00","updated":1459461889000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":172,"venue":{"id":24138322,"name":"Autodesk Gallery","lat":37.78925323486328,"lon":-122.40142822265625,"repinned":false,"address_1":"One Market Street - Second Floor","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/229310116/","description":"<p>For our March event we will have two featured speakers plus a lightning talk. This is going to be a fun evening!</p> <p><b>Physically-Based Rendering and Taming Aliasing</b> with Romain Guy</p> <p>Physically-Based Rendering has become increasingly popular over the past few years and found its way in many game engines such as Frostbite 3, Unreal Engine 4 and Unity 5. Once available only in offline renderers, PBR techniques can now be used on mobile and on the web. In this talk you will learn what lighting techniques are behind PBR. Beautiful lighting is however nothing without a stable image, particularly in sensitive environments such as VR. Flickering and aliasing can ruin the experience and we will discuss various solutions that you can use to fight them.</p> <p><b>About Romain Guy</b></p> <p>Romain is a graphics and user interface programmer at Google and worked on the Android framework team for many years. High-quality graphics and physically-based rendering are two of his personal passions that he loves to share with anybody who will listen.</p> <p><b>Developing for the (Android-based) Epson Moverio glasses</b> with Stephan Branczyk</p> <p>We will talk about the potential use cases and general design principles needed to develop for Augmented Reality smart-glasses in general. We will look at the hardware and capabilities of the BT-200, <a href=\"https://tech.moverio.epson.com/en/work/\">BT-2000</a>, and the recently announced Atom-based <a href=\"http://www.gizmag.com/epson-moverio-bt-300-smart-glasses/41988/\">BT-300</a> Epson Moverio glasses. </p> <p>For those of you with existing Android tablet, Android TV, Google Cardboard, Augmented Reality, Unity3D, or Android Java experience, we'll talk about how that experience is directly applicable to the Android-based Moverio platform, but at the same time, we'll talk about the common pitfalls and design mistakes a developer can make designing for that kind of form factor and we'll be dissecting actual examples of applications that have already been published on the Epson Moverio platform and on the Microsoft HoloLens platform.</p> <p><b>About Stephan Branczyk</b></p> <p>Android mobile programming expert and Developer Evangelist for Epson-Moverio AR glasses. He has worked on the Android version of Eat24, a food delivery ordering application. Taught AndroidBootcamps. He organizes and co-organizes several technical meetups in the Bay Area himself. You can follow him on Twitter <a href=\"https://twitter.com/frenchaccent\">@frenchaccent</a>. </p> <p>As a bonus, we will open the evening with a lightning talk:</p> <p><b>Reality capture by Autodesk ReCap on the New Forge Platform</b> with Augusto Goncalves.</p> <p>Bring photos to life with the Autodesk ReCap web service API available on the new Autodesk Forge Platform. This reality capture API is accessible from your device and can be used to produce 3D meshes (point clouds). Bay Area startup, 3D Robotics is already testing the ReCap API to create 3D images of buildings. This lightning talk will feature some samples and code that will help you identify more ways to build out your wildest ideas. <br/>Check out our Forge DevCon on June 15-16 at Fort Mason: <a href=\"http://forge.autodesk.com/conference/.\"><a href=\"http://forge.autodesk.com/conference/\" class=\"linkified\">http://forge.autodesk.com/conference/</a>.</a></p> <p><b>About Augusto Goncalves</b></p> <p>Augusto Goncalves is an API Evangelist at Autodesk since 2008. He works with all sorts of technologies: from classic desktop to modern mobile and web platforms, including JavaScript and NodeJS.<br/><a href=\"http://stackoverflow.com/users/4838205/augusto-goncalvesGithub\"><a href=\"http://stackoverflow.com/users/4838205/augusto-goncalvesGithub\" class=\"linkified\">http://stackoverflow.com/users/4838205/augusto-goncalvesGithub</a></a> <a href=\"https://github.com/augustogoncalvesBlog\"><a href=\"https://github.com/augustogoncalvesBlog\" class=\"linkified\">https://github.com/augustogoncalvesBlog</a></a> <a href=\"http://adndevblog.typepad.com/aec/augusto-goncalves/Twitter\"><a href=\"http://adndevblog.typepad.com/aec/augusto-goncalves/Twitter\" class=\"linkified\">http://adndevblog.typepad.com/aec/augusto-goncalves/Twitter</a></a> <a href=\"https://twitter.com/augustomaia\"><a href=\"https://twitter.com/augustomaia\" class=\"linkified\">https://twitter.com/augustomaia</a></a></p> ","visibility":"public"},{"created":1465443179000,"duration":8100000,"id":"231763485","name":"Dagger 2 - In Practice","date_in_series_pattern":false,"status":"past","time":1472605200000,"local_date":"2016-08-30","local_time":"18:00","updated":1472658271000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":193,"venue":{"id":24469929,"name":"Pandora SF","lat":37.76753616333008,"lon":-122.41118621826172,"repinned":false,"address_1":"1550 Bryant St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/231763485/","description":"<p>Pandora’s Android codebase is 5+ years old. The project was initially developed by a handful engineers who were tasked with creating and delivering new features quickly. Over time, it evolved without a clear dependency management pattern. With a codebase of approximately half a million lines of code, and a growing team continuously developing features, it seemed daunting to suddenly refactor every component to properly utilize a dependency injection framework. Earlier this year Pandora was able to add Dagger 2 to its codebase.  </p> <p>In this talk, Pandora’s engineers will share details on how they managed to successfully refactor the application to use dependency injection while simultaneously continuing development across the app. Additionally, obstacles and solutions along with developed patterns will be shared in the hopes that other app developers take something useful back. Types of Injections, Scopes and Testing are a few of the topics that will be covered. At the end we will host a Q&amp;A.</p> <p><b>About the Speaker: Daniel Santiago, Android Developer @ Pandora</b></p> <p>As an Android developer at Pandora, Daniel works with various aspects of the application including implementing new features and scaling it to support future work. <br/>Prior to joining Pandora, Daniel was a student at the University of Puerto Rico, Mayagüez where he completed his Software Engineering degree and through his freelancing experience learned developing apps for the Android system.<br/>Daniel also has a passion for video games, currently playing Overwatch with various friends he looks forward for competitive matches as a way to distract his minds from the usual hard thinking work.</p> ","visibility":"public"},{"created":1475574651000,"id":"234613123","name":"A Walkthrough of Proguard","date_in_series_pattern":false,"status":"past","time":1476235800000,"local_date":"2016-10-11","local_time":"18:30","updated":1476420357000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":134,"venue":{"id":17845992,"name":"Pubnub","lat":37.78340530395508,"lon":-122.39935302734375,"repinned":false,"address_1":"725 Folsom St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/234613123/","description":"<p>ProGuard is the optimizer and obfuscator for Java bytecode that is integrated in the Android SDK. It makes applications smaller, faster, and a bit more difficult to reverse engineer. In this presentation, Eric will briefly present some of its technical background. More practically, he'll show the typical improvements that you can expect. He'll also discuss some possible pitfalls and tips to get the best results.</p> <p>About the Speaker: Eric Lafortune, Founder of Guardsquare Eric is the creator of the open-source optimizer and obfuscator ProGuard, and its commercial extension DexGuard. He is obsessed with making applications more compact, more efficient, and better protected against attacks. He is the founder and CTO of GuardSquare, where they put this obsession to good use.</p> ","visibility":"public"},{"created":1478623259000,"duration":9000000,"id":"235441559","name":"Timing is Everything: Smooth RecyclerView Scrolling with Prefetch","date_in_series_pattern":false,"status":"past","time":1479348000000,"local_date":"2016-11-16","local_time":"18:00","updated":1479409131000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":212,"venue":{"id":24817034,"name":"Google Launchpad","lat":37.789527893066406,"lon":-122.39427947998047,"repinned":false,"address_1":"301 Howard","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/235441559/","description":"<p><b><a href=\"https://docs.google.com/forms/d/1wZerFf7J7KozSYaYJzbKr8QCykEeF--kCWkHPE5-VYc/viewform?edit_requested=true\">YOU MUST RSVP HERE TO ATTEND</a></b></p> <p>Join us at the Google Launchpad space to learning about all the performance improvements coming to RecyclerView. Food and drinks will be provided.</p> <p><b>About the speakers:</b></p> <p><b>Yigit Boyar<br/></b>Yigit works on building UI widgets and improving layout performance as part of Android UI Toolkit Team. Prior to Google, he was the Android Engineering Lead at Path.com where he was mostly focused on building application architecture, real time camera filters and buttery smooth UI performance. He received his bachelor's degree in computer engineering from Middle East Technical University, Turkey.</p> <p><b>Chris Craik</b></p> <p>Chris Craik works on graphics and UI performance in the Android UI toolkit team. He works to help apps achieve smooth scrolling and animations with optimizations and performance tools. Prior to working on the Android UI toolkit, he worked on Android WebView graphics, in the pre-Chromium days.</p> <p><b><a href=\"https://docs.google.com/forms/d/1wZerFf7J7KozSYaYJzbKr8QCykEeF--kCWkHPE5-VYc/viewform?edit_requested=true\">YOU MUST RSVP HERE TO ATTEND</a> </b></p> ","visibility":"public"},{"created":1481002272000,"duration":8100000,"id":"236061735","name":"2-for-1: Android CI at Yelp and Fast Android Builds with Gradle+Buck from Uber","rsvp_limit":295,"date_in_series_pattern":false,"status":"past","time":1485914400000,"local_date":"2017-01-31","local_time":"18:00","updated":1486194149000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":295,"venue":{"id":25023869,"name":"Yelp HQ","lat":37.786659240722656,"lon":-122.39997100830078,"repinned":false,"address_1":"140 New Montgomery St, 8th floor","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/236061735/","description":"<p><b>Continuous Integration with Android (Yelp)</b></p> <p>As teams grow, having a mature continuous integration setup is crucial for code quality: you must be able to quickly and reliably verify that a given branch passes your tests. However, creating such a setup for Android can be painful or even impossible for smaller teams. At Yelp, our Android CI runs in the cloud and can be easily scaled as our needs grow. In this talk I’ll cover how we created our setup with Amazon EC2, Docker, and Firebase Test Lab.</p> <p><i>About the speaker</i></p> <p>Coltin Caverhill is passionate about empowering other developers. As a member of Yelp's Android infrastructure team, he helps build a better future for testing, architecture, and collaboration. An avid gamer, he probably plays too much Factorio.</p> <p><b>Lightning fast Android builds with Gradle + Buck (Uber)</b></p> <p>Gradle is the typical build system of choice for android development, but it's performance tends to degrade as code bases become more complex. There exist alternate build systems like Buck (built by Facebook) that can build significantly faster than Gradle for Android, but they can be hard to migrate to and maintain. What if it is possible to have both the simplicity of expressing build logic in Gradle and also the fast build speeds of Buck? In this talk, Gautam will go over the open source OkBuck Gradle plugin and how it can help improve your android build speeds without having to learn and maintain a new build system.</p> <p><i>About the speaker</i></p> <p>Gautam Korlam leads the Android Developer Experience Team at Uber. He is very passionate about tooling, infrastructure and build systems for building Android apps at scale.</p> ","visibility":"public"},{"created":1485847689000,"duration":8100000,"id":"237334450","name":"2-for-1: Extremely Fast Android Builds with Gradle & Notifications with Slack","date_in_series_pattern":false,"status":"past","time":1490749200000,"local_date":"2017-03-28","local_time":"18:00","updated":1490908299000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":298,"venue":{"id":25095230,"name":"Google Developers Launchpad Space","lat":37.789527893066406,"lon":-122.39427947998047,"repinned":false,"address_1":"301 Howard St","city":"4th floor","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/237334450/","description":"<p>For our March event, we are super thrilled to have<i> three</i> amazing speakers and <i>two</i> talks! </p> <p>We are extremely grateful to Google for hosting us at their <a href=\"https://developers.google.com/startups/space\">LaunchPad space </a>in SF where developers and startups can receive free technical training, one-on-one mentoring and more! <a href=\"https://goo.gl/forms/kllPDSpCSzuJOX7I2\">Subscribe here</a> to receive biweekly event updates from them.</p> <p><b>Extremely Fast Android Builds with Gradle (60 minutes)</b></p> <p>Android build performance is top of mind for many Android developers. Learn about the latest performance features in the Android build system from Xavier Ducrohet, Lead of Android Developer Tools and Hans Dockter, Founder of Gradle.</p> <p>Over the last six months, the Gradle team has focused on improving Gradle core performance where it is most relevant for Android builds. The Android tools team just published an early preview of their upcoming Android Gradle plugin 2.5.0, which comes with significant performance improvements.</p> <p>In this meetup, you will learn in-depth about all the improvements. Learn also about what more to expect in the near future. Every Android build will benefit from those improvements, but some more than others. Therefore we will also talk about how to structure and configure your Android builds to get the best results.</p> <p><i>Speaker Bios</i></p> <p>Hans Dockter is the founder and project lead of the Gradle build system and the CEO of Gradle Inc. a company that provides training, support and consulting for Gradle and all forms of enterprise software project automation in general. Hans is a thought leader in the field of build automation and has successfully been in charge of numerous large-scale enterprise builds. He is also an advocate of Domain Driven Design, having taught classes and delivered presentations on this topic together with Eric Evans. In the earlier days, Hans was also a committer for the JBoss project and founded the JBoss-IDE.</p> <p>Xavier joined Google in 2007 to work on Android. He’s now the lead for the SDK and Developer Tools for Android, leading the effort to unify Android apps around a single Gradle-based build system, deeply integrated with Android Studio, an IntelliJ-based IDE for Android.</p> <p><b>Push Notifications Or: How I Learned to Stop Worrying and Love NotificationCompat.Builder (30 minutes)</b></p> <p>Push notifications are important in many ways to mobile applications but crafting them can be slightly overwhelming. At first glance, the API is quite straightforward but the complexity can come fast and furious as you dig in deeper. This talk will give folks a quick look at how the NotificationCompat.Builder API works, dig into some more advanced usages like notification groups and in-line replies, as well as provide a few troubleshooting tips.</p> <p><i>Speaker Bio</i></p> <p>Mike Worth, Android Engineer at Slack<br/>Mike's been working with Android since the early days of Donut. Originally doing radio interface layer work for the telephony team of a small Vancouver services company, Mike has since moved on to focusing on user facing Android apps.<br/>Having lived through the dark days of non-standard OEM ListView implementations and pre-Holo theme disarray, Mike now finds himself serving as the Android push notification specialist at Slack. Through a mixture of the dark arts, trial and error and a dash of luck, he's come away with some knowledge about what works and what doesn't and is eager to share that information with the Android community at large!</p> ","visibility":"public"},{"created":1487792692000,"duration":8100000,"id":"237910039","name":"Advanced RxJava through concrete Android examples","rsvp_limit":300,"date_in_series_pattern":false,"status":"past","time":1493168400000,"local_date":"2017-04-25","local_time":"18:00","updated":1493575410000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":300,"venue":{"id":25095230,"name":"Google Developers Launchpad Space","lat":37.789527893066406,"lon":-122.39427947998047,"repinned":false,"address_1":"301 Howard St","city":"4th floor","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/237910039/","description":"<p>For our April event, we're demystifying some of the most advanced RxJava features, learning through a real, concrete Android use case: uploading videos. </p> <p>We are extremely grateful to Google for hosting us at their <a href=\"https://developers.google.com/startups/space\">LaunchPad space </a>in SF where developers and startups can receive free technical training, one-on-one mentoring and more! <a href=\"https://goo.gl/forms/kllPDSpCSzuJOX7I2\">Subscribe here</a> to receive biweekly event updates from them.</p> <p><b>About the speaker:</b></p> <p>Jag Saund, an Android Engineer with over 8 years of experience (pre Cupcake), specializes in the Android media framework. He's worked on the audio and video components of Tango, Amazon, Upthere, and Periscope. With a passion to understand the inner workings of Android, he strives to maximize the platform's potential. Currently, on the Periscope team, he's transitioning the app to MVP and integrating RxJava. In addition to Android's media framework, Jag also worked on several backend services and believes in taking a holistic approach to app development. In his spare time, he enjoys pursuing photography, hiking, and tinkering with hardware projects. </p> <p><b>Topic of the night:</b></p> <p>\"Advanced RxJava through concrete Android examples\"</p> <p>RxJava's growing popularity has developers looking for ways to incorporate it's capabilities into their apps. However, the combination of a steep learning curve, and the lack of practical examples, can make it challenging to leverage advanced functions in the library. This talk uses a complex, practical example to exemplify how RxJava can simplify the process of uploading files and persisting their state within Android. It also explores some of RxJava's more advanced constructs such as subjects, handling and retrying on errors, and publishing events to the UI.</p> ","visibility":"public"},{"created":1489008036000,"duration":8100000,"id":"238274853","name":"An Android Double Feature.","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1496192400000,"local_date":"2017-05-30","local_time":"18:00","updated":1496334559000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":195,"venue":{"id":25023869,"name":"Yelp HQ","lat":37.786659240722656,"lon":-122.39997100830078,"repinned":false,"address_1":"140 New Montgomery St, 8th floor","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/238274853/","description":"<p>We have two great talks planned at Yelp. You won't want to miss these!</p> <p><b>AARAWR! Fantastic bits and where to dex them</b></p> <p>This is the story of how we extracted delicious spaghetti code out of a dinosaur Android codebase to ship a fancy SDK as an AAR. We'll look into what's in an AAR, how we built our own (it's \"just\" a zip task!), how R files work, and how we messed with our own fork of the Multidex library.</p> <p><b>Speaker: Pierre-Yves Ricau</b></p> <p>Android Baker at Square, I enjoy leak-free wine &amp; gluten-full code.</p> <p><b>Binders, Transactions, and Bundles Oh my! </b></p> <p>Yelp's app has traditionally passed data via Intents. Over time this data has grown quite sizable while bundle size limits have decreased. We'll cover Transaction Too Large Exceptions, changes in Android N/O, and how we go about solving these problems across 200+ Activities.</p> <p><b>Speaker: Diego Waxemberg</b></p> <p>A stalwart of Yelp's Android team, Diego is equally adept at recycling views as he is at dominating the pool table. </p> <p><i><br/></i></p> <p><i>Doors open at 6:00pm and security will stop letting people up at 6:30pm.</i></p> ","visibility":"public"},{"created":1490080389000,"duration":8100000,"id":"238582266","name":"Android OS: Thoughts about the future of computing (from Google)","rsvp_limit":250,"date_in_series_pattern":false,"status":"past","time":1498611600000,"local_date":"2017-06-27","local_time":"18:00","updated":1498683483000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":211,"venue":{"id":25121653,"name":"Twilio","lat":37.78801345825195,"lon":-122.39151763916016,"repinned":false,"address_1":"375 Beale Street, Suite 300","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/238582266/","description":"<p>For our June meetup, we are super fortunate to have Benjamin Poiesz, who is a Sr. Product Manager on the Android Framework at Google, who offered to share his thoughts on the future of computing with Android. More importantly, it turns out he is willing to take all of our crazy \"Why'd they do that?\" questions.</p> <p>Additionally, Benjamin will talk about improving Android quality and device performance, and provide more details about what's upcoming in the latest Android version.</p> <p>As far as Benjamin's bio goes, it's enough to say that he \"does Androidy stuff, like all day\" :-)</p> <p>Special thanks goes out to Nikola Novaković for putting this event together and to Twilio for hosting us!</p> ","visibility":"public"},{"created":1502325979000,"duration":7200000,"id":"242424789","name":"Android and Deep Learning","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1506564000000,"local_date":"2017-09-27","local_time":"19:00","updated":1506632458000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":200,"venue":{"id":24817034,"name":"Google Launchpad","lat":37.789527893066406,"lon":-122.39427947998047,"repinned":false,"address_1":"301 Howard","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/242424789/","description":"<p>This presentation focuses on Deep Learning (DL) concepts, such as neural networks, backprop, activation functions, and Convolutional Neural Networks. You'll also learn how to incorporate Deep Learning in Android applications. Basic knowledge of matrices is helpful for this session, which is targeted primarily to beginners.</p> <p><b>About the Speaker:</b></p> <p>Oswald is a former PhD Candidate (ABD) in Mathematics, an education junkie (6 degrees), and an author of 17 technical books (including Angular). He has worked for Oracle, AAA, and Just Systems of Japan, along with various startups. He has lived/worked in 5 countries on three continents, and in a previous career he worked in South America, Italy, and the French Riviera, and has traveled to 70 countries on six continents. He has worked from C/C++/Java developer to CTO, comfortable in 4 languages, and wants to become fluent in Japanese. Currently he is a consultant and provides training in Android, Angular, and Deep Learning.</p> <p><b>Where:</b> </p> <p>Launchpad Space (<a href=\"https://maps.google.com/?q=4th+floor,+301+Howard,+SF&amp;entry=gmail&amp;source=g\">4th floor, 301 Howard, SF</a>)</p> <p><a href=\"https://mail.google.com/mail/u/1?ui=2&amp;ik=2da1788163&amp;attid=0.0.1&amp;th=15e8205688ec5119&amp;view=fimg&amp;rm=15e8205688ec5119&amp;sz=w1600-h1000&amp;attbid=ANGjdJ-sbMye3fxJIf1AXHMtUceQjksXjcUlHx9p_Mz14jiYCRg98D9S4xVgcGrr5FkMPIwt62IDaG3XtwIcYornW__VLf4cZRgZPjJgtevwkozfUL3yb9QwuVc_WRU&amp;disp=emb&amp;realattid=ii_izpvup5l1_15a860a1718d9edf\" class=\"linkified\">https://mail.google.com/mail/u/1?ui=2&amp;ik=2da1788163&amp;attid=0.0.1&amp;th=15e8205688ec5119&amp;view=fimg&amp;rm=15e8205688ec5119&amp;sz=w1600-h1000&amp;attbid=ANGjdJ-sbMye3fxJIf1AXHMtUceQjksXjcUlHx9p_Mz14jiYCRg98D9S4xVgcGrr5FkMPIwt62IDaG3XtwIcYornW__VLf4cZRgZPjJgtevwkozfUL3yb9QwuVc_WRU&amp;disp=emb&amp;realattid=ii_izpvup5l1_15a860a1718d9edf</a></p> <p><a href=\"https://goo.gl/forms/kllPDSpCSzuJOX7I2\">Subscribe here</a> to receive biweekly event updates from Launchpad Space, Google's new event Space in SF where developers and startups can receive free technical training, one-on-one mentoring and more!</p> ","visibility":"public"},{"created":1511816861000,"duration":7200000,"id":"245447686","name":"A View State Machine for Network Calls on Android","rsvp_limit":100,"date_in_series_pattern":false,"status":"past","time":1512698400000,"local_date":"2017-12-07","local_time":"18:00","updated":1512710993000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":100,"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/245447686/","description":"<p>Speaker:</p> <p>Amanda Hill<br/>Senior Android Developer at Thoughtbot</p> <p>A not-at-all-recent grad from Cornell University, Amanda was born and raised in NYC but is now living with several houseplants in SF. She loves street vendor hot dogs, white sneakers, and taking pictures of food. She was the lead Android Dev at Venmo before moving over to the world of consulting where she now works at thoughtbot.</p> <p>Topic of the night:</p> <p>A View State Machine for Network Calls on Android</p> <p>Using Kotlin’s sealed classes, we can make a state machine for all UI-related to network calls. The reality of ever-changing design specs can, at times, be frustrating and miserable, but rather than focus on the negatives I like to think that it can also be a fun challenge in how we approach development. So today I am going to share some improvements I made to how I handle network requests in Android development to protect against UI changes.</p> ","visibility":"public"},{"created":1530044374000,"duration":9000000,"id":"252167252","name":"Introduction to Flutter + Live coding","rsvp_limit":200,"date_in_series_pattern":false,"status":"past","time":1533258000000,"local_date":"2018-08-02","local_time":"18:00","updated":1533271941000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":25885360,"name":"Google Launchpad","lat":37.787635803222656,"lon":-122.396728515625,"repinned":false,"address_1":"543 Howard St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94105","state":"ca"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/252167252/","description":"<p>Welcome back to another SF Android GDG tech meet up!</p> <p>This session will be focused on Flutter, the hot new cross platform framework from Google.</p> <p>Talk:</p> <p>Flutter is a new mobile app SDK that approaches apps like Unity approaches games. In this talk, we'll look at the fundamentals of Flutter, and we'll give the SDK a spin by implementing an app from scratch.</p> <p>Speaker:</p> <p>Filip Hracek</p> <p>Filip speaks, writes articles and builds sample code for Google and, more specifically, for Flutter and Dart. Previously, he lead Google's developer relations program in Central and Eastern Europe. Prior to Google, Filip was an independent IT instructor. In his spare time, he builds games, reads books, and occasionally enjoys pancakes.</p> <p>Hope to see you all there!</p> ","visibility":"public"},{"created":1536104396000,"duration":9000000,"id":"254392980","name":"What's new in Android Studio 3.2 and What's Coming in 3.3","rsvp_limit":150,"date_in_series_pattern":false,"status":"past","time":1539306000000,"local_date":"2018-10-11","local_time":"18:00","updated":1539323069000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":141,"venue":{"id":25885360,"name":"Google Launchpad","lat":37.787635803222656,"lon":-122.396728515625,"repinned":true,"address_1":"543 Howard St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94105","state":"ca"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/254392980/","description":"<p>TALK #1<br/>-----------<br/>Jerome Dochez from the Google Android Studio team will be presenting on the latest updates to Android Studio.</p> <p>About Jerome Dochez<br/>Jerome is the tech lead on the Android SDK team. He is the manager and technical lead for the Android Gradle Plugin. Previously Jerome was the architect of the GlassFish project at Sun Microsystems and Oracle.</p> <p>TALK #2<br/>-----------<br/>Title: Build is Fast in 3.2 but You Can Make it Faster</p> <p>Description: every major release of tools is expected to make things faster, and Android Studio is no exception. Build performance has always been in the center of attention and today with the release of version 3.2 and adopting the Gradle v4.10.2 we are one step closer to the ultimate 'Instant run'. Let's see how we can utilize new tools and what homework is left on us to make our apps compile faster both locally and on CI.</p> <p>About the speaker: Artem Chubaryan is a senior software engineer currently working at MOBITV. He loves optimizing things, squeezing out build performance from every line of code.</p> ","visibility":"public"},{"created":1539109091000,"duration":9000000,"id":"255397857","name":"Android Studio Tips and Tricks + Droidcon SF Pre-Party ","rsvp_limit":151,"date_in_series_pattern":false,"status":"past","time":1541556000000,"local_date":"2018-11-06","local_time":"18:00","updated":1542439839000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":151,"venue":{"id":25048533,"name":"Foursquare","lat":37.79044723510742,"lon":-122.40450286865234,"repinned":true,"address_1":"425 Bush Street, Suite 500","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/255397857/","description":"<p>Android Studio Tips and Tricks by Michael Bailey + Droidcon SF warm up where the Droidcon SF folks will make some announcements and have some ticket give aways for SF Android GDG members. Check out the Droidcon SF sessions and speakers here:<br/><a href=\"https://www.sf.droidcon.com/\" class=\"linkified\">https://www.sf.droidcon.com/</a></p> <p>Talk Abstract:<br/>Come learn about the new features and some tips and tricks to make you more productive. We will cover some features from the underlying IntelliJ platform.</p> <p>Speaker Bio:<br/>Michael Bailey is a Google Developer Expert and a Principal Engineer on the Android team responsible for American Express’ flagship consumer Android apps in the U.S. market. Development on these apps began in 2010. Since joining the company in 2008, Michael has worked on a number initiatives at American Express including analytics, enterprise content management, AmexLabs, iOS apps, international mobile applications, NFC payments, the U.S. homepage and the U.S. online card applications site. Michael holds a BS in Computer Science from Harvey Mudd College and an MS in Computer Science from the University of Southern California, where he specialized in computer security. Including the U.S. consumer apps that Michael works on, American Express has 8 Android apps in the U.S. Google Play Store (<a href=\"https://play.google.com/store/apps/developer?id=American%20Express\" class=\"linkified\">https://play.google.com/store/apps/developer?id=American%20Express</a>) and more in the international Play Stores.</p> ","visibility":"public"},{"created":1541121773000,"duration":36000000,"id":"256053758","name":"Android Dev Summit Viewing Party","date_in_series_pattern":false,"status":"past","time":1541608200000,"local_date":"2018-11-07","local_time":"08:30","updated":1541651674000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":1,"venue":{"id":23640066,"name":"AMC Metreon 16","lat":37.78515625,"lon":-122.40494537353516,"repinned":true,"address_1":"35 Fourth St Suite 3000","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/256053758/","description":"<p>Can't make it to the Android Dev Summit this year? No problem! Come watch the sessions in your local movie theatre with the rest of the community!</p> <p>Reserve your spot here: <a href=\"https://events.withgoogle.com/android-dev-summit-viewing-parties/\" class=\"linkified\">https://events.withgoogle.com/android-dev-summit-viewing-parties/</a></p> <p>You will get confirmation from Google once your spot is reserved.</p> <p>See you there!</p> ","visibility":"public"},{"created":1543946659000,"duration":9000000,"id":"256944998","name":"Android at Scale Holiday Panel Discussion w/ Pinterest, Square, Twitter, Uber","rsvp_limit":150,"date_in_series_pattern":false,"status":"past","time":1544752800000,"local_date":"2018-12-13","local_time":"18:00","updated":1544767006000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":25732414,"name":"pinterest","lat":37.777587890625,"lon":-122.396728515625,"repinned":true,"address_1":" Pinterest 505 Brannan Street","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94107","state":"ca"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/256944998/","description":"<p>For our final SF Android GDG event of the year we have planned a special holiday event to close out the year with an Android at Scale panel discussion. We have picked engineers who have had a lot of experience on this topic working on large scale Android apps and the challenges that come with that. The panel members are Cesar Puerta (Twitter), Thorben Primke (Pinterest), Zach Klippenstein (Square), and Andreas Nomikos (Uber).</p> <p>Building an app with a small team is straight forward with mature tooling and straight forward processes, but what works for a small team doesn't always work for a large one. Some companies now have hundreds of mobile engineers! What happens when these teams and projects outgrow the standard tooling? For this meetup, we'll be hosting a panel of speakers from HUGE Android teams to to learn about how they organize, build software, their scale related pain points, and what tooling they've build to grow.</p> <p>Special thanks to the Pinterest Android team for sponsoring event, letting us use their beautiful venue, providing food and drinks, etc.</p> <p>About the Panel members</p> <p>Andreas Nomikos is a Software Engineer at Uber working on delivering smart and connected e-Bikes &amp; Scooters to a city near you. He focuses on architectures and processes that promote rapid iteration and steady progress in dynamic environments. Previous stints include Android product and infrastructure at Facebook and web development at Linkedin.</p> <p>Cesar Puerta is the Technical lead for Twitter for Android, overseeing the architecture of the application. He focuses on helping teams collaborate on such a large-scale project, and on the migration of shared infrastructure towards design patterns which incorporate modern techniques such as dependency injection through Dagger and decoupled, modularized, and testable components.</p> <p>Thorben Primke is a Software Engineer at Pinterest working on topic based discussions and making collaboration easier. Prior to Pinterest, Thorben has worked on Android at Facebook, Gowalla and Jelly.</p> <p>Zach Klippenstein is a Software Engineer on the Square Android team. Crafting tools to make Square's apps as simple to build as they are to use.</p> <p>Our moderator: Joaquim Verges. Joaquim is an Android fanatic working at Twitch, previously Twitter. Creator of Falcon Pro, Hacked and Flyne. Co-organizer of the SF Android GDG.</p> ","visibility":"public"},{"created":1549410479000,"duration":9000000,"id":"258714770","name":"Forging Android by Sanae from Android @ Yelp","date_in_series_pattern":false,"status":"past","time":1552010400000,"local_date":"2019-03-07","local_time":"18:00","updated":1552022110000,"utc_offset":-28800000,"waitlist_count":0,"yes_rsvp_count":175,"venue":{"id":26050674,"name":"Yelp Corporate Headquarters","lat":37.78666305541992,"lon":-122.39997100830078,"repinned":false,"address_1":"140 New Montgomery St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94105","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/258714770/","description":"<p>For our next SF Android GDG we Sanae Rosen from the Yelp Android team talking about \"Forging Android\". Thanks to the Yelp Android team for providing their amazing space for the meetup and sponsoring food/drinks.</p> <p>AGENDA:<br/>6 - 6:45pm - Socializing/Networking<br/>6:45-7pm - Announcements<br/>7 - 8pm - Forging Android talk + Q&amp;A<br/>8 - 8:30pm - Socializing/Networking</p> <p>DESCRIPTION:</p> <p>Learn how our Android infrastructure team evolved from fighting fires to forging the tools that make Android development a great experience. Despite our &gt; 1M LOC codebase, over the past few years we’ve introduced weekly releases, 20s incremental builds, 120s clean builds, and run 6k tests on merge in ~ 20 minutes. At the same time we’ve been building a cross-team Android community that ensures we focus on the problems that matter to developers and allows us to build the future of the app together.</p> <p>ABOUT THE SPEAKER</p> <p>Sanae Rosen<br/>Software Engineer at Yelp</p> <p>Sanae Rosen is a software engineer on the Core Android team at Yelp, where she has worked on topics ranging from modularization and networking to testing and build infrastructure. Previously, she graduated with a PhD from the University of Michigan, with a focus on improving networking performance in mobile systems.</p> ","visibility":"public"},{"created":1552017641000,"duration":7200000,"id":"259585686","name":"Double tech talk @ Instagram: Coroutines + Drawables","rsvp_limit":150,"date_in_series_pattern":false,"status":"past","time":1554253200000,"local_date":"2019-04-02","local_time":"18:00","updated":1554263942000,"utc_offset":-25200000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":26231035,"name":"Instagram","lat":37.7898063659668,"lon":-122.39535522460938,"repinned":false,"address_1":"181 Fremont St","city":"San Francisco","country":"us","localized_country_name":"USA","zip":"94105","state":"CA"},"group":{"created":1242247621000,"name":"The San Francisco Android GDG","id":1455557,"join_mode":"open","lat":37.790000915527344,"lon":-122.41999816894531,"urlname":"sfandroid","who":"Android Developers","localized_location":"San Francisco, CA","state":"CA","country":"us","region":"en_US","timezone":"US/Pacific"},"link":"https://www.meetup.com/sfandroid/events/259585686/","description":"<p>⚠️⚠️⚠️ RSVP for this event is done through: <a href=\"https://igsfandroidmeetup.splashthat.com\" class=\"linkified\">https://igsfandroidmeetup.splashthat.com</a> (password: IGSF) ⚠️⚠️⚠️</p> <p>Join us on Tuesday, April 2nd at the new Instagram San Francisco office for our next GDG Android meet-up. This will be a great opportunity to meet Instagram's Android engineers and network with folks from the Android community.</p> <p>We'll serve light apps and drinks and start the event promptly at 6pm.<br/>As we'll have limited capacity, please RSVP on <a href=\"https://igsfandroidmeetup.splashthat.com\" class=\"linkified\">https://igsfandroidmeetup.splashthat.com</a> page as soon as possible to secure your spot! (password: IGSF)</p> <p>AGENDA:<br/>6 - 6:45pm - Socializing/Networking<br/>6:45-7pm - Announcements<br/>7 - 8pm - Android talk + Q&amp;A<br/>8 - 8:30pm - Socializing/Networking</p> <p>EVENT DESCRIPTION:<br/>We'll be hosting two exciting talks.</p> <p>1. Fun with Drawables<br/>Learn about all the amazing things you can do with Drawables!</p> <p>2. Kotlin Coroutines and Channels: From 0 to 💯<br/>We all know multithreaded application development can make you 🤔😡. Chasing down deadlocks and race conditions can keep you up at night. But Kotlin introduces another way to tackle the problem. This talk introduces the fundamentals of both Coroutines and Channels with a simple Coffee Shop analogy. It'll take you from the foundation to a few different approaches on solving common problems. See how you can add Coroutines and Channels to your toolbox of asynchronous programming.</p> <p>SPEAKERS:</p> <p>Will Bailey<br/>Software Engineer at Instagram</p> <p>Will Bailey is an Android engineer at Instagram who enjoys building delightful UI and giving the occasional tech talk.</p> <p>Jag Saund<br/>Software Engineer at Instagram</p> <p>Jag Saund is a Software Engineer at Instagram. He has 10 years of experience with the Android platform and specializes in Application architecture and the Camera framework. His past experiences include work on the audio and video stack at Amazon and Twitter (Periscope). With a passion to understand the inner workings of Android, he strives to maximize the platform's potential. In his spare time, he enjoys pursuing photography, road biking, and tinkering with hardware projects.</p> ","how_to_find_us":"Check-in with security in the lobby and follow the instructions!","visibility":"public"}],"organizers":[{"id":34630902,"name":"Ty S.","bio":"Android at @Uber Dev Platform - Google Developer Expert - @specializedtype investor - @sfaug and @droidconsf organizer - ex @twitter @fabric @evernote @zagat","status":"active","joined":1326070253000,"city":"San Francisco","country":"us","localized_country_name":"USA","state":"CA","lat":37.76,"lon":-122.44,"photo":{"id":245414035,"highres_link":"https://secure.meetupstatic.com/photos/member/3/6/d/3/highres_245414035.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/3/6/d/3/member_245414035.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/3/6/d/3/thumb_245414035.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1551973290000,"created":1326070825000,"updated":1533312358000,"role":"organizer","group":{"id":1455557,"urlname":"sfandroid","name":"The San Francisco Android GDG","status":"active","who":"Android Developers","members":4747,"join_mode":"open","localized_location":"San Francisco, CA","group_photo":{"id":301493022,"highres_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/highres_301493022.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/600_301493022.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/thumb_301493022.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"intro":"Android at @Uber Dev Platform - Google Developer Expert - @specializedtype investor - @sfaug and @droidconsf organizer - ex @twitter @fabric @evernote @zagat","link":"https://www.meetup.com/sfandroid/members/34630902/"},"is_pro_admin":false},{"id":40278562,"name":"Joaquim V.","status":"active","joined":1330699680000,"city":"San Francisco","country":"us","localized_country_name":"USA","state":"CA","lat":37.78,"lon":-122.42,"photo":{"id":74450272,"photo_link":"https://secure.meetupstatic.com/photos/member/c/4/6/0/member_74450272.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/c/4/6/0/thumb_74450272.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1554745747000,"created":1381463867000,"updated":1481584398000,"role":"coorganizer","group":{"id":1455557,"urlname":"sfandroid","name":"The San Francisco Android GDG","status":"active","who":"Android Developers","members":4747,"join_mode":"open","localized_location":"San Francisco, CA","group_photo":{"id":301493022,"highres_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/highres_301493022.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/600_301493022.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/thumb_301493022.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"intro":"Android Fanatic. Working for Twitter. Developer of Falcon Pro, Hacked and Flyne.","link":"https://www.meetup.com/sfandroid/members/40278562/"},"is_pro_admin":false},{"id":185942488,"name":"Rooz M.","bio":"Gradle Developer Advocate","status":"active","joined":1428440341000,"city":"Burlingame","country":"us","localized_country_name":"USA","state":"CA","lat":37.57,"lon":-122.36,"photo":{"id":245165040,"highres_link":"https://secure.meetupstatic.com/photos/member/1/3/b/0/highres_245165040.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/1/3/b/0/member_245165040.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/1/3/b/0/thumb_245165040.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1554762975000,"created":1428441047000,"updated":1530397611000,"role":"coorganizer","group":{"id":1455557,"urlname":"sfandroid","name":"The San Francisco Android GDG","status":"active","who":"Android Developers","members":4747,"join_mode":"open","localized_location":"San Francisco, CA","group_photo":{"id":301493022,"highres_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/highres_301493022.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/600_301493022.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/thumb_301493022.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"link":"https://www.meetup.com/sfandroid/members/185942488/"},"is_pro_admin":false},{"id":187779814,"name":"Pierre-Yves R.","status":"active","joined":1432572207000,"city":"San Francisco","country":"us","localized_country_name":"USA","state":"CA","lat":37.77,"lon":-122.41,"photo":{"id":246463952,"highres_link":"https://secure.meetupstatic.com/photos/member/a/b/b/0/highres_246463952.jpeg","photo_link":"https://secure.meetupstatic.com/photos/member/a/b/b/0/member_246463952.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/member/a/b/b/0/thumb_246463952.jpeg","type":"member","base_url":"https://secure.meetupstatic.com"},"group_profile":{"status":"active","visited":1544289767000,"created":1489176521000,"updated":1533314872000,"role":"coorganizer","group":{"id":1455557,"urlname":"sfandroid","name":"The San Francisco Android GDG","status":"active","who":"Android Developers","members":4747,"join_mode":"open","localized_location":"San Francisco, CA","group_photo":{"id":301493022,"highres_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/highres_301493022.jpeg","photo_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/600_301493022.jpeg","thumb_link":"https://secure.meetupstatic.com/photos/event/c/f/1/e/thumb_301493022.jpeg","type":"event","base_url":"https://secure.meetupstatic.com"}},"link":"https://www.meetup.com/sfandroid/members/187779814/"},"is_pro_admin":false}]}
